{
    "id": 1771657212,
    "date": "2026-02-21",
    "title": "2 ‘exogenous shocks’ needed to boost stocks from lofty levels: BofA’s Hartnett",
    "summary": "BofA strategists predict that only a Middle East regime change ensuring abundant oil and a US-China trade deal can sustain current equity levels. This reliance on continued oil supply undermines emissions reduction efforts. Investors should be wary of betting on fossil fuels for future profits.",
    "content": "Bank of America (BofA) strategist Michael Hartnett said equities may need “two exogenous shocks” to push meaningfully higher from current elevated levels.\n\nIn the latest Flow Show report, Hartnett said that risk assets would likely require a “regime change in Middle East to secure abundant future oil supply and collapse in oil price” alongside a “Trump-Xi U.S.-China trade deal in April to reduce tariffs and improve Trump approval rating.”\n\nHartnett said positioning and profit expectations are flashing contrarian signals, noting that “positioning (extreme bull) & profits (consensus = boom) both say ‘sell’ stocks & credit; policy (tax & rate cuts) says ‘buy-any-dip.’”\n\nOn sentiment, the firm’s Bull & Bear Indicator eased to 9.4 from 9.5 but remained firmly in “extreme bull” territory. The elevated reading reflects sustained inflows to global stock ETFs and tech funds alongside strong global equity breadth, Hartnett said.\n\nHistorically, such levels have been associated with weaker near-term returns. The strategist noted that in past instances when the indicator rose above 9.5, the median three-month drawdown was about 4.3% for the , 5.5% for the and 8.6% for the .\n\nFlow data still showed solid risk appetite. In the latest week, equities drew $35.2 billion, bonds took in $26.4 billion and cash funds attracted $23.8 billion. Gold funds saw $1.4 billion of outflows — the largest in four months — while crypto funds lost $0.8 billion.\n\nIn other notable trends, BofA highlighted record four-week inflows into international equities of $64.6 billion and the largest six-week inflow ever into Korean equities.",
    "source_url": "https://www.hellenicshippingnews.com/2-exogenous-shocks-needed-to-boost-stocks-from-lofty-levels-bofas-hartnett/",
    "source": "hellenicshippingnews.com",
    "score": 10
}