{
    "id": 1771225227,
    "date": "2026-02-16",
    "title": "Absolute Zero Emissions Shipping News",
    "summary": "The Zero Emission Ship Technology Association (ZESTA) touts \"momentum\" towards absolute zero emissions, but offers no concrete details. Their mention of \"synergy\" between BBNJ and IMO is likely greenwashing, as the IMO has consistently failed to curb shipping emissions. ZESTA's ShipZERO workshop in Türkiye will likely be another talk shop without tangible action on HFO usage or carbon intensity reduction.",
    "content": "Despite a rather rocky geopolitical kick-off, 2026 continues to build momentum toward Absolute Zero emissions globally.\n\nThe year started strong with the entry into force of the UN Biodiversity Beyond National Jurisdiction (BBNJ) Agreement. An external force will pressure shipping to respect the health of our ocean, supporting the uptake of Absolute Zero emissions technologies and energy systems. ZESTAs will leverage our position at the IMO to support a dedicated cooperation process, ensuring that BBNJ and IMO operate in synergy rather than in isolation.\n\nUp until now, we have seen pilots and isolated projects. Last year, we saw hydrogen production and maritime shipping projects cancelled, “cutting the wheat from the chaff”, leaving solid projects at scale. The uptake of wind propulsion is increasing steadily. The number and the size of fully electric vessels are increasing exponentially. 2026 will see many more and much larger projects, as well as the start of true zero-emissions ecosystem development on a global scale. To support this momentum, ZESTAs is adding several new working groups. More details next month. The first to get underway this year is our WG on autonomous vessels, led by Dr. Beatriz Canamary of SeaTrain. Members, contact the ZESTAs Secretariat if you’re interested in joining the WG.\n\nWe will be holding this year’s ShipZERO Workshop in Türkiye, the shipbuilding capital of Europe, in conjunction with COP31. ZESTAs will organise online workshops to bring stakeholders together, laying the groundwork for a productive event. Watch this space to be part of it.",
    "source_url": "https://www.hellenicshippingnews.com/absolute-zero-emissions-shipping-news/",
    "source": "hellenicshippingnews.com",
    "score": 87
}