{
    "id": 1771484424,
    "date": "2026-02-19",
    "title": "Administration’s Maritime Action Plan misses defining an opportunity to strengthen US shipping competitiveness and capture emerging clean maritime markets",
    "summary": "The Maritime Action Plan prioritizes legacy technologies, neglecting zero-emission vessels and risking competitiveness. Rolling back environmental oversight near ports will disproportionately burden already polluted communities. A proposed \"ship tax\" on foreign-built ships, estimated to generate $66 billion over 10 years, may trigger retaliatory tariffs.",
    "content": "The Trump administration released the Maritime Action Plan (MAP) on February 13, 2026, a long-anticipated federal blueprint to revive the American shipbuilding industry amid growing global competition. Yet, for all its ambition, the plan largely focuses on rebuilding capacity around legacy technologies, offering little indication that the federal government is preparing the U.S. industry for next-generation, zero-emission vessels already reshaping global maritime markets and rapidly becoming the benchmark for maritime competitiveness.\n\nThe plan’s simultaneous push to scale up maritime activity, while rolling back environmental oversight raises serious concerns for the roughly 12% of Americans who live near seaports in communities already bearing disproportionate pollution burdens. You cannot build a generational workforce in communities you are simultaneously making less livable. Without a unifying vision that integrates economic, security, environmental and public health priorities the plan risks falling short of its own ambitions.\n\nAmong the MAP’s most consequential proposals is once again a universal fee or “ship tax” on foreign-built ships based on cargo weight — a measure they claim will generate between $66 billion and $1.5 trillion over 10 years to fund a Maritime Security Trust Fund. Economists are likely to view this as a de facto tariff on maritime trade, with costs passed ultimately to American consumers through retailers and importers, carrying the potential to invite retaliation from trading partners.\n\nMandated by a 2025 Executive Order signed by President Trump, the strategy centers on rebuilding U.S. maritime capacity and restoring resilience to the domestic shipbuilding industry. According to the administration, less than 1% of new commercial ships are built in the United States — a stark indicator of the nation’s diminished shipbuilding capacity. With only 66 shipyards nationwide — consisting of just eight active shipbuilding yards, 11 shipyards with build positions, 22 repairs yards with drydocking capability, and 25 topside repairs yards — the United States lacks the industrial infrastructure necessary to scale domestic shipbuilding to the rate required to meet growing economic, security and strategic demands.\n\nThe MAP acknowledges these structural realities and proposes a sweeping set of actions intended to modernize shipyards, expand dry docks, leverage AI and automation, create new tax incentives and federal financing tools, expand cargo preference requirements, and develop a Strategic Commercial Fleet of U.S.-built and U.S.-flagged vessels to ensure sealift readiness and trade continuity. The plan explicitly identifies China as a strategic threat to American maritime dominance and places significant emphasis on autonomous and robotic vessels, Arctic strategy, and workforce expansion through maritime academies and new credentialing pipelines. Notably, much of the foreign investment the MAP celebrates comes from nations — including Finland — whose own shipbuilding industries are racing toward zero-emission compliance, a standard the MAP itself conspicuously does not address.\n\nStatement from Antonio Santos, Federal Climate Policy Director, Pacific Environment:\n\n“While the Trump administration’s Maritime Action Plan seeks to revitalize domestic shipbuilding and exert greater control over global supply chains, the plan lacks a clear commitment to ensuring this new ‘Maritime Golden Age’ in the U.S. is powered by sustainable maritime fuels and next-generation vessels. United States leadership in the development and deployment of cleaner ships is a critical strategy to national energy security, long-term economic competitiveness and creating high-quality manufacturing jobs.\n\n“To truly become a global maritime leader, the U.S. must do more than just build more ships; it must invest in innovation to build the cleanest and most efficient fleet in the world. Zero-emission vessels are rapidly becoming the global benchmark for maritime competitiveness.”\n\nShipowners, financiers and trading partners around the world are already making decisions based on clean maritime standards. The International Maritime Organization’s net-zero framework negotiations are setting the terms of global maritime competition — and the shipyards and nations positioned to build compliant vessels will capture that market. A plan that ignores this reality risks locking the United States into technologies that the rest of the world is moving away from, undermining the very competitiveness it seeks to restore. The MAP proposes to build the hardware of the future on the fuel architecture of the past — and in doing so, risks ceding the most valuable segment of the emerging maritime market before America has even re-entered the race.\n\nStatement from Davina Hurt, Climate Policy Director, Pacific Environment:",
    "source_url": "https://www.hellenicshippingnews.com/administrations-maritime-action-plan-misses-defining-an-opportunity-to-strengthen-us-shipping-competitiveness-and-capture-emerging-clean-maritime-markets/",
    "source": "hellenicshippingnews.com",
    "score": 96
}