{
    "id": 1771225210,
    "date": "2026-02-16",
    "title": "Ammonia technology moves closer to powering deep-sea shipping",
    "summary": "Everllence's new ME-LGIA dual-fuel engine, rated at 10-15 MW, is slated for use in seven ships, but ammonia's lifecycle emissions remain a concern. Ammonia's high toxicity necessitates specialized handling, potentially increasing operational costs and risks. Despite \"zero-carbon\" claims, the true carbon intensity hinges on the ammonia production method, demanding scrutiny.",
    "content": "Ammonia propulsion is moving from concept to commercial reality as several engine developers bring dual‑fuel designs to market. Everllence’s new ME‑LGIA engine integrates advanced safety barriers, digital connectivity, and fuel flexibility, marking a significant step towards practical zero‑carbon deep‑sea shipping.\n\nAs the maritime industry accelerates towards decarbonization, the transition to low greenhouse gas fuels is essential. Liquefied natural gas and methanol have led the way, but ammonia is making some strides. With three ammonia-capable ships already in operation and another 45 on order, momentum is building.\n\nDriving decarbonization with ammonia\n\nAmmonia offers compelling advantages. It is carbon-free at the point of combustion and can significantly reduce overall emissions when produced from renewable sources. Its volumetric energy density makes it suitable for deep-sea shipping, where long voyages demand robust fuel solutions.\n\nHowever, adoption is not without hurdles. Ammonia’s high toxicity and corrosive nature require stringent safety measures and specialized handling protocols, far beyond those for conventional fuels. Questions around bunkering infrastructure, crew training, and life-cycle emissions remain critical. Nonetheless, ammonia represents a viable option for the future of shipping if these challenges can be solved.\n\nEngine developers commit to ammonia\n\nAs momentum gathers, engine manufacturers are stepping up to develop propulsion systems suited for ammonia.\n\nWinGD and J-ENG delivered their first dual-fuel two-stroke engines in late 2025, followed by Everllence in early 2026, while Hyundai’s HiMSEN H22CDF-LA four-stroke engine has already achieved multiclass approval.\n\nAmong the vessels on order, seven, including those from shipowners such as Höegh Autoliners and Eastern Pacific Shipping, will feature Everllence’s newly launched two-stroke ammonia engines, rated at 10–15 megawatts.\n\nIntroducing the ME-LGIA ammonia dual-fuel engine\n\nThe Everllence ME-LGIA (liquid gas injection ammonia) dual-fuel engine marks a major milestone for zero-carbon propulsion. Based on the diesel principle, the engine employs a liquid gas injection concept, enabling operation on both ammonia and conventional fuels. This flexibility supports shipowners during the transition phase, allowing vessels to switch between fuel types as infrastructure and supply chains mature.\n\nHrishikesh Chatterjee, Senior Promotion Manager – Newbuildings at Everllence, explains: “Our ME-LGIA engine is designed to deliver the same reliability and efficiency as our conventional two-stroke engines, while enabling shipowners to take a decisive step towards zero-carbon operations. Safety and digitalization have been at the core of this development.”\n\nIntegrated safety barriers and digital connectivity for secure ammonia operations\n\nTo address ammonia’s unique safety challenges, Everllence has integrated double-walled piping with continuous ventilation and monitored airflow routed to treatment systems.\n\nFeatures such as the ammonia release mitigation system and the ammonia catch system, incorporating a knockout drum and watercolumn scrubbing, help ensure that any leaks are contained and neutralized before they can reach occupied spaces. The fuel valve train, which includes double block and bleed isolation supported by nitrogen purging routines, adds an additional layer of failsafe protection for both crew and vessel.\n\nFurthermore, the engine is digitally connected, enabling secure real-time data flow from vessels to Everllence’s shore-based monitoring systems. This connectivity supports remote assistance and operational optimization, reducing downtime and improving reliability.\n\nEngineering effort and extensive testing\n\nThe development of the ME-LGIA engine reflects a significant engineering commitment. Since July 2023, Everllence has invested over 150,000 hours in design and validation, conducting more than 800 tests to ensure performance and safety. These tests covered combustion behaviour, emissions profiles, material compatibility, and failure-mode analysis under varying operational conditions.\n\nThe multi-year research and development programme included combustibility investigations, formal hazard identification (HAZID) and hazard and operability (HAZOP) studies, as well as full-scale bunkering and engine trials. “One of the most important lessons learned in the evolution of engine models has been the value of a robust, modular platform as the foundation for innovation,” Chatterjee highlights. “Our ME-C platform has proven to be a trusted and adaptable base for developing advanced dual-fuel technologies, supporting scalable upgrades and systematic dual‑fuel additions, ensuring future upgrades or retrofits.”\n\nMaterial selection also played a key role, with corrosive alloys such as copper and high nickel avoided to prevent degradation when exposed to ammonia, ensuring the long‑term integrity of critical components. Integrated aftertreatment supports compliance with nitrogen oxide (NOₓ) limits while controlling ammonia slip. “We have tested extensively to ensure the engine meets the highest standards for safety and performance,” says Chatterjee. “Our goal was to make ammonia propulsion not only viable but practical for shipowners looking to future-proof their fleets.”\n\nEngine tests confirm high efficiency and emissions compliance\n\nTest results are encouraging: the thermal efficiency of ammonia remains comparable to diesel, indicating no performance penalty, while emissions remain well controlled. Ammonia slip stays below regulatory limits, NOₓ meets Tier II and Tier III requirements with abatement, and nitrous oxide formation is intrinsically low, supporting greenhouse gas reductions of more than 90 per cent. But life-cycle emissions also warrant attention. To achieve true zero-carbon status, ammonia must be produced using renewable energy sources, such as green hydrogen via electrolysis. This requirement underscores the need for integrated strategies across the energy and maritime sectors.\n\nEarly candidate vessels for ammonia dual‑fuel engines\n\nAmmonia dual‑fuel engines are best suited to deep‑sea merchant vessels with low‑speed, two‑stroke propulsion. Large engine dimensions and longer combustion durations favour slower‑burning fuels such as ammonia. This includes bulk carriers, tankers, particularly very large gas carriers, large container vessels, and pure car and truck carriers, especially on high‑utilization routes where charterer demand and decarbonization premiums support early adoption.\n\nWhile newbuilds offer optimal integration, retrofits provide a flexible and capital‑efficient pathway to upgrade existing assets, enabling owners to manage investment risk while meeting future environmental requirements.\n\nOperational considerations to solve\n\nWhile the ME-LGIA engine represents a breakthrough, operational readiness depends on several factors. Crew training is paramount, given the toxicity of ammonia and the complexity of its handling. Everllence is working with classification societies and training providers to develop comprehensive training programmes covering fuel management, emergency response, and maintenance procedures.\n\nBunkering infrastructure is another critical enabler. Ports must invest in dedicated ammonia storage and transfer systems, incorporating robust safety protocols. Collaboration between engine developers, shipowners, and port authorities will be essential to ensure a smooth transition.\n\nA step towards zero-carbon shipping\n\n“The launch of Everllence’s ammonia engine adds real momentum to overcoming technical challenges and advancing ammonia as a viable pathway within the broader decarbonization strategy for shipping. By combining proven dual‑fuel architecture with enhanced safety systems and digital connectivity, Everllence has created an engine solution that is practical and secure,” says Jason Stefanatos, Global Decarbonization Director at DNV. “With continued innovation to address technical and safety considerations, and with the right infrastructure and regulatory clarity, ammonia‑powered vessels can become a valuable part of deep‑sea decarbonization.”",
    "source_url": "https://www.hellenicshippingnews.com/ammonia-technology-moves-closer-to-powering-deep-sea-shipping/",
    "source": "hellenicshippingnews.com",
    "score": 228
}