{
    "id": 1771570812,
    "date": "2026-02-20",
    "title": "An overview of BIMCO’s Emissions Trading Scheme Clause for Memoranda of Agreement 2025",
    "summary": "BIMCO's ETS clause for vessel sales puts responsibility for emissions reporting and allowance surrender squarely on the seller up to the point of delivery. This contrasts sharply with FuelEU Maritime, where buyers inherit the seller's compliance balance, a potential financial liability. Will this clause prevent sellers from offloading polluting vessels just before FuelEU Maritime penalties kick in?",
    "content": "The BIMCO Emissions Trading Scheme Clause for Memoranda of Agreement 2025 was formally adopted in December 2025, reflecting BIMCO’s commitment to providing clear and practical contractual tools that address the growing complexity of environmental regulation in the sale and purchase of vessels. Developed by a BIMCO subcommittee comprising shipowners, brokers, legal specialists, and P&I experts, and supported by broad stakeholder consultation, the clause offers a clear and practical framework for allocating responsibilities between buyers and sellers of vessels falling within the scope of an emissions trading scheme.\n\nThe clause builds on the established terminology of earlier ETS clauses and maintaining the scope to cover any applicable emission scheme(s) worldwide extending beyond the European Emission Trading Scheme (EU ETS) and anticipating future cap and trade mechanisms adopted by competent authorities.\n\nSellers’ Obligations Prior to Delivery\n\nUnder the clause, the sellers are responsible for compliance up to and including the moment of delivery. This includes fulfilling all reporting obligations required under the relevant emission scheme(s) and, where applicable, submitting a verified partial emission report that sets out the vessel’s emissions for the portion of the reporting period during which they owned the vessel. Sellers also remain responsible for surrendering the emission allowances corresponding to all predelivery emissions. This structure ensures that no emissions-related liabilities arising before delivery are transferred to the buyers.\n\nImportantly, this approach differs from the regime under FuelEU Maritime. Whereas the EU ETS places predelivery liabilities with the sellers, FuelEU Maritime requires the buyers to assume the sellers’ accrued compliance balance at delivery, meaning these liabilities must be financially settled between the parties at the time ownership transfers.\n\nTransfer of Responsibilities to Buyers\n\nFrom the point of delivery, buyers take on full responsibility for the vessel’s compliance under the applicable emission scheme(s). This includes the obligation to surrender allowances for emissions generated after delivery and to fulfil any ongoing reporting requirements. By ensuring that the transfer of obligations aligns exactly with the transfer of ownership, the clause provides a smooth and predictable compliance transition. This clarity is particularly important in sale and purchase transactions where uncertainty can otherwise arise over which party is accountable for portions of the reporting period.\n\nUnder the clause, the sellers must indemnify and hold the buyers harmless against any and all claims, losses, damages, or liabilities that may be incurred by, or alleged against, the buyers and/or the vessel under any emission scheme(s), or that arise from, or are connected with, any non-compliance or failure to surrender emission allowances under the applicable emission scheme(s).\n\nAs outlined above, this indemnity is unlikely to be triggered under the EU ETS, as all liabilities for the period prior to delivery remain with the sellers, and the buyers do not inherit any predelivery compliance obligations. However, it is important to recognise that future emission trading schemes may adopt different mechanisms. Including an indemnity provision was therefore essential to futureproof the clause and ensure the parties remain protected should regulatory schemes evolve.\n\nConclusion\n\nThe adoption of the Emissions Trading Scheme Clause for Memoranda of Agreement 2025 provides the maritime industry with a structured, transparent and future-oriented approach to managing emissions compliance during vessel ownership transfers. By clearly assigning responsibilities to sellers and buyers, introducing a verified reporting mechanism, and anticipating multiple emission scheme(s), the clause ensures contractual certainty in a regulatory landscape where such certainty is increasingly essential.",
    "source_url": "https://www.hellenicshippingnews.com/an-overview-of-bimcos-emissions-trading-scheme-clause-for-memoranda-of-agreement-2025/",
    "source": "hellenicshippingnews.com",
    "score": 106
}