{
    "id": 1771311629,
    "date": "2026-02-17",
    "title": "Arctic Council working group reveals 40% increase in ships in the Arctic",
    "summary": "Arctic shipping distances have surged 95% since 2013 to 11.9 million nautical miles, driven by melting sea ice and extended navigation seasons. Crude oil tanker traffic saw a shocking 396% increase, raising concerns about potential spills and black carbon emissions. Increased resource extraction suggests more heavy fuel oil (HFO) use, likely worsening the carbon intensity of Arctic voyages.",
    "content": "As explained, comparing 2013 to 2025, the distance sailed by ships in the Arctic Polar Code Area increased 95%, from 6.1 million to 11.9 million nautical miles. The distance represents the aggregate sailed for each ship in nautical miles.\n\nThe increase in shipping coincides with diminishing sea ice in the Arctic. The number of unique ships entering the Arctic Polar Code area is generally highest in the month of September, when Arctic sea ice is at its lowest extent.\n\nThe term unique ships refers to each ship only counted once, although many ships enter the area multiple times each year.\n\nIn September 2025,1060 ships entered the Polar Code area out of the total 1812 ships that entered the entire year, amounting to 58% of traffic.\n\nTypes of ships in the Arctic\n\nFishing vessels are the most common type of ship in the Arctic, representing 40% of all ships that entered the Arctic Polar Code area. The second most common ship type is general cargo ships.\n\nBetween 2013 and 2025, the ship type that saw the greatest increase in the Arctic was crude oil tankers, which saw a 396% increase over the 12 years. The second greatest increase was bulk carriers with 156% more in 2025 than in 2013.\n\nCruise ships have also increased significantly, with 123% more cruise ships in 2025 than in 2013.\n\nWhy is Arctic shipping increasing?\n\nChanges to the marine environment, such as a decrease in the extent of sea ice and the loss of older, thick ice, have significant implications for longer navigation seasons and new access to previously difficult to reach regions of the Arctic.\n\nHjalti Hreinsson, Deputy Secretary at PAME who administers the ASTD System, shares some insight into why we are seeing the trends in PAME’s Arctic Shipping Status Reports.\n\nSeveral reasons contribute to the increase in Arctic shipping. One of them, and perhaps the most prominent one, is an increase in natural resource extraction. Compared to other marine areas worldwide, there aren’t that many ships in the Arctic, and new projects will strongly impact statistics.\n\n…said Hjalti Hreinsson.\n\nFor example, two large projects – the Mary River Mine in Nunavut and the Yamal Gas project – have led to increases in shipping in the Arctic Polar Code area. The number of bulk carriers has significantly increased as has the traffic of gas tankers, of which there were almost none in the Polar Code area prior to 2018. There is also a rise in Arctic cruise tourism, demonstrated by the increase of vessels in the high north.”\n\nThe Mary River Mine began operations in 2015 to mine one of the world’s richest iron ore deposits. Consequently, bulk carrier traffic has increased substantially. In the Baffin Bay area, where the Mary River Mine is accessed, bulk carriers have increased by 540%.\n\nIn 2025, bulk carriers sailed 130,684 nautical miles compared to just 3,559 nautical miles in 2013 before the project began.\n\nFurthermore, the Yamal Gas Project encompasses natural gas production, liquefaction and shipping. Prior to the launch of the Yamal LNG project in Russia, the volume of gas tankers in the Arctic Polar Code area was minimal.\n\nNow, several tankers transport gas from Yamal directly to foreign markets, including to Asia.\n\nA total of 15 LNG carriers were custom-designed and built for the Yamal LNG project to support year-round navigation. The number of unique gas tankers in the Polar Code area in 2025 were 40.",
    "source_url": "https://safety4sea.com/arctic-council-working-group-reveals-40-increase-in-ships-in-the-arctic/",
    "source": "safety4sea.com",
    "score": 57
}