{
    "id": 1771016375,
    "date": "2026-02-13",
    "title": "Bad start to the New Year for the container shipping companies",
    "summary": "Container lines are increasing Energy Transition Surcharges to $170 per 40' dry container due to expanding EU ETS obligations. These ETS obligations now include methane and nitrous oxide, alongside CO2 emissions, increasing costs. Surcharges will be adjusted quarterly based on carbon prices, but expect further increases as FuelEU Maritime penalties begin.",
    "content": "BAROMETER. Spot freight rates began falling again in mid-January as pre-Chinese New Year transport capacity finally outstripped demand, despite the latter being sustained. Revenue per container fell for the shipping companies, while operating costs remain on an upward curve.Main developments\n\nIncrease in energy transition surcharges\n\nThe shipping companies have announced big increases in the European Union’s Energy Transition Surcharge (ETS) which is supposed to cover the costs generated by the EU Emissions Trading System (EU ETS) and the FuelEU Maritime regulations. The companies justified the increases by the heavier obligations placed on them by the EU ETS. From 2026 on, they have to include all their emissions in the scheme, compared to 75% in 2025 and 40% in 2024. The field of application of the system has also been widened to include methane and nitrogen protoxide, as well as CO². The companies also point out that they have incurred extra costs in meeting the requirements of the FuelEU regulation because of changing biofuel prices. The result is an average surcharge of USD170 for the transportation of a 40’ dry container from Asia to North Europe during the first quarter and USD250 for a 40’ reefer.\n\nThe surcharges are reviewed by the companies on a quarterly basis in line with changes in the price for a tonne of carbon. It has yet to be decided definitively if they...",
    "source_url": "https://market-insights.upply.com/en/bad-start-to-the-new-year-for-the-container-shipping-companies",
    "source": "market-insights.upply.com",
    "score": 111
}