{
    "id": 1771016380,
    "date": "2026-02-13",
    "title": "BAR Technologies Calls for Global Carbon Framework as Compliance Pressures Grow",
    "summary": "BAR Technologies urges a unified global carbon framework, citing the increasing complexity of regional emissions regulations. The EU's Carbon Border Adjustment Mechanism (CBAM) will indirectly impact shipping costs for major commodities. ECSA has requested the EU abandon regional rules upon the IMO's Net-Zero Framework (NZF) adoption, revealing compliance fatigue.",
    "content": "John Cooper is the CEO of BAR Technologies. Image Credit: BAR\n\nWind propulsion firm BAR Technologies is calling for a unified global carbon framework, warning that a growing patchwork of regional rules is increasing compliance pressure on shipowners.\n\nOverlapping measures such as the EU ETS, FuelEU Maritime and emerging IMO proposals are creating a complex regulatory landscape with differing baselines and cost structures, the firm said in an email statement on Thursday.\n\n“Carbon compliance is becoming more fragmented by the month,” John Cooper, CEO of BAR Technologies, said.\n\n“Instead of building momentum behind a single global framework, we’re creating a patchwork of schemes with different baselines, rules and cost mechanisms.”\n\nThe company also pointed to the EU’s Carbon Border Adjustment Mechanism (CBAM), which took effect on January 1, 2026, as an example of carbon pricing becoming embedded in global trade.\n\nWhile CBAM does not directly tax shipping emissions, it introduces indirect costs for major seaborne commodities.\n\nThe firm said it supports a globally agreed carbon policy with a bunker-level collection mechanism to fund climate investment while avoiding duplication across regional schemes.\n\n“While we await consensus on a unified framework, we cannot afford inaction,” Cooper said, adding that wind-assisted propulsion technologies can deliver immediate emissions reductions across regulatory regimes.\n\nThe European Community Shipowners' Associations (ECSA) has also urged the European Commission to withdraw EU shipping regulations once the IMO’s Net-Zero Framework (NZF) is adopted.",
    "source_url": "https://shipandbunker.com/news/world/929566-bar-technologies-calls-for-global-carbon-framework-as-compliance-pressures-grow",
    "source": "shipandbunker.com",
    "score": 105
}