{
    "id": 1771016372,
    "date": "2026-02-13",
    "title": "BBC Verify: Verified video shows collision between US Navy ships in Caribbean Sea",
    "summary": "This BBC report lacks crucial details on the US Navy ship collision's impact on marine pollution. Any resulting fuel spills or damage to sensitive marine ecosystems remains unaddressed. We await further investigation into potential violations of MARPOL regulations and associated environmental damage.",
    "content": "Fact-checking Farage and verifying US naval collision\n\nThomas Copeland\n\nBBC Verify Live journalist\n\nIt’s been a busy Friday here at BBC Verify, so here’s a quick recap of what we’ve been covering.\n\nOur fact-check team has been looking into a series of claims made by Reform UK leader Nigel Farage in an X post and during an interview for the BBC’s Political Thinking podcast.\n\nThey looked into how many stations in London run by transport body TfL have signs in foreign languages and dug into the data on the number of people living in the UK who don’t speak English.\n\nAnd after President Donald Trump revoked a landmark Obama-era ruling on greenhouse gases, BBC Verify has been assessing how that move might affect US emissions.\n\nElsewhere, our video verification team worked on the latest footage showing the impact of attacks on Ukraine and two videos showing a collision between US Navy ships in the Caribbean.\n\nThat’s all from the live page for this week. Our verification and eyewitness journalists will be here through the weekend working with teams across BBC News. BBC Verify Live will be back on Monday.\n\nVerifying videos of a fire in Gaza City\n\nKumar Malhotra\n\nBBC Verify senior journalist\n\nI’ve been looking at footage showing a fire blazing at a building in the northern part of the Gaza Strip, with fire crews and emergency workers in attendance.\n\nWe confirmed the location as being in the Rimal area of Gaza City by comparing the building, the neighbouring structures and the street layout to visible features on Google Earth.\n\nWe also matched the footage posted on social media today with images published by news agencies.\n\nIsraeli forces have pulled back from the Rimal area. A spokesman for Gaza’s Hamas-run Civil Defence agency said fire fighters had been battling the blaze for eight hours, and were facing major challenges due to a lack of resources.\n\nIt also said a number of people had to be treated for smoke inhalation.\n\nFootage shows collision between two US Navy ships in Caribbean Sea\n\nThomas Copeland\n\nBBC Verify Live journalist\n\nWe’ve just verified two videos showing a collision between two US Navy ships on Wednesday.\n\nTwo people reported minor injuries after the incident involving the Arleigh Burke-class destroyer USS Truxtun and Supply-class combat support ship USNS Supply.\n\nThe US military's Southern Command confirmed to the BBC the collision took place during an at-sea refuelling operation and both ships were able to continue safely afterwards.\n\nShip-tracking site MarineTraffic shows USNS Supply last broadcast its position on Thursday where it was docked at the port of Ponce in the US territory of Puerto Rico.\n\nSouthern Command said the incident was under investigation.\n\nBoth videos were taken aboard USNS Supply and we’ve been able to match key features on the vessels to publicly available images. These included the forward gun and hull number on USS Truxtun and the cranes, hoses and steps on USNS Supply.\n\nReverse images searches indicate that neither of these videos appeared online before yesterday.\n\nHow might Trump’s climate rollback affect US emissions?\n\nMark Poynting\n\nBBC Verify researcher\n\nThe US is currently the second-biggest emitter of planet-warming greenhouse gases - such as carbon dioxide - but its emissions have generally been falling over the past two decades. Many analysts say this is partly due to the “endangerment finding” made in 2009 when Barack Obama was president.\n\nThis concluded that greenhouse gases were a risk to public health - and was reversed by President Donald Trump yesterday.\n\nThe endangerment finding underpinned US efforts to cut emissions in transport, power stations and industry, according to the Environmental Protection Agency.\n\nThe consequences of Trump’s move for US emissions - and global climate change - are uncertain.\n\nPrevious modelling by independent researchers at Rhodium Group suggested rolling back US climate regulations would slow - but not reverse - emissions cuts.\n\nIt also appears unlikely that US car manufacturers will abandon all carbon-cutting efforts as they sell to other markets like the EU that have their own emissions rules.\n\n“American gas-guzzlers aren't popular abroad, and allowing them to become more polluting will further lessen their appeal,” said Chris Aylett, research fellow at Chatham House’s Environment and Society Centre.\n\nThe US Alliance for Automotive Innovation welcomed yesterday’s announcement but said the industry would stay “on a long-term path of emissions reductions and cleaner vehicles”.\n\nAccusations of Bangladesh election rigging circulate online without evidence\n\nShruti Menon and Shyadul Islam\n\nBBC Verify and BBC Bangla\n\nWe’ve been monitoring Bangladesh’s landmark elections for evidence of misinformation and false posts online.\n\nNow the outcome is clear - a landslide victory for the Bangladesh Nationalist Party - we’ve continued to look online for social posts challenging the validity of the results and scrutinising the evidence presented.\n\nOne in particular has caught our eye - which is being widely shared on Facebook and X - that claims to show evidence of vote rigging.\n\nIt shows a voter tally sheet at one counting station with crossed-out figures suggesting the results were changed after first being recorded.\n\nWe contacted the election duty officer whose signature appears on the sheet. He confirmed this was a genuine voter tally sheet and the corrections were a result of a clerical error while recording the vote.\n\nA later version of the sheet was submitted without the strikethroughs, he said.\n\nWe can’t say whether the alterations on this occasion were made as a result of manipulation or clerical error, but this post has clearly led to speculation about the conduct of the election on Bengali-language social media.\n\nHow much do Nato members spend on defence?\n\nAnthony Reuben\n\nBBC Verify senior journalist\n\nThe annual Munich Security Conference gets under way in Germany today - and is due to hear from US Secretary of State Marco Rubio tomorrow.\n\nRubio’s appearance follows recent tensions between the US and its Nato allies after President Donald Trump threatened Danish sovereignty with a pledge to annex Greenland.\n\nSpeaking to reporters as he left, Rubio insisted the US wasn't abandoning Europe, but said it should learn to defend itself.\n\nWhile the US defence budget has come down from 3.6% of its GDP in 2020 to an estimated 3.2% in 2025, spending by the rest of Nato, external - Canada and the European members - has gone up from 1.7% of their combined GDP in 2020 to an estimated 2.3% in 2025.\n\nHowever in cash terms, the US is still by far the biggest spender on defence, spending about $980bn (£720bn) last year, which was 62% of the Nato total.\n\nMembers are now committed to spending, external 3.5% of GDP on defence by 2035, with another 1.5% going on things like protecting critical infrastructure and ensuring civil preparedness.\n\nTrump’s climate comments at odds with overwhelming scientific consensus\n\nMark Poynting\n\nBBC Verify researcher\n\nOn Thursday US President Donald Trump revoked a landmark Obama-era ruling that greenhouse gases – such as carbon dioxide and methane – endanger public health.\n\n“This determination had no basis, in fact, had none whatsoever,” he said, later adding that the ruling had “nothing to do with public health”.\n\nDiana Furchtgott-Roth – who served in the first Trump administration – defended the move, telling BBC Radio 4’s Today programme “harms from climate change are risks for the future”.\n\nBoth claims run contrary to the overwhelming scientific consensus on the causes and impacts of climate change.\n\n“Human activities, principally through emissions of greenhouse gases, have unequivocally caused global warming,” states the UN’s Intergovernmental Panel on Climate Change (IPCC), external.\n\nIts reports are signed off by governments around the world as an accurate reflection of the science.\n\nRather than being risks for the future, the IPCC says, external human-caused climate change “is already affecting many weather and climate extremes in every region across the globe”, such as heatwaves or heavy rainfall events.\n\nThe IPCC adds, external that human-caused climate change – driven by greenhouse gas emissions - has “adversely affected the physical health of people globally” through extreme heat and climate-related diseases.\n\nHow many TfL stations in London have signs in foreign languages?\n\nLucy Gilder\n\nBBC Verify journalist\n\nDuring his interview on the BBC’s Political Thinking podcast, Reform UK’s Nigel Farage said: “If you go to parts of east London… you see London Underground stations with foreign languages next to them.”\n\nIn response to a 2025 Freedom of Information (FOI) request Transport for London (TfL) referenced two stations in the capital with dual-language signs, external.\n\nOne is Southall in west London which has Punjabi signage and the other is Whitechapel, east London, which has signs in Bengali.\n\nTfL said the Bengali sign was added to Whitechapel station following a request from the mayor of Tower Hamlets borough.\n\nMayor of London Sadiq Khan said on X at the time, external that the signage was about “recognising and celebrating the vital contribution Bangladeshi Londoners have made shaping the Tower Hamlets community”.\n\nTfl says the Southall Punjabi signs were there before it took over the station which is now part of the Elizabeth Line.\n\nIn the same FOI answer, TfL responded “no” when asked if it had plans for more stations to be bilingual.\n\nBBC Verify has asked TfL whether any more dual-language signs have been added to its stations since it provided that FOI response last year.\n\nSudanese army destroys paramilitary air defence system\n\nPeter Mwai and Richard Irvine-Brown\n\nBBC Verify\n\nVideo has emerged showing the moment a Sudanese army drone struck an air defence system used by the paramilitary Rapid Support Forces (RSF) in the Kordofan region of southern Sudan earlier this week.\n\nAlthough images claiming to show the destroyed Chinese-made FK-2000 system first appeared on social media on 10 February, the video published yesterday by the state news agency, tells us more about the attack.\n\nIn the last frames of the video we can make out the FK-2000 - its launching and transport platforms, plus its radars - before the camera cuts out.\n\nWe were able to match the long straight dirt track near a river bed, a small group of houses and what looks like a reservoir so we could confirm the strike was 3 miles (5km) west of al-Debeibat - a town people have mentioned on Sudanese social media as being close to the attack.\n\nThis puts it in the heart of the fighting between the government’s forces and RSF in the region. Both sides have been fighting a civil war across Sudan for almost three years.\n\nAnd we can be confident the attack was on 10 February because satellite images from that day show scrub burning at the same place.\n\nAnalysing footage of Russian strikes on Ukraine\n\nPaul Brown\n\nBBC Verify senior journalist\n\nWe've been reviewing footage following overnight attacks on Ukraine which local officials say have killed at least six people across the country.\n\nThe strikes reportedly targeted Odesa, Kramatorsk and Zaporizhzhia, and involved one missile and 154 drones, according to the Ukrainian Air Force.\n\nFootage filmed this morning in the city of Odesa shows widespread damage to a car dealership, where one building has been almost completely blown out, and a number of vehicles destroyed.\n\nAmong the vehicles seen in the video were Mitsubishis and Peugeots which meant we could narrow down our search for where the attack happened to the location of these dealerships.\n\nAt one point the video offers a very similar angle on the Peugeot showroom to one seen in a photograph on the outlet's official website.\n\nWelcome to BBC Verify\n\nRob Corp\n\nBBC Verify Live editor\n\nGood morning.\n\nWe start today by fact-checking claims made by Reform UK leader Nigel Farage about immigration.\n\nFarage posted a video on X yesterday, following comments made by billionaire Manchester United co-owner Sir Jim Ratcliffe, where the Reform UK leader wrote: “Jim Ratcliffe is right”.\n\nIn the video he claims that “one million people living in this country don’t speak any English at all”. He’s wrong, and we’ll bring you more shortly on what we know.\n\nElsewhere, there’s been another night of drone and missile attacks across Ukraine. At least six people were killed across the country, according to officials. We’re verifying footage showing the aftermath of one attack on the southern Ukrainian city of Odesa.\n\nUS Secretary of State Marco Rubio is expected to tell European leaders the continent must learn to defend itself when he visits the Munich Security Conference which gets under way today. We’re looking at what Europe’s Nato members spend on defence.",
    "source_url": "https://www.bbc.com/news/live/c1kgn2pjpyxt",
    "source": "bbc.com",
    "score": 96
}