{
    "id": 1771657222,
    "date": "2026-02-21",
    "title": "Biofuel Bunker Snapshot: Global B30-VLSFO prices gain on VLSFO price",
    "summary": "B30-VLSFO biofuel blends are becoming more expensive, with Singapore seeing a $48/tonne increase. Despite the price increases, Singapore's bio-blended bunker sales fell 34% to 60,000 tonnes in January, indicating limited demand. Shippers should note that these price fluctuations will impact the cost-effectiveness of biofuel strategies for CII compliance.",
    "content": "ARA and Gibraltar\n\nRotterdam’s B30-VLSFO (POMEME) price and Antwerp’s B30-VLSFO (UCOME) price has gained over the last week.\n\nRotterdam’s conventional VLSFO price has increased $34/mt during the last week, while Antwerp’s VLSFO price has increased $29/mt. These rises may have supported the rise in the B30-VLSFO prices.\n\nThe Prima Markets-assessed ARA POMOME and UCOME barge prices have inched just $4/mt higher over the same period.\n\nAntwerp’s blend price now holds a $54/mt premium over Rotterdam, narrowing from a $67/mt premium seen last week.\n\nBiofuel deliveries in the ARA may take around 7-10 days of lead time, a trader said.\n\nGibraltar’s B30-VLSFO price has increased $36/mt over the last week. Congestion caused at the port due to rough weather over the past few weeks has now cleared, port agent MH Bland said.\n\nSupplies of B30-VLSFO blend in the port may take around 10 days of lead time, a trader told ENGINE.\n\nSingapore and Fujairah\n\nSingapore B30-VLSFO price has also gained $48/mt over the last week, its price premium over the port’s conventional VLSFO has gained by $12/mt over the same period.\n\nPrima-assessed UCOME China barge prices, which are closely related to Singapore’s blend prices, have remained unchanged over the same period.\n\nFujairah’s B30-VLSFO price has gained by $39/mt over the same period, Its premium over Singapore’s blend price has decreased $9/mt over the last week.\n\nSeparately, Singapore’s bio-blended bunker sales declined 34% to 60,000 mt in January, data from the Maritime Port Authority said this week.\n\nIn other biofuels news",
    "source_url": "https://www.hellenicshippingnews.com/biofuel-bunker-snapshot-global-b30-vlsfo-prices-gain-on-vlsfo-price/",
    "source": "hellenicshippingnews.com",
    "score": 53
}