{
    "id": 1771311613,
    "date": "2026-02-17",
    "title": "Biofuel Bunker Snapshot: Antwerp’s B30-VLSFO premium over Rotterdam narrows",
    "summary": "Europe\n\nRotterdam’s B30-VLSFO (POMEME) price has dipped modestly in the last week, while Antwerp’s B30-VLSFO (UCOME) price has seen a much steeper fall.\n\nA $9/mt fall in the port’s conventional VLSFO ...",
    "content": "Europe\n\nRotterdam’s B30-VLSFO (POMEME) price has dipped modestly in the last week, while Antwerp’s B30-VLSFO (UCOME) price has seen a much steeper fall.\n\nA $9/mt fall in the port’s conventional VLSFO price could have added some downward pressure on Antwerp’s price.\n\nThe decline in prices at both ports is despite Prima-assessed ARA POMEME and UCOME barge prices increasing by $27/mt in the past week.\n\nConsequently, Antwerp’s B30-VLSFO price now holds a $67/mt premium over Rotterdam, narrowing considerably from a $90/mt observed last week.\n\nUnlike Antwerp’s B30-VLSFO (UCOME) price, Rotterdam’s B30-VLSFO (POMEME) price is rebated by Dutch suppliers who can generate ZRE units from renewable biofuel bunker sales.\n\nSeparately, the data from the port authority of Antwerp-Bruges said suppliers sold a total of 151,000 mt of bio-bunkers in 2025. Biofuel sales slowed down towards the end of the year, when a 80% quarterly drop in sales was seen.\n\nMeanwhile, Gibraltar’s B30-VLSFO (UCOME) price has also slipped $20/mt in the past week. The port is facing fresh disruptions with the Gibraltar Port Authority suspending all operations, shipping agent A Mateos & Sons said.\n\nThe port is facing winds of around 40 knots and waves higher than 2 metres. Suppliers are already facing backlogs from previous disruptions and around 26 vessels currently await bunkers at the port, port agent MH Bland said.\n\nSouth America\n\nRio Grande’s B30-VLSFO price has slipped around $10/mt over the last week. Its premium over conventional VLSFO price has dipped $5/mt during the same period.\n\nThe port’s B30-VLSFO is trading at an $82/mt premium over its VLSFO price.\n\nSeparately, Brazil’s state-controlled energy major Petrobras announced that its headquarters will be closed for bunker sales activities from 16–18 February due to the Carnival holiday.\n\nFujairah and Singapore\n\nSingapore’s B30-VLSFO price has fallen by $24/mt in the last week, almost four times more than the difference in Fujairah’s B30-VLSFO price from last week.\n\nAs a consequence, Singapore’s discount to Fujairah has almost doubled to $36/mt over the same period.\n\nA $19/mt fall in Singapore’s conventional VLSFO price has probably weighed on the blend’s price.",
    "source_url": "https://www.hellenicshippingnews.com/biofuel-bunker-snapshot-antwerps-b30-vlsfo-premium-over-rotterdam-narrows/",
    "source": "hellenicshippingnews.com",
    "score": 47
}