{
    "id": 1771398021,
    "date": "2026-02-18",
    "title": "Brazil’s ABIOVE challenges EU soy biofuel phase-out methodology, calls for revision",
    "summary": "ABIOVE disputes the EU's assessment that Brazilian soy biofuel causes high indirect land-use change (ILUC). ABIOVE claims the EU methodology overestimates deforestation linked to soy, placing it unfairly in a high-ILUC risk category and jeopardizing its future use in EU renewable targets. This challenge could weaken the EU's efforts to reduce deforestation-linked emissions and maintain FuelEU Maritime's carbon intensity targets.",
    "content": "The Brazilian Association of Vegetable Oil Industries (ABIOVE) has pushed back against the European Commission’s proposal to phase out soybean-based biofuels by 2030, arguing that the underlying Indirect Land-Use Change (ILUC) analysis overstates soybean’s deforestation footprint.\n\nIn a note published on LinkedIn on Feb. 16 , ABIOVE said the data used in the commission’s draft contains methodological flaws that unfairly classify soybean as a “high ILUC-risk” feedstock.\n\nThe European Commission on Jan. 21 released a draft regulation setting a linear phase-out of high ILUC-risk biofuels from 2024 to 2030, effectively eliminating soybean- and palm-based fuels from counting toward EU renewable energy targets by the end of the decade.\n\nDispute over deforestation share\n\nAt the center of the dispute is the commission’s updated assessment, prepared by Guidehouse, which found that 14.1% of global soybean expansion between 2014 and 2021 occurred on high-carbon-stock land, placing soybean above the 1% expansion and 100,000-hectare threshold used to determine high ILUC risk.\n\nABIOVE said its own analysis, based on Brazil’s MapBiomas dataset and alternative mapping by Serasa Experian, shows a significantly lower share of soybean expansion over forested areas.\n\nUsing land-use transitions strictly within the 2014–2021 period, ABIOVE estimates soybean expansion over forest in Brazil at 3.6%-5.5%, well below the commission’s figure. Even when applying a methodology closer to Guidehouse’s — which overlays 2014–2021 soybean expansion with deforestation dating back to 2008 — the Brazilian group calculated a 10.4% share before adjusting for productivity factors.\n\nThe association argues that the Guidehouse approach inflates results by combining a longer deforestation reference period with a shorter expansion period, effectively tripling the area attributed to soybean.\n\nProductivity factor under scrutiny\n\nABIOVE also challenged the soybean “productivity factor” (PF) used in the ILUC formula, which Guidehouse set at 1.0. The PF influences the final classification of feedstocks under the Renewable Energy Directive framework.\n\nThe group said Brazil’s widespread soybean–maize multi-cropping system increases the effective energy yield per hectare and should result in a PF of 1.2 to 1.3, rather than 1.0. Applying a PF of 1.3 would reduce soybeans’ calculated share of expansion over high-carbon-stock land to 7.9%, according to ABIOVE’s recalculation.\n\nWhen using only 2014–2021 land-use data and the higher PF, the group said soybeans’ adjusted share could fall as low as 2.8%, placing it in a low-risk category under the directive’s formula.\n\nMarket implications\n\nThe commission’s draft regulation is open for public feedback until Feb. 18 and, if adopted, would gradually reduce the maximum contribution of high ILUC-risk biofuels to 0% by 2030.\n\nABIOVE warned that the Renewable Energy Directive’s objectives to curb deforestation-linked imports must rely on “the best available sources and maps” to avoid distorting market flows and unfairly penalizing specific commodities.\n\nThe association called on the commission and Guidehouse to revise the data and methodology before finalizing the delegated act, saying that while RED is a necessary regulation, inaccurate risk classification could have far-reaching consequences for biofuel markets and EU–Mercosur trade dynamics.\n\nAudit irregularities\n\nAn audit carried out by Brazil’s federal audit office, TCU, and published on Jan. 28 showed that 60% of the soybeans used in biodiesel production have irregularities in their anti-deforestation certification under the national biofuels policy, RenovaBio.\n\nThe analysis showed that only 40% of biodiesel produced by soybean plants certified under the CBIO decarbonizationcredits market can be verified — through satisfactory certification — to be sourced without any deforestation. In comparison, 70% of cornbased ethanol and 85% of sugarcane ethanol meet the same deforestationfree standard.\n\nIn response to the TCU report, the Brazilian Association of Vegetable Oil Industries, or Abiove, told Platts, part of S&P Global Energy, on Feb. 3 that it is monitoring the audit developments, and reaffirmed that the RenovaBio program applies strict sustainability criteria, including the Brazilian Forest Code’s “most restrictive compliance standard.”\n\nIn a written statement, the association said these criteria “guarantee that the program delivers the expected environmental benefit at the lowest economic cost to society, preserving the competitiveness of the Brazilian energy matrix.”\n\nPlatts assessed the FOB Paranagua soybean oil price for March loading down $10.14/metric ton day over day, while the March basis was unchanged at minus 450 points to CBOT H futures, reflecting the absence of new business rather than any deterioration in fundamentals. For April loading, the FOB price declined $3.09/mt, and the basis weakened by 30 points to minus 690 points to CBOT May (K) futures.",
    "source_url": "https://www.hellenicshippingnews.com/brazils-abiove-challenges-eu-soy-biofuel-phase-out-methodology-calls-for-revision/",
    "source": "hellenicshippingnews.com",
    "score": 85
}