{
    "id": 1771052410,
    "date": "2026-02-14",
    "title": "Dirty & Clean Routes: This Week’s Congestion Moves",
    "summary": "Recent freight market behavior suggests a pause in the rally rather than a structural reversal. Freight levels remain supported by constrained tonnage supply, particularly in core export regions, thou...",
    "content": "Recent freight market behavior suggests a pause in the rally rather than a structural reversal. Freight levels remain supported by constrained tonnage supply, particularly in core export regions, though near-term direction will depend on fresh cargo flow and overall market activity.\n\nArabian Gulf and West African dirty freight markets are currently characterized more by holding firmness than a new surge. Market activity appears measured, with participants monitoring cargo flow developments before establishing stronger directional conviction.\n\nTrade Flow & Policy Developments\n\nThe freight market’s direction is increasingly shaped by evolving crude trade patterns and emerging policy shifts.\n\nA potential trade agreement between the United States and India, expected by mid-March, is drawing market attention. While the direct impact on freight remains uncertain, any adjustments to tariff frameworks or sourcing incentives could affect crude procurement strategies and, in turn, tonne-mile demand.\n\nA gradual reconfiguration of global trade flows is already taking shape. Indian refiners have shown renewed openness toward Venezuelan crude following the resumption of exports. State-owned Indian Oil Corporation (IOC) and Hindustan Petroleum Corporation Ltd (HPCL) have jointly secured 2 million barrels, marking the second Venezuelan cargo deal since export channels reopened.\n\nIf sustained, this shift could modestly extend average voyage distances, particularly if Atlantic Basin crude gains an incremental share in Asian refining systems.\n\nHowever, structural realignment remains conditional. Commercial viability, refinery configuration constraints, and regulatory clarity continue to limit rapid substitution between crude grades. Not all barrels are interchangeable.\n\nSanctions frameworks and compliance requirements remain operational variables, particularly for vessel services, insurance, and financing channels.\n\nFor now, freight performance appears more directly driven by regional vessel availability and cargo timing rather than immediate geopolitical catalysts.\n\nFreight Market Overview – Dirty\n\nBaltic Dirty Tanker Index is trending exceptionally higher (+90% YoY), surpassing the monthly levels of the previous years since 2023.\n\nBDTI – Baltic Dirty Tanker Index Market Prices →\n\nBDTI\n\nDirty TCE$/DAY\n\nVLCC | Suezmax | Aframax ↓\n\nTD3C Middle East Gulf to China | TD6 Black Sea to Mediterranean | TD7 North Sea to Continent\n\nDirty Spot Price Summary Open in Platform →\n\nDirty Spot Price Summary\n\nThe freight market pulse has eased further since the start of the first week of February. Yet strong performances are still recorded in the VLCC Middle East Gulf-to-China TCE and the Suezmax Black Sea-to-Mediterranean, with TCE in excess of $110k/d, while the Aframax North Sea-to-Continent dropped below $95k/d.\n\nVLCC: The TCE rates for the MEG-to-China route, while dropping by about $5,000/day to $117,000/day, remained strong. This $117k/d figure represents a substantial increase of roughly $83,000/day compared to a year ago.\n\nSuezmax: Rates for the Black Sea to Mediterranean route experienced a minor downward adjustment this week, remaining near $117k/day — an increase of approximately $79k/day YoY.\n\nAframax: North Sea-to-Continent rates currently stand at $93k/d, dropping by around $3k/day from the previous week, and still significantly weaker than the extraordinary spike to approximately $140k/d recorded just before the end of January.\n\nBaltic Rates Comparison – Dirty Spot Comparison →\n\nDirty Rates\n\nFreight Market Overview – Clean\n\nBaltic Clean Tanker Index (+34% YoY). The current index value remains strong; however, there has been a gradual easing, with a 4% weekly drop to below the 900-point mark. It appears the latest peak was reached on February 5, 2026, with the index near 920 points.\n\nBCTI – Baltic Clean Tanker Index Market Prices →\n\nBCTI\n\nClean TCE$/DAY\n\nLR2 | LR1 | MR ↓\n\nTC1 75k MEG to Japan | TC5 55k MEG to Japan | TC14 38k US Gulf to Japan\n\nClean Spot Price Summary Open in Platform →\n\nClean Spot Price Summary\n\nIn the clean segment, the second week of February seems to end with a clear downward trend signal. However, the standout route for annual growth remained MR USG to Continent, as mentioned in our last tanker market monitor, with earnings up 476% annually, but with latest indications reversing significantly the firmness of the previous week, when levels were in excess of $40k/d, and lost momentum this week to around $30k/d.\n\nBaltic Rates Comparison – Clean Spot Comparison →\n\nClean Rates\n\nSupply Market Trends\n\nIn this section, we highlight the areas of the dirty Baltic routes where TSOP signals show the latest upward trend, contrary to the direction of freight market movements.\n\nVLCC | USG Vs AG & WAfr\n\nUSG Supply vs Demand – TD22 Open in Platform →\n\nVLCC USG Supply\n\nBuilding on last week’s observation of emerging oversupply in West Africa, current data indicate developing net supply pressure in the US Gulf. Specifically, the latest Signal Ocean Platform figures indicate an oversupplied market on the TD22 route (24% above the 3-month average). This elevated supply level appears to be already restraining any further spike in recent freight market indications.\n\nWest Africa: The spike in the availability of spot/relet vessels on the TD15 route, which saw the count peak near 20 over the last fortnight, has now subsided. The vessel count has dropped to 13, helping TD15 rates maintain a floor above WS 120.\n\nAG: The sustained downward trajectory in net vessel supply within the Arabian Gulf region remains a notable market feature. Current data indicate a substantial reduction in the vessel count, now approximately 45% below the peak level recorded at the end of December 2025. This significant decline has accelerated recently, in contrast to the 26% decrease observed just before the close of the previous week.\n\nSuezmax | WAfr Vs Black Sea\n\nWAF Supply vs Demand – TD20 Open in Platform →\n\nSuezmax WAF Supply\n\nWest Africa: Spot/relet vessels on the TD20 route are maintaining levels above 30 (the same as a week ago), marking a significant 100% rise from the exceptionally low figures recorded in mid-January. In addition, the current TSOP data indicate that the TD20 route is now oversupplied (23% above the 3-month average), which is expected to further depress freight demand.\n\nBlack Sea: Current volatility continues, averaging around 25 vessels, down from the peak of just over 30 vessels recorded in mid-November 2025.\n\nDirty Demand – Tonne Miles\n\nVLCC ↓ 3.3% WoW | Suezmax ↑ 2.8% WoW | Aframax ↓ 6.0% WoW\n\nTonne Miles Index View – 7D MA Open in Platform →\n\nDirty Demand\n\nThe VLCC segment’s tonne-mile index growth stayed below 100%, in line with last week’s expectations, continuing to lag both Suezmax and Aframax. Suezmax continues to exhibit relatively firmer momentum. Although the Aframax index growth remains above 100%, it has moderated to around 115% from its early February peak of 120%.\n\nMetrics Description: Index View (Base 100) by total Tonne Miles over the selected period. This facilitates relative performance comparisons between segments of different sizes.\n\nClean Demand – Tonne Miles\n\nAframax ↓ 1.5% WoW | Panamax ↓ 2.8% WoW | MR2 ↓ 2.0% WoW",
    "source_url": "https://www.hellenicshippingnews.com/dirty-clean-routes-this-weeks-congestion-moves/",
    "source": "hellenicshippingnews.com",
    "score": 16
}