{
    "id": 1771311625,
    "date": "2026-02-17",
    "title": "Explainer: The US Maritime Action Plan and What It Means for Shipping Lines",
    "summary": "The US Maritime Action Plan proposes a 'security fee' on foreign-built ships of $0.01-0.25 per kg of cargo, potentially raising costs for international carriers. Tighter cargo preference rules will force more US government cargo onto US-flagged vessels, reducing volumes for global lines. This reeks of protectionism and will likely distort trade without reducing overall emissions.",
    "content": "By The Loadstar team\n\nThe White House’s 13 February Maritime Action Plan (MAP) sets out an ambitious strategy: to rebuild US shipbuilding and reduce dependence on foreign-built and foreign-flagged vessels\n\nFor international shipping lines, the document contains several proposals that could materially affect operating costs, cargo allocation, port routing, and long-term market access.\n\nHere is a breakdown of the measures most likely to affect global carriers first.\n\nA universal fee on foreign-built vessels\n\nThe MAP calls for a “universal infrastructure or security fee” on all foreign-built commercial vessels calling at US ports, assessed based on the weight of imported cargo.\n\nIllustrative figures in the document suggest:\n\n$0.01 per kg would raise $66bn over 10 years\n\n$0.25 per kg would raise $1.5trn over 10 years\n\nNo rate has been fixed.\n\nNearly the entire global container fleet is foreign-built. In practice, this would function as:\n\n1) a de facto surcharge on most international liner operators;\n\n2) a potential pass-through cost to shippers;\n\n3) a possible distortion between US-built niche operators and global carriers.\n\nAt higher illustrative levels (eg @ $0.25/kg), this would dwarf current port fees and materially alter trade economics.\n\nEven at $0.01/kg, the sums become significant on large-volume Asia–US services.\n\nTightening cargo preference rules\n\nThe MAP proposes:\n\n1) increasing the percentage of US government cargo that must move on US-flagged vessels;\n\n2) creating a new United States Maritime Preference Requirement (USMPR) for high-volume exporting economies to transport an increasing share of US-bound containerised cargo on qualifying US vessels.\n\nIf implemented, this could:\n\n1) redirect some cargo away from global liner networks;\n\n2) strengthen US-flag operators backed by subsidy;\n\n3) introduce quota-like dynamics into certain tradelanes.\n\nFor carriers heavily exposed to US government-linked exports or strategic cargo, this could reduce addressable volumes.\n\nLand port maintenance tax\n\nTo prevent cargo diversion via Canada or Mexico, the MAP proposes a 0.125% tax on goods entering through land ports, mirroring the existing Harbor Maintenance Fee.\n\nThis is designed to stop shippers avoiding maritime-related charges by routing via:\n\n1) Vancouver–rail;\n\n2) Lazaro Cardenas–truck/rail;\n\n3) Canadian east coast intermodal.\n\nIf both sea and land entries face aligned charges, routing flexibility narrows.\n\nFor carriers competing with intermodal cross-border strategies, this reduces arbitrage options.\n\nStrategic commercial fleet (SCF)\n\nThe plan proposes creating a Strategic Commercial Fleet (SCF) of internationally trading US-built, US-flagged vessels, supported financially for both construction and operation.\n\nThis is effectively a subsidy to US carriers, backed by construction and operating support and designed to complement existing Maritime Security Program fleets.\n\nWhile the scale is undefined, this could introduce state-supported competition in certain trades.\n\nPotential trade measures linked to China\n\nThe MAP references action taken under the Section 301 investigation into China’s maritime, logistics, and shipbuilding dominance.\n\nAlthough currently suspended, the framework exists for:\n\n1) service fees on foreign-built vehicle carriers;\n\n2) restrictions on certain maritime transport services.\n\nThe MAP signals continued willingness to use trade enforcement tools in shipping.\n\nArctic and autonomous priorities\n\nThe plan prioritises:\n\n1) Arctic route development;\n\n2) ice-breaking capability expansion;\n\n3) robotic and autonomous maritime systems.\n\nWhile less immediate for liner trades, this suggests a long-term industrial policy aimed at reshaping parts of the fleet and route network.\n\nTimings\n\nImportantly, however, none of the new fees are in force; legislative action would be required, and no effective dates are specified.\n\nThe administration intends to send a legislative package after the FY2027 budget process, which implies medium- to long-term implementation, rather than immediate tariff-style activation.\n\nInternational carriers serving the US will need to monitor:\n\n1) legislative movement on the Maritime Security Trust Fund;\n\n2) draft language on the foreign-built vessel fee;\n\n3) cargo preference expansion details;\n\n4) any revival of Section 301 maritime measures.",
    "source_url": "https://gcaptain.com/explainer-the-us-maritime-action-plan-and-what-it-means-for-shipping-lines/",
    "source": "gcaptain.com",
    "score": 75
}