{
    "id": 1771398029,
    "date": "2026-02-18",
    "title": "False flags are an evolution of the business model",
    "summary": "Flags of Convenience enable shipowners to evade regulations, undermining maritime security and seafarer rights. The FOC system allows registration in states with minimal oversight, contravening international law. This lack of genuine connection between shipowners and flags exacerbates issues like seafarer abandonment and environmental risks.",
    "content": "David Heindel from the International Transport Workers’ Federation on the dangers lurking behind the maritime industry’s use of flags of convenience.\n\nRecent reporting on false flags and the rise of shadow fleets has rightly raised alarms about maritime security, sanctions enforcement, environmental safety – and, too often as a secondary concern, seafarers rights. But much of the analysis still stops short of naming the enabling root cause.\n\nIn reality, these developments are the predictable outcome of what the ITF named as the flag of convenience (FOC) system more than 75 years ago – a business model deliberately designed to obscure ownership, fragment jurisdiction, and weaken enforcement with direct and devastating consequences for seafarers, for maritime security, and for the rule of law at sea.\n\nMuch of the current coverage describes the symptoms but avoids the diagnosis. False flags – the practice of flying fake flags disowned by the given registry – are not mere anomalies. They are, fundamentally, a natural outcome of the FOC system.\n\nUnder the FOC model, shipowners can register vessels in states with no meaningful genuine link to ownership, management, or operation – in direct contravention of international law under the UN Convention on the Law of the Sea. In exchange for registration fees, those flag states offer minimal scrutiny and weak enforcement, effectively selling enforcement-free sovereignty.\n\nAs Mark Dickinson, general secretary of UK maritime union, Nautilus, explained to the BBC, when it comes to spiralling seafarer abandonment, including on shadow fleet ships, FOC states have demonstrated, “a complete derogation of responsibility” towards their fleets and the crews who sail on them”. He then rightly outlined the demand, in line with international law, for there to always be “a genuine link between shipowners and the flags under which they sail”.\n\nThe jurisdictional ambiguity that allows ships to shift identities, manipulate registries, or operate without effective oversight is not accidental. It is built into the business model.\n\nThis is why false flags and shadow fleets have continued to proliferate despite increased sanctions, surveillance, and massively increased media and political attention. Industry profits from opacity. Flag states – in the case of the worst offenders, with flags often outsourced to unscrupulous overseas business interests – profit from regulatory leniency. Together, they create exactly the conditions in which fraudulent registries, identity switching, and impunity thrive.\n\nAnd the same governance failures driving false flags also produce severe human consequences.\n\nLast month, the International Transport Workers’ Federation released new data showing that 2025 was the worst year on record for seafarer abandonment. More than 6,200 seafarers were abandoned across 410 ships, a 32% increase on the previous year and the sixth consecutive year of rising cases.\n\nWhen ownership is hidden and flag state responsibility is diluted, seafarers are left exposed to a perfect storm of profit driven abuse. Abandonment, unpaid wages, unsafe vessels, denial of shore leave, and the absence of legal protection are not incidental outcomes. They are direct consequences of a system designed to enable the evasion of responsibility.\n\nThe same dynamics were laid bare during the global crew change crisis, when hundreds of thousands of seafarers were trapped on board for months beyond their contracts. Once again, fragmented jurisdiction and weak flag-state responsibility allowed governments and shipowners to deflect accountability, leaving workers stranded.\n\nThese are not abstract failures. They are human crises: crews stuck on rusting ships running out of food, isolated from their families, unpaid or underpaid, and far from home, with no authority willing or able to intervene because ownership has vanished behind layers of opaque registration and flag state evasion.\n\nBut the risks extend well beyond labour. The FOC system undermines maritime security, environmental protection, and the rule of law itself – risks that policymakers can no longer afford to treat as peripheral or theoretical.\n\nIf governments are serious about tackling false flags and shadow fleets, they must move beyond reactive enforcement and confront the structure that enables abuse – and government investigations into FOCs, as currently underway in the US, are a necessary and welcome first step.\n\nUltimately, this means enforcing the long-ignored principle of a genuine link between a vessel’s flag and its beneficial owners, operators, and managers. It means mandatory beneficial ownership transparency as a condition of registration and operation. It means holding flag states accountable when they repeatedly fail to meet their legal responsibilities.\n\nFalse flags, shadow fleets, and abandonment are not separate problems. They are interconnected outcomes of a failing system abandoned by decades of government inaction.\n\nHistory provides a clear warning: when countries retreat from national flags and cabotage, enforcement fractures as opacity becomes the norm. And the shadows become used to hide all manner of illegality and criminality, not least abuses of seafarers’ rights.\n\nWe saw this in the decades following World War II as the costs savings of FOCs led to its alternative structure shifting from being the exception to becoming the norm. And without challenging false flags as the central enabler of the shadow fleet via its near-zero accountability and structurally lower costs, we risk this super-charged false flagging system becoming even more commonplace: evasion will become the dominant business model with compliance a commercial liability.\n\nWe must rebuild and defend national-flag shipping and cabotage laws to bring all maritime trade back into the open, where there is no hiding place for shadow fleets, and no means to side-step accountability, national security, safety, and fair competition.",
    "source_url": "https://splash247.com/false-flags-are-an-evolution-of-the-business-model/",
    "source": "splash247.com",
    "score": 63
}