{
    "id": 1771570836,
    "date": "2026-02-20",
    "title": "Great Lakes Maritime Academy sees influx of Louisiana cadets",
    "summary": "Great Lakes Maritime Academy attracts Louisiana cadets seeking maritime careers. Graduates often pilot vessels on the Mississippi River or operate offshore supply ships. The academy encourages graduates to remain in the Great Lakes region, despite Louisiana's proximity to Gulf shipping lanes.",
    "content": "TRAVERSE CITY — The Great Lakes Maritime Academy (GLMA) at Northwestern Michigan College is drawing cadets from an unlikely place. It’s gained a reputation in the “Bayou State” as the place to go if you want to pilot or work on ships.\n\nEvery year, GLMA admits up to 60 cadets. Many of them make the more than 1,200-mile trip all the way from Louisiana to spend four years honing their skills on the Great Lakes.\n\n“Well, in a way, it’s an honor because there are seven federally regulated maritime academies. You’ve got the federal academy and six state academies, and there’s one in Galveston, which is a lot closer to New Orleans than Traverse City,” said Great Lakes Maritime Academy Superintendent, Rear Admiral Jerry Achenbach. “I’m going to guess probably, 15 to 18 percent of the of the cadets are from Louisiana,” he added.\n\nIt’s not really that surprising since Louisiana sits at the mouth of the Mississippi River, one of the most important shipping arteries in the nation. “A majority of them have a goal of being a pilot on the Mississippi River. So, a lot of them will go down and work, offshore supply vessels,” said Achenbach. He goes on to say the desire is to have them stay in the Great Lakes region because of how skilled the cadets become, “We’re very supported by the Great Lakes industry and a cadet sea project on a Great Lakes freighter cost their company about $5,000, you know, so they’re, you know, that that’s how they support us. Our way of supporting is encouraging all the cadets, even though some of the great state of Louisiana to stay on the Great Lakes for a couple of years.”\n\nWhile most want to work as deck officers, there is also an engineering program that prepares cadets to operate and maintain engines and machinery. Second year engineering cadet Karson Keyser is one of them, “Born right around the Baton Rouge area. But spent most of my life in Louisiana. Spent a little bit of time in Texas. Okay, but, Louisiana is the home… Most people that are coming out of New Orleans, river area, they’re coming up here to hopefully become pilots in the Mississippi River. But, my pilot friend, super close with family. Great family. He sent me up here as like, no, you’re going to be an engineer. And I said, okay, I trust you.”\n\nWhile a majority of GLMA’s nearly 200 cadets are from Michigan, it’s just one of six state maritime academies in the country. Achenbach said Louisiana is not the only place outside Michigan sending high school students their way, “Well, obviously up beyond the Great Lakes states. We’ve got one from Montana. We’ve had from Hawaii, from Alaska.”\n\nMost of the cadets from Louisiana have probably never heard of Traverse City before coming here. Besides the winter weather, Karson really likes it, “It’s a unique place. So, when I tell people back home, there’s a place back home, Hammond, Louisiana. It really makes me think about a place back home. Kind of like a medium sized city. It’s super clean up here, too. Super, super clean. I’ve seen that.”\n\nEven though they have a chance to go home during the year, Karson said being so far away can, you can long for being home, “You know, so up here, FaceTime is my best friend. I get to talk to my mom, my sister, my grandparents. But we get, like, weekend trips home every once in a while. We get a spring break and then going home for Christmas.”",
    "source_url": "https://www.9and10news.com/2026/02/19/great-lakes-maritime-academy-sees-influx-of-louisiana-cadets/",
    "source": "9and10news.com",
    "score": 74
}