{
    "id": 1771016389,
    "date": "2026-02-13",
    "title": "\"Green\" Vessel Investments Continue Despite Delays",
    "summary": "Shipping lines persist with \"green\" investments despite delays in global carbon pricing, potentially to avoid future FuelEU Maritime penalties. Dual-fuel vessel orders are increasing, but these ships often still burn HFO, impacting their Carbon Intensity Indicator (CII) rating. Wärtsilä profits regardless, selling both scrubbers and dual-fuel engines that may not deliver promised emissions reductions.",
    "content": "The shipping industry's biggest players are shrugging off Trump administration opposition to a global carbon price and are forging ahead with billions of dollars in emissions-reducing investments, according to company officials and a Reuters analysis of data.\n\nEurope, Brazil and a host of other nations are pushing the sector, which is responsible for nearly 3% of the world's greenhouse gas emissions, to go green. But, in October, the U.S. and Saudi Arabia, the world's two largest oil producers, successfully spearheaded efforts to postpone by one year a decision on the International Maritime Organization's proposal of a $380-per-metric-ton levy.\n\nSome analysts and industry observers initially warned that the absence of such a global framework added complexity to companies' planning and could cause some to pause their green investments.\n\nBut in interviews with 15 shipping companies, ports, bunker suppliers and marine technology companies, 10 told Reuters that regional regulations, long investment lead times, and expectations of a continuing trend towards decarbonisation all argued in favour of staying the course.\n\nAnd a Reuters analysis of vessel delivery data through 2028 showed orders of ships capable of running on alternative fuels dominating new shipbuilding.\n\nHakan Agnevall - chief executive of Wartsila WRT1V.HE, a major producer of ship engines and exhaust gas cleaning scrubbers - told Reuters that a one-year carbon price postponement is unlikely to rattle customers, like his, who generally take a 30-year investment perspective.\n\n\"It's not bold to say that regulations will change during those 30 years.\"\n\nNew Ship Orders Dominated by Dual Fuel\n\nMost of the nearly 50,000 commercial ships operating globally today run on fuel oil or gas oil. But in a unanimous decision in 2023, IMO member states set a target of net-zero emissions by or around 2050.\n\nFirms have, in anticipation, begun ordering dual-fuel ships that can use both fuel oil as well as greener alternatives like liquefied natural gas, methanol and ammonia.\n\nWhile Pacific Basin - a large dry bulk ship owner - did opt to buy four newbuild vessels running only on oil-derived fuels, citing the postponement of the IMO's carbon price, the company is an outlier.\n\nUnlike other sectors - from energy to auto manufacturing - that have curbed their green ambitions in a rollback that has only accelerated since Donald Trump's return to the White House, the shipping industry has, so far, declined to pivot.\n\nMajor ship owners have reiterated their commitments to invest in emissions reduction measures, including dual-fuel vessels and onboard energy-saving devices.\n\nBy the end of December, companies had invested over $150 billion in dual-fuel vessels, according to a Reuters analysis of data from the World Shipping Council, an industry group for container shipping and vehicle carriers.\n\nIn total, 1,126 dual-fuel container ships and vehicle carriers have now been either delivered or are on order, the data showed. That marks an increase of 28% compared with the previous year, indicating that newbuilding orders for lower-emission fuel vessels continued even after the IMO delay.\n\nThey also continued to outpace orders for traditional ships, with dual-fuel vessels now accounting for 74% of the overall container ship and vehicle carrier orderbook.\n\nAnd investments in new marine fuels are also moving ahead.\n\nAlexander Saverys, CEO of Belgian ship owner CMB.Tech, told Reuters it will continue investments in both ammonia bunkering and production.\n\nA Mitsui O.S.K. Lines spokesperson told Reuters the IMO postponement just means a longer transition to low and zero-carbon fuels, and the company is still focused on LNG-fuelled vessels and early-stage adoption of ammonia and methanol.\n\nMaersk, among the first to explore emissions-reducing alternative fuels, initially opted for methanol but has since ordered LNG-fuelled ships and has now also started testing ethanol as an alternative.\n\nNYK Group 9101.T, which reaffirmed its emissions reduction strategy after the IMO decision, sees the one-year delay as an opportunity for discussion and refinement of the regulatory framework, a company spokesperson said.\n\n\"While recent regulatory uncertainties might lead some operators to take a more cautious approach, the overall direction of maritime decarbonisation has not changed significantly,\" said Jason Stefanatos, decarbonisation director at maritime consultancy DNV.\n\n\"The commercial drivers still remain.\"\n\nGreen Incentives Continue\n\nMany companies cited regional green fuel regulations among the main reasons for moving ahead with investments.\n\nThe European Union's FuelEU Maritime, which requires vessels to pay penalties for failing to achieve lower emissions, makes a business case for greener fleets, ship owners and fuel suppliers said. And the EU Emissions Trading System and voluntary initiatives provide further incentives.\n\nShip owners with dual-fuel vessels will likely use them on EU voyages to avoid paying FuelEU Maritime penalties, and some should also receive rewards for over-compliance, said Kenneth Tveter, an analyst at shipbroker Clarksons.\n\n\"The case for low-carbon fuels such as ammonia and methanol is still alive if you have a trade concentrated around Europe,\" he said.\n\nMajor Horn of Africa port Djibouti and OPEC member Gabon have also introduced levies on maritime emissions.\n\nAnd current momentum could see punitive regulations and incentive schemes introduced in other important shipping hubs soon.\n\nBritain, notably, has proposed to expand its emissions trading system to international shipping from 2028. And Turkey is considering a scheme similar to the EU's.\n\nSuch factors should drive demand for LNG, bio-LNG and biofuels over the next five years, said Nacho de Miguel, head of alternative fuels at bunker supplier Peninsula.\n\n\"Whilst the IMO's net-zero framework has been postponed, this does not change our strategy,\" he said.",
    "source_url": "https://www.marinelink.com/news/green-vessel-investments-continue-despite-535722",
    "source": "marinelink.com",
    "score": 304
}