{
    "id": 1771016360,
    "date": "2026-02-13",
    "title": "Halten Bulk doubles down on low",
    "summary": "Halten Bulk's order for up to four 7,100 dwt bulk carriers masks the emissions from their existing fleet. Despite rotor sails and hybrid-electric systems, the actual carbon intensity reduction remains to be seen. The promise of hydrogen-fueled ships is undermined by continued investment in conventional vessels.",
    "content": "Norwegian shortsea specialist Halten Bulk has signed contracts for up to four 7,100 dwt self-discharging bulk carriers at Jiangsu Soho Marine Heavy Industry.\n\nThe vessels will be built to the Norwegian Ship Design Company’s NSD 105CC design and fitted with rotor sails as part of a package aimed at cutting fuel use and emissions in coastal trades.\n\nThe ships are tailored for wind-assisted propulsion and will also feature hybrid-electric systems, including a shaft generator and battery pack. Cargo handling will be fully electric, alongside additional energy-efficiency measures, the ship designer said.\n\nThe newbuilds will trade in the spot market along the Norwegian coast, in the North Sea, the wider Nordic region and the Baltic — areas where wind conditions and shortsea distances make wind assistance and hybrid solutions commercially viable.\n\n“This is a major day for us as we replace older tonnage with new low-emission vessels,” said Halten Bulk chief executive Ivar Ulvan. He added that the project builds on the “Powered by Nature” concept developed together with Egil Ulvan Rederi.\n\nHalten Bulk was founded in 2014 in Trondheim and operates a fleet of self-discharging bulkers focused on North Sea and Baltic trades. The company is a partnership between Brødrene Nordbø, Egil Ulvan and Strand Shipping.\n\nAlongside the new order order, Halten Bulk has also been developing two hydrogen-fuelled bulkers in Norway, backed by funding from Enova. The 88-m ships are designed to run on hydrogen combustion engines combined with battery power and wind-assisted propulsion using two rotor sails.\n\nThe contracts are effective for the first two vessels, with options secured for two additional units, giving the owner flexibility as it renews its fleet and tests new propulsion concepts in the shortsea bulk segment.",
    "source_url": "https://splash247.com/halten-bulk-doubles-down-on-low-emission-shortsea-shipping/",
    "source": "splash247.com",
    "score": 46
}