{
    "id": 1771398011,
    "date": "2026-02-18",
    "title": "IMO Sub-Committee on Pollution Prevention and Response (PPR 13)",
    "summary": "IMO's PPR 13 discussed a legally binding framework to control ships' biofouling, aiming for a draft convention by 2029. Concerns remain over port reception facilities for high-viscosity cargoes as more products fall under special requirement 16.2.7. Proposals to improve cargo tank stripping will be discussed further, but position logging during tank washing discharge gained support.",
    "content": "The 13th session of the IMO’s Sub-Committee on Pollution Prevention and Response (PPR 13) was held in London from 9 to 13 February 2026. PPR commenced discussions on a legally binding framework on biofouling. PPR also agreed on amendments to requirements regarding NOx emissions certification for engines running on noncarbon fuels, P/V valves on new crude oil carriers, and the dewatering of oily bilge water.\n\nSafety and pollution hazards of chemicals and preparation of amendments to the IBC Code\n\nPPR agreed to assign special requirement 16.2.7 to twelve additional highviscosity or solidifying products and highlighted concerns over adequate port reception facilities as the amount of affected cargo increases. Two new tankcleaning additives were also approved.\n\nDevelopment of a legally binding framework for the control and management of ships’ biofouling\n\nPPR 13 commenced discussion of a legally binding framework for the control and management of ships’ biofouling to minimize the transfer of invasive aquatic species. PPR 13 agreed that a new convention would be most suitable way forward and recommended this approach for consideration at MEPC 86 in 2027. The aim is to finalize a draft legal framework by 2029 for consideration by MEPC 89.\n\nImproving the effectiveness of cargo tank stripping, tank washing operations and prewash procedures\n\nRegarding efforts to enhance the effectiveness of cargo tank stripping, tank washing operations and prewash procedures, there was broad support in principle for proposals for improving stripping operations. It was decided to continue the in-depth technical discussion at Evaluation of Safety and Pollution Hazards of Chemicals (ESPH) 32.\n\nFurthermore, there was support for including the ship’s position during the discharge of tank washings within the format of the Cargo Record Book (CRB) for vessels carrying noxious liquid substances in bulk. Member states and international organizations were invited to submit proposals for a new output on this matter to MEPC.\n\nAir pollution\n\nBlack carbon (BC)\n\nPPR 13 discussed the development of a polar fuel concept to reduce BC emissions in the Arctic. A polar fuel standard was identified as a possible initial measure, but it was also emphasized that fuel quality alone cannot mitigate BC formation and that there are overlaps with measures such as the Arctic HFO ban and sulphur limits in Emission Control Areas (ECAs). PPR 13 concluded by inviting member states and organizations to submit refined proposals to PPR 14 in 2027, taking into account the need for consistency with other MARPOL Annex VI requirements.\n\nDischarge water from Exhaust Gas Cleaning Systems (EGCSs)\n\nPPR 13 considered a proposal for the restriction of EGCS discharge within Particularly Sensitive Sea Areas (PSSAs). The SubCommittee concluded that, for any future PSSA designations, proposing member states should first undertake a risk assessment in accordance with the methodology set out in MEPC.1/Circ.899, and subsequently determine whether discharge restrictions are reasonable based on the assessment’s findings.\n\nReview and development of NOx emission requirements\n\nPPR 13 commenced its review of the NOx emission requirements under MARPOL Annex VI and the NOx Technical Code (NTC) 2008, structuring its work around engine test cycles, on-board verification methods, the Selective Catalytic Reduction (SCR) system operational status, and other related matters. PPR 13 acknowledged the need to address elevated NOx emissions at low engine loads, while noting divergent views on whether this should be achieved through modifications to test cycles and weighting factors or through alternative regulatory approaches. PPR 13 also examined options to enhance on-board NOx compliance verification, including the potential use of electronic diagnostic functionalities, though no preferred solution was identified. Intersessional work will be necessary across all major areas to develop coherent and technically sound regulatory proposals for consideration at PPR 14 in 2027.\n\nCertification of engines that operate on non-carbon-containing fuels\n\nPPR 13 agreed to proposed amendments to the NTC 2008 to enable the certification of engines operating on noncarbon fuels or fuel mixtures. The revisions include the introduction of hydrogen and oxygenbalance methodologies to complement the existing carbonbalance approach. The amendments are expected to be approved at MEPC 84, for subsequent adoption at MEPC 85 in November 2026 to facilitate timely certification of engines using fuels such as ammonia and hydrogen.\n\nSewage treatment and revision of MARPOL Annex IV\n\nPPR 13 progressed on the revision of MARPOL Annex IV, including developing draft amendments related to the Sewage Record Book (SRB), Sewage Management Plan (SMP) and associated guidance. Due to time constraints, PPR 13 could not finalize discussions on the Type Approval Guidelines and remaining Annex IV amendments. A Correspondence Group was established to continue this work, reporting to PPR 14 in 2027.\n\nRevision of guidelines and specifications for pollution prevention equipment for machinery space bilges\n\nPPR 13 considered updates to the Type Approval Guidelines for oily water separators, which aims to require alarms and automatic discharge stops if the sample water supply is lost, and to add more relevant test fluids to better match current ship fuels. A Correspondence Group was established and tasked with drafting revised guidelines for PPR 14 in 2027.\n\nReview of the IBTS guidelines and amendments to the IOPP certificate and Oil Record Book\n\nPPR 13 agreed on amendments to MARPOL Annex I, introducing a new Regulation 12B and revising the format of the IOPP certificate and the Oil Record Book (ORB). The new regulation introduces the Oily Bilge Water Service Tank, which is intended for the controlled dewatering of oily bilge water, including removal of water by forced evaporation. Regulation 12B will apply to ships above 400 GT fitted with an Integrated Bilge Water Treatment System (IBTS) installed on or after the entry into force date of the new regulation. For ships fitted with IBTS prior to the entry into force date, the regulation needs only to be applied as far as is reasonable and practicable. The amendments are expected to be approved by MEPC 84 in April and adopted by MEPC 85 in November.\n\nThe work on amending the IBTS guidelines – to better reflect the current arrangements and operational procedures, and guidance for the recording of operations in the Oil Record Book Part I (machinery space operations) – was concluded and agreed with a view to approval by MEPC in conjunction with the adoption of the draft amendments to MARPOL Annex I.\n\nMarine plastic litter\n\nStrategy and action plan on marine plastic litter\n\nThe IMO Strategy and Action Plan on marine plastic litter was updated, merging the existing strategy and the 2025 action plan into a single 2026 Strategy and Action Plan, subject to approval by MEPC 84.\n\nPlastic pellets\n\nAfter having considered different pathways for making mandatory measures to prevent environmental pollution from plastic pellets transported at sea, the preferred option was to consider developing a new mandatory code for plastic pellets, under MARPOL Annex III, SOLAS or both. PPR 13 recommended MEPC 84 to make a policy decision on the preferred mandatory instrument.\n\nMarking of fishing gear\n\nA draft MEPC circular was developed to promote the implementation of fishing gear marking systems and the Food and Agriculture Organization of the United Nations (FAO) Voluntary Guidelines on the Marking of Fishing Gear, subject to approval by MEPC 84.\n\nUnified Interpretations (UIs)\n\nPPR 13 agreed on three UIs for approval by MEPC 84 in April 2026.\n\nRegulation 16.9 of MARPOL Annex VI (incinerators)\n\nThe revised UI clarifies that batchloaded incinerators must be designed to reach 600°C in the actual combustion space within five minutes after startup, and this requirement is verified only during typeapproval testing. On-board monitoring of the fluegas outlet temperature is intended solely for safe operation and continuous compliance, not for verifying the design requirement.\n\nRegulation 13.2.3.2 of MARPOL Annex VI (NOx emissions)\n\nThe UI clarifies that for ships constructed on or after the specified dates and operating in the Norwegian Sea or NorthEast Atlantic NOx Emission Control Areas, the threedates criteria (building contract date, keellaying date or delivery date) must be used to determine “the time the ship was constructed” when determining the NOx Tier level required.\n\nRegulation 13.5.1.2 of MARPOL Annex VI (NOx emissions)\n\nThe revised UI clarifies that if an engine is installed on board and tested for its intended purpose more than six months after the applicable reference date in regulations 13.5.1.2 or 13.5.1.3, the actual on-board test date determines which NOx standards apply. If the engine cannot be tested within six months due to unforeseen circumstances beyond the shipowner’s control, the administration may apply the “unforeseen delay in delivery” provisions in a manner consistent with MARPOL Annex I, UI4.\n\nParagraph 7.1.5.4 of the IBC Code (inhibitors)\n\nRather than making a UI for paragraph 7.1.5.4 of the IBC Code, it was determined that amending the text of the IBC Code would be the most suitable approach to address temperature monitoring issues related to products requiring additional inhibitors. The amendments to the IBC Code will be prepared by ESPH 32 for consideration by PPR 14 in 2027.\n\nAny other business\n\nManagement of ammonia effluent from ships using ammonia as fuel\n\nPPR 13 considered four documents addressing the handling of ammonia effluent from ammonia-fuelled ships. The need to properly manage ammonia effluents to safeguard environmental integrity was recognized. However, due to limited available data, further policy discussions were considered premature at this stage. PPR 13 therefore invited additional proposals for PPR 14 in 2027.\n\nRequirement for new tankers carrying crude oil to be fitted with P/V valves\n\nAs a measure to reduce emissions of Volatile Organic Compounds (VOCs), it was agreed to amend Regulation 15 of MARPOL Annex VI to require tankers carrying crude oil to be fitted with P/V valves having a minimum opening pressure of 0.20 bar. This requirement will only apply to crude oil tankers constructed on or after the entry into force date of the amendments. The amendments are expected to be approved by MEPC 84 in April and adopted by MEPC 85 in November.\n\nRecommendations\n\nAs PPR is a Sub-Committee, all decisions concerning rules, regulations and dates are subject to further consideration and approval by the Marine Environment Protection Committee (MEPC).",
    "source_url": "https://www.hellenicshippingnews.com/imo-sub-committee-on-pollution-prevention-and-response-ppr-13/",
    "source": "hellenicshippingnews.com",
    "score": 174
}