{
    "id": 1771225218,
    "date": "2026-02-16",
    "title": "India-US trade deal opens doors for US corn, DDGS exports: industry sources",
    "summary": "Increased US DDGS exports to India will increase tonne-miles, and thus emissions. The deal will initially allow 500,000 tonnes of US DDGS to enter India. Expect higher CO2 emissions due to increased distances sailed by bulk carriers.",
    "content": "The India-US trade deal, agreed early February, would open the door to the exports of US corn and dried distillers grains with solubles, market participants said Feb. 12.\n\nIndia and the US have unveiled a new trade agreement that resets and expands economic ties after months of tension over tariffs and market access. Under the framework agreed on Feb. 2, the US government reduced total tariffs on India to 18%, down from 50%. In return, India will reduce or eliminate duties on a range of US industrial and food products, while protecting sensitive sectors it considers politically important.\n\n“India committing to purchase over $500 billion in American goods is a win for corn farmers,” Mark Mueller, president of the Iowa Corn Growers Association and farmer from Waverly, Iowa, said. “India’s growing population and economy are creating increased demand for Iowa-grown corn, ethanol and dried distillers’ grains.”\n\nMueller added that this deal proves that the world wants what the US grows, and it is a positive step toward clearing out the record-breaking surplus sitting in US bins right now.\n\nThe latest US Department of Agriculture’s Foreign Agricultural Service data showed that from January to November 2025, the US exported 10,702,808 metric tons of DDGS, with top importers being Mexico, South Korea, Vietnam, Indonesia and Turkey. In a year-over-year comparison, exports decreased approximately 3.22%, as the data for the period January to November 2024 showed exports of 11,059,687 mt.\n\nMarket participants saw this as a positive signal for feed flows but noted it should be at a modest scale initially.\n\nA trader in the DDGS market said that even when it is “not a huge incremental demand,” the announcement from India removing duties on US DDGs for a 500,000 mt quota still provided some upside.\n\n“I think it’s great news, we need it,” a broker source said. Coinciding with another trader focused more broadly on the import opportunity, noting that the deal was “great news,” reflecting optimism about new export channels opening.\n\nAnother broker added a similar sentiment for export opportunities, saying, “Sure hope India buys DDGS. We need more export homes. Fewer and fewer are using it in the US, or at least inclusion levels have reduced slightly.”\n\nThe broker source cautioned that if DDGS prices rise too much, “at some point if you take DDGS too high you will lose domestic usage.”\n\nPlatts, part of S&P Global Energy, assessed CIF New Orleans DDGS barges for the February shipment period at $216/short ton and the Chicago DDGS truck market for the same delivery period was assessed at $182/st.\n\n“We appreciate the potential framework of a deal with India that could lead to demand for Nebraska corn, whether in the raw form or in value-added products such as ethanol or red meat,” a spokesperson from the Nebraska Corn Growers Association told Platts.\n\nIn the corn market, a trader source said that “India has a tendency to promise things that never come to fruition.”\n\nTalking about the energy sector, a trader source said that it will be an opportunity more focused on feed ingredients, DDGS, and soybean meal than for corn as a crop, given that “they don’t need to be crushing grain for biofuels when they’re a net importer.”\n\nPlatts assessed FOB US Gulf April corn shipments at $212.50/mt on Feb. 12, an increase of $2.46/mt since Feb. 2, when India and the US trade announced the deal.",
    "source_url": "https://www.hellenicshippingnews.com/india-us-trade-deal-opens-doors-for-us-corn-ddgs-exports-industry-sources/",
    "source": "hellenicshippingnews.com",
    "score": 22
}