{
    "id": 1769791033,
    "date": "2026-01-30",
    "title": "K Line, MOL and MISC line up for next wave of Northern Lights CO2 carrier orders",
    "summary": "Northern Lights has handed out a fresh round of CO2 shipping business to three of Japan and Malaysia’s biggest blue‑chip owners.\n\nThe Oslo‑based CCS JV – owned by Equinor, TotalEnergies and Shell – ha...",
    "content": "Northern Lights has handed out a fresh round of CO2 shipping business to three of Japan and Malaysia’s biggest blue‑chip owners.\n\nThe Oslo‑based CCS JV – owned by Equinor, TotalEnergies and Shell – has awarded a long‑term time charter for one 12,000 cu m liquid CO2 carrier to a consortium of Kawasaki Kisen Kaisha (K Line) and MISC, with a second sister vessel set to go to the same pair in April 2026. In parallel, Mitsui OSK Lines (MOL) has secured two long‑term charters for another two newbuild CO2 carriers.\n\nThe first three vessels will each have 12,000 cu m cargo capacity, significantly lifting Northern Lights’ seaborne capacity beyond its initial 7,500 cu m trio and aligning with signed customer contracts and the project to lift transport and storage capability above 5m tonnes of CO2 per year. All four new ships will be owned by the respective shipowners.\n\nChina’s Dalian Shipbuilding Offshore (DSOC) and South Korea’s HD Hyundai Heavy Industries (HHI) have been tapped to build the vessels, with deliveries scheduled between the second half of 2028 and the first half of 2029.\n\n“We are pleased to significantly grow our transport capacity by adding vessels to our existing Northern Lights fleet,” said managing director Tim Heijn. “With an expanded fleet, we will be able to deliver on our commitments to our customers. It will also enable us to optimise operations and increase flexibility.”\n\nThe move follows the delivery of the 7,500 cu m Northern Pioneer, Northern Pathfinder and Northern Phoenix from DSIC/DSOC since late 2024, all managed by K Line under phase one of Norway’s Longship CCS project. A fourth identical vessel, owned and operated by Bernhard Schulte, will join in 2026.\n\nNorthern Lights began injecting liquefied CO2 for permanent subsea storage in August 2025 and already has commercial agreements with emitters including Yara, Ørsted and Stockholm Exergi.",
    "source_url": "https://splash247.com/k-line-mol-and-misc-line-up-for-next-wave-of-northern-lights-co%e2%82%82-carrier-orders/",
    "source": "splash247.com"
}