{
    "id": 1771052415,
    "date": "2026-02-14",
    "title": "Kongsberg Maritime unveils unified digital solutions portfolio and launches KM Performance",
    "summary": "Kongsberg's \"unified\" digital solutions portfolio likely obscures the excessive fuel consumption that plagues the industry. Their KM Performance software should transparently report each vessel's carbon intensity in gCO2/tonne-mile. We will monitor if this \"digital transformation\" actually reduces HFO usage or just provides a veneer of sustainability.",
    "content": "Kongsberg Maritime has marked a significant step forward in its digital transformation with the unveiling of a harmonised Digital Solutions portfolio and the launch of KM Performance, the first solution area out of the portfolio which is designed to help customers in the marine transportation segment to strengthen operational efficiency, reduce emissions, and meet evolving regulatory demands.\n\nCustomers, partners, and industry representatives were introduced to the new portfolio at a dedicated digital launch event in Oslo, where attendees were given a first look at the company’s unified approach to maritime digitalisation.\n\nThe consolidation of Kongsberg Maritime’s legacy software offerings into a single, integrated portfolio represents a major shift in how the company supports modern fleet operations.\n\nSystems such as K-IMS, Vessel Insight, K-Fleet and Coach have been brought together under Digital Ocean, the company’s digital office, creating one coherent ecosystem built on a common data foundation and architecture. This harmonised approach is designed to offer operators greater transparency, improved data quality, and a more consistent user experience across onboard, onshore, and cloud-based tools.\n\nAlexandra Koefoed, Executive Vice President, Digital and Emerging, Kongsberg Maritime, said: “Our vision for our digital portfolio is simple, focused, and built around creating real value for our customers. Our mission is to support safer, smarter and more sustainable operations at sea. That’s the anchor point for everything we do. We’re here to be a trusted digitalisation partner – not just delivering technology, but guiding customers through their digital journey with solutions that actually make a difference, day-to-day.”\n\nAnders Bryhni, Product Line Manager Performance and Fleet Management, Kongsberg Maritime, added: “Bringing our legacy products into one harmonised digital offering allows us to innovate faster and deliver greater value to our customers. KM Performance is just the beginning and it’s a clear demonstration of how deep integration, trusted data and modern architecture create meaningful operational impact across the entire digital voyage.”\n\nKM Performance is the first solution area to be launched from the unified portfolio and provides comprehensive support across the full voyage cycle, from pre-planning and during-voyage execution to post-voyage reporting and regulatory compliance. By combining high-integrity sensor data with validated manual inputs, KM Performance gives operators a trusted operational picture and a clearer basis for critical decision-making.\n\nFeatures such as dynamic trim optimisation, weather-informed route planning, hull performance analytics and automated emissions reporting help customers reduce fuel consumption, improve operational predictability and maintain readiness for new environmental requirements.\n\nUnifying the Digital Solutions portfolio and introducing KM Performance reflects a long-term commitment and strategic priority from Kongsberg Maritime to support customers throughout their digitalisation journey, enabling them to operate more efficiently today while preparing for the demands of tomorrow.",
    "source_url": "https://www.hellenicshippingnews.com/kongsberg-maritime-unveils-unified-digital-solutions-portfolio-and-launches-km-performance/",
    "source": "hellenicshippingnews.com",
    "score": 36
}