{
    "id": 1771138817,
    "date": "2026-02-15",
    "title": "Labour hammers Northern Ireland with new green shipping tax",
    "summary": "Northern Ireland faces a 6% hike in shipping costs due to the incoming Emissions Trading Scheme (ETS), adding to existing Brexit-related burdens. Stena Line anticipates an extra £9 million annually, or £15 per HGV, van and car. Despite industry claims of investment in sustainable ferries, reliance on carbon-intensive fuels persists, warranting scrutiny of actual emissions reductions.",
    "content": "Northern Ireland businesses are set to be hammered by a green tax which bosses fear will make them uncompetitive.\n\nA new tax on ferries to Northern Ireland, set to be introduced this summer, will swell freight rates – weighing on the economy and driving up prices.\n\nThe levy system, known as the emissions trading scheme (ETS), stands to increase shipping costs to the province by 6pc when it comes into force in July, according industry estimates.\n\nThe UK Chamber of Shipping said that will put more pressure on an economy where supply chain costs are already higher than the rest of the UK because of arrangements imposed under Brexit’s Windsor Framework.\n\nIt said the tax will also add to the red tape foisted on business following the agreement, which placed Northern Ireland in the EU’s single market for goods after Brexit.\n\nThe ETS scheme requires shipping firms to pay for their CO2 emissions as part of the Government’s push to reach net zero by 2050.\n\nUnlike other ferry routes, Northern Ireland will not be exempt from the charges, even though 90pc of commercial and passenger traffic goes by sea.\n\nThe Chamber said ferry firms will most likely have to pass the additional charges on.\n\nStena Line, which operates ferries to Belfast from Liverpool, Heysham in Lancashire and Cairnryan in Scotland, estimates that the scheme will increase its costs by £9m annually. That would average £15 for every HGV, van and car.\n\nThe Chamber said an initial 50pc deduction to match the carbon charges on voyages between Britain and Republic of Ireland will provide little relief.\n\nThat is because exporters in Northern Ireland compete mostly with firms in Britain rather than the province’s southern neighbour, to which they will be at a structural disadvantage.\n\nUK firms have already spent millions on some of the most sustainably designed ferries, including methanol and rotor sail propulsion, leaving no financially viable way forward, it claimed.\n\nThe Chamber said: “The sector supports the UK’s climate goals, but cannot deliver meaningful emissions reduction without the necessary fuels, infrastructure, and clear guidance in place.\n\n“Premature implementation risks higher costs for passengers and freight, with limited environmental gain. However, the Government is pressing ahead, leaving industry in an untenable position.”\n\nThe trade group urged ministers to delay introduction of the scheme while further assessments are carried out and said the revenue raised should be ring-fenced for investment in clean fuels and quayside power connections.\n\nThe Department for Energy Security and Net Zero said that it is for ship operators to decide how much of the expense of the ETS scheme to pass on, and that consumers should not see significant costs.\n\nA spokesman said: “Pricing emissions is a cost-effective way to cut carbon emissions and encourage greener travel. We are working closely with industry on implementation.”",
    "source_url": "https://www.telegraph.co.uk/business/2026/02/14/labour-hammers-northern-ireland-with-new-green-shipping-tax/",
    "source": "telegraph.co.uk",
    "score": 117
}