{
    "id": 1770793212,
    "date": "2026-02-11",
    "title": "LR Advisory partners with Geogas Trading to strengthen operational readiness for FuelEU pooling",
    "summary": "Geogas Trading hires LR Advisory to prepare for FuelEU Maritime compliance and emissions pooling. This partnership aims to mitigate commercial risks associated with the impending FuelEU regulations and associated penalties. Will Geogas reduce its carbon intensity, or simply shuffle credits to appear compliant?",
    "content": "The project will draw on LR Advisory’s regulatory, technical and commercial expertise to ensure Geogas Trading is well positioned with the first FuelEU Maritime compliance cycle and pooling opportunity approaching.\n\nLloyd’s Register (LR) Advisory has been appointed by Geneva-based LPG trader and shipowner Geogas to support the development of a multi-year emissions compliance plan and operationalisation of FuelEU pooling, as it prepares for the first compliance cycle of FuelEU Maritime.\n\nUnder the agreement, LR Advisory will provide expert insight into the commercial implications of current and forthcoming emissions regulations, alongside targeted knowledge transfer to build internal capability. The project will support Geogas Trading to design and implement its own FuelEU Maritime pooling structure and develop the operational frameworks and steps needed to execute pooling.\n\nLR Advisory will also work with the company to map and mitigate commercial risk of FuelEU , helping to shape a forward-looking compliance strategy that extends beyond the initial FuelEU cycle.\n\nLuke Shu, Technical Advisory Manager – Maritime Commercial Markets, LR Advisory, said: “FuelEU Maritime represents a fundamental shift in how emissions regulation affects commercial outcomes.\n\n“Charterers and shipowners are now directly exposed to incentives and penalties that influence day-to-day operational, chartering decisions and P&L. Our role is to support organisations like Geogas understand those impacts in detail and put practical structures in place that allow them to operate confidently and competitively as the regulatory landscape tightens.”",
    "source_url": "https://www.hellenicshippingnews.com/lr-advisory-partners-with-geogas-trading-to-strengthen-operational-readiness-for-fueleu-pooling/",
    "source": "hellenicshippingnews.com",
    "score": 113
}