{
    "id": 1771398024,
    "date": "2026-02-18",
    "title": "LR approval clears path for cubic LNG tank design for LNG-fuelled vessels",
    "summary": "GTT's CUBIQ tank design receives LR approval, promising increased cargo space on LNG-fueled vessels. The cubic design streamlines construction, but LNG's methane slip remains a climate concern. Will this efficiency gain offset the environmental impact of continued reliance on fossil fuels?",
    "content": "Lloyd’s Register (LR) has issued an approval in principle (AiP) for GTT’s CUBIQ™ LNG fuel containment system. This cubic tank design aims to streamline project engineering and planning, simplify shipyard construction processes and free up more cargo space on LNG-fuelled vessels.\n\nGTT CUBIQ™ brings a new approach to LNG containment by extending its suitability to various types of LNG-fuelled ships, including container and passenger ships. Its near-cubic geometry eliminates traditional upper and lower chambers, enabling standardised engineering and simplifying construction. With fewer complex corner areas, installation is faster, helping shipyards reduce build time. Once in service, GTT CUBIQ™ provides strong volumetric efficiency, maximising usable space and unlocking additional cargo capacity.\n\nThe approval also verified the ability of GTT CUBIQ to operate under 1 barg design pressure, a feature that would support cold ironing regulation compliance. Pressure build-up capability for membrane tanks is being evaluated for GTT Mark III Technology conventional designs for the use of LNG as fuel and is becoming a key consideration for LNG-fuelled newbuilds.\n\nLR’s role was to provide early-stage assurance that new designs meet rule requirements and are supported by appropriate risk assessment through construction and operation.\n\nConstantinos Chaelis, LR’s Global Gas Segment Director, said: “As the use of LNG as fuel grows at a considerable pace, expanding beyond gas carriers, it is critical that novel containment designs are assessed against robust rule requirements.\n\n“This approval in principle supports the safe development of an innovative containment system that can be applied across a wider range of ship types.”\n\nFrançois Michel, CEO of GTT, said: “The AiP from Lloyd’s Register is a strong endorsement of our GTT CUBIQ™ technology and confirms the robustness of its design.\n\n“This innovation responds directly to shipyards and ship-owners’ expectations by simplifying the integration of membrane containment systems for LNG tanks, optimising space on the vessels, and thereby supporting the growing adoption of LNG as a marine fuel.”",
    "source_url": "https://www.hellenicshippingnews.com/lr-approval-clears-path-for-cubic-lng-tank-design-for-lng-fuelled-vessels/",
    "source": "hellenicshippingnews.com",
    "score": 56
}