{
    "id": 1771311610,
    "date": "2026-02-17",
    "title": "Maress 2.0: Data-driven Decarbonization Steering Towards New Performance Heights",
    "summary": "VPS's Maress software claims to have saved 300+ vessels 12,000 tonnes of CO2 during a summer campaign. We remain skeptical of self-reported data without independent verification of actual fuel consumption. Has Maress addressed the fundamental issue of excessive heavy fuel oil (HFO) usage?",
    "content": "Maritime decarbonization legislation and directives continue to increase and diversify. This places elevated demands upon shipowners and operators to provide meaningful, transparent and traceable data to legislative bodies, in order to substantiate their hopefully decreasing carbon-footprint and increasing compliance performance.\n\nSince its launch in 2016, the VPS Maress software application has led the drive to assist in the decarbonization of the offshore shipping market. This cloud-based system, where no hardware installation is required, seamlessly connects with leading providers of data collection and ship-to-shore technologies. The aim is to significantly reduce fuel and energy consumption, offering environmental, financial, and strategic benefits to its users, delivering tangible business value through its functionality and insights.\n\nWith more than 700 offshore vessels currently utilizing Maress to reduce their fuel consumption, emissions and costs, via the proven energy efficiency solutions Maress provides, has seen this software application go from strength to strength.\n\nThe proof of the impact Maress can provide, has been seen through three successive Annual Summer Campaigns 2023-25, where VPS invited numerous offshore shipping companies and their vessels to participate in a three-month programme (June-August), each year. With each vessel using Maress, the campaign is a competition to see how much carbon dioxide emissions could be reduced per vessel and as a collective fleet, utilizing the tools Maress provides.\n\nThe results have been very impressive: 2025 – 300+ vessels from 12 leading shipping companies saved approximately 12,000mt of carbon dioxide emissions. On average the participating vessels improved their efficiency by more than 10%. That kind of progress doesn’t happen by chance – it is the result of practice, dedication and crews continuously refining how they operate. Post-campaign, VPS highlighted the vessel, Volantis, a CSV operated by Havila Subsea & Renewables, and its dedicated crew. Throughout the campaign Volantis spent ~75 % of her days in DP or Transit, modes that account for >85 % of total fuel use. Yet the crew still delivered significant savings through relentless, real time optimization. The Master of the Volantis stated, “We’re always chasing the next increment. There’s a continuous dialogue between bridge, engine room, charterer and shore management on how to do better. During transits we agree an economical speed window with the client, then run only the engines and thrusters we need – each kept in its sweet spot load range.”\n\n2024 – 303 vessels from 12 leading shipping companies saved over 7,000 mt of carbon dioxide emissions. Back in 2024, REM HSEQ Manager Iliyan Aleksandrov commented: “REM has committed to optimising the energy consumption of our operations and being an active player in the ongoing transition to a more sustainable maritime industry. We achieved our ISO 50001 certification this year, and amongst other initiatives, we were excited to extend our working relationship with VPS Decarbonisation on this campaign. Crew dedication, strong focus on energy efficiency and consumption optimization, combined with VPS´ decarb advisory service and Maress software were the key factors in achieving the amazing results”.\n\n2023 – 133 vessels from 8 leading shipping companies saved 10,000mt of carbon dioxide emissions. Back in 2023, Solstad Offshore’s Chief Sustainability Officer, Tor Inge Dale concluded: “We strive to stay in the forefront of the industry’s change towards more sustainable operations, and we firmly believe in collaboration in combination with powerful digital tools such as Maress to facilitate just the kind of benchmarking to make this happen. We´ll be ready for the next campaign, and hopefully with friendly competition against even more vessels and companies wanting to be part of the change”.\n\nMaress has and continues to evolve, to lessen the workload on ship operators, when it comes to monitoring, verifying and reporting, vessel performance and efficiency, plus providing actionable insights at every level, from fleet-wide trends to the performance of individual vessel operations.\n\nAnd now, the evolution continues through the recently launched Maress 2.0. This enhanced and advanced version, allows users to instantly compare vessels, or track a single vessel’s progress over time, helping to identify opportunities for efficiency and cost savings. Integrated data validation and smart notifications support in ensuring the vessel data remains trustworthy, so operators and their crew can respond to issues before they impact operations or compliance.\n\nExisting users of Maress will have peace-of-mind as they see that the new Maress works seamlessly alongside their existing version, allowing the continuation of all previous functionalities. All the key features from legacy Maress have been transferred and enhanced within the new Maress 2.0 platform, with the addition of new key features.\n\nKey Highlights of Maress 2.0:\n\nImproved analytics and reporting with great flexibility on time periods\n\nWeather information per day in-map provides more insights\n\nUnderstand the effect of your initiatives by baseline comparison year on year\n\nSupport for alternative fuels such as Biofuels\n\nUseful voyage replay with weather, activities and efficiency meters\n\nEnhance your data quality with the new Data QA and Validation module\n\nOptimize your energy utilization with advanced Energy Analytics\n\nFuture-proof technology and adaptive user interface\n\nIn terms of benchmarking a fleet’s performance against historical baselines or any custom data range, Maress Fleet alows comparison of any period in order to identify trends and measure the impact of operational changes.\n\nUsers can visualize, time spent vs fuel spent, to understand where their fleet operates most efficiently and where optimization opportunities exist.\n\nThe software now includes a new “Add to Export” button available on every front-end component. With this feature, users can easily select any data view—such as tables, metrics, and charts—and include them in a customized export. Once components are added, the PDF Exporter provides a live preview where users can drag and drop to rearrange the order, remove items, and organize the layout exactly how they want.\n\nThis gives users full control over what gets exported and how it appears in the final PDF report, making it easier to create polished, presentation-ready documents in just a few clicks.\n\nMaress 2.0 now has a powerful comparison tool, Maress Vessel Compare, that analyzes more than 10 key performance KPIs across offshore vessels—making it easier than ever to see which vessel performs best. Multiple vessels can be compared side by side at the same time, giving a clear and fair overview.\n\nThe vessel comparison also includes a spider chart overlay, which visually compares performance across all vessels at a glance.\n\nThis allows users to easily measure how vessels perform against each other—either across their historical performance or within specific projects.\n\nIt’s especially useful for analyzing sister vessels, helping to quickly spot strengths, weaknesses, and operational differences.\n\nVia Maress Vessel, the software now allows greater insights into the performance of single vessels, where its possible to playback all activities and investigate performance down to individual reported event level. For example, did a vessel overconsume on a specific day? Check the weather symbol for a possible explanation and deeper operational context.\n\nUsers can now easily identify when, where, and why poor fuel performance occurs—at any point in time.\n\nSpider charts compare a vessel’s current performance against its own historical baseline as well as the average of similar vessel types, giving clear context on where the vessel is excelling or needs improvement.\n\nThe new Maress 2.0 now offers a data quality and validation module. This not only alerts to potential data issues, but also explains what’s wrong, so users can take quick and informed action. This can be continuously used either onboard or ashore to secure the data quality. Personalized notifications empower the crew to address issues proactively; reducing the risk of compliance breaches and ensuring company KPIs and regulatory reports (DCS/MRV) are reliable.\n\nTrustworthy insights start with trustworthy data.\n\nMaress 2.0 offers an add-on-module, Maress Energy Analytics which includes an Energy Flow Diagram which gives a clear, visual overview of how fuel energy is used across the vessel. Instead of just seeing fuel consumption numbers, its now possible to see where the energy is transmitted and how efficiently it is converted into usable power.\n\nWhy this matters:\n\n✅ Identify inefficiencies in the energy chain\n\n✅ Understand exactly how fuel is being used on board\n\n✅ Optimize operations such as generator setup and reduce unnecessary consumption\n\n✅ Make data-driven decisions to improve performance and cost savings\n\nThis feature turns complex data into actionable insight, helping to spot energy losses, improve efficiency, and ultimately lower operational costs.\n\nThe new Power Output Graph provides a complete, real-time view of how vessel’s engines, propulsion, and thrusters perform in relation to its speed and operational mode. With this interactive visualization, one can see exactly how power is generated and consumed across different systems, helping to understand performance patterns, spot inefficiencies, and make informed operational decisions.\n\nWhy this matters:\n\n✅ Monitor how efficiently power is converted into vessel movement\n\n✅ Identify energy-intensive operations and optimize accordingly\n\n✅ Compare modes (DP, Transit, Standby, etc.) to improve efficiency and planning\n\n✅ Customize your view to focus on the data that matters most\n\nDesigned to connect the offshore ecosystem, Maress 2.0 now gives owners, managers, operators and charterers, clear visibility from fleet trends to thruster level detail, providing actionable insights that improve, efficiency, compliance and cost savings.\n\nMaress 2.0 is already receiving very positive feedback:\n\n“The new Maress 2.0 by VPS Decarbonisation has been really impressive so far. The user interface with more liquid design is working very well, and the added functionality on exporting specific graphs to pdf are more than welcome. The Analytics-module enables us to dig more into the high-resolution data and to provide detailed knowledge on the operation and setup of vessels in different modes. We are also using the MRV-module for the 2025 EU MRV-reporting, and the Cargo & Bunker input function are working very well for the users onboard the vessels.\n\nWith the new NOx-module also integrated in Maress, we see a more professional and complete one-stop-shop for integrated fuel monitoring and reporting.",
    "source_url": "https://www.hellenicshippingnews.com/maress-2-0-data-driven-decarbonization-steering-towards-new-performance-heights/",
    "source": "hellenicshippingnews.com",
    "score": 200
}