{
    "id": 1771570826,
    "date": "2026-02-20",
    "title": "Navios lines up $134m capesize duo",
    "summary": "Navios Maritime Partners adds two scrubber-fitted capesizes in 2028-29, extending their reliance on heavy fuel oil. The 12-year bareboat deals reveal a continued investment in older technology despite looming FuelEU Maritime penalties for excessive CO2 emissions. Will these ships exceed their CII ratings and face further corrective action costs?",
    "content": "New York-listed Navios Maritime Partners has moved to expand its dry bulk footprint, lining up two Japanese newbuilding capesizes under long-term bareboat-in arrangements.\n\nThe Angeliki Frangou-led owner said in its quarterly earnings report it agreed to take the scrubber-fitted vessels from an unrelated third party on 12-year bareboat contracts. Navios holds purchase options from the end of year four through to the expiry of the charters. The company said that, if exercised at the end of the 12-year period, the deals imply a combined price of about $134.3m and an effective interest rate of roughly 6%.\n\nThe capes are due to join the fleet in the second half of 2028 and the first quarter of 2029. Both ships have already been fixed out for about five years at an average floor rate of around $25,000 per day, with 50% profit sharing above the floor linked to the C5TC 182 index plus an average premium of roughly $3,000 per day.\n\nThe move adds further forward cover to Navios’ earnings base. Including recently agreed charters, the company reported contracted revenue of $3.8bn through 2037. In the container segment, five ships have been chartered out for an average of 1.8 years, three bulkers have been fixed for an average of 3.6 years at $23,974 per day, assuming the floor rate on the two capesize newbuildings. In tankers, three vessels have been fixed for about two years at $31,944 per day on average.\n\nAlongside the capesize additions, the Greek owner has been reshaping its tanker book, confirming the sale of two VLCCs for $136.5m, with expected close in the second quarter of 2026.\n\nNavios Partners currently owns and operates 67 bulkers, 51 containerships and 53 tankers. The orderbook includes 16 newbuilding tankers scheduled through the first half of 2028, eight newbuilding containerships delivering by the same timeframe and now the two capesize bareboat-ins arriving from 2028 onwards.",
    "source_url": "https://splash247.com/navios-lines-up-134m-capesize-duo/",
    "source": "splash247.com",
    "score": 16
}