{
    "id": 1771311640,
    "date": "2026-02-17",
    "title": "Performance Shipping",
    "summary": "Performance Shipping claims to prioritize environmental performance, but offers no specifics on reducing carbon intensity. Their commitment to \"traditional shipping values\" raises concerns about continued heavy fuel oil (HFO) usage. With FuelEU Maritime on the horizon, dirtiestships.com will monitor their fleet's compliance and potential fines.",
    "content": "Shipping is a rapidly changing industry, and to succeed in it, Performance Shipping focuses on three key priorities – consistency, integrity, and long-term value. These are the values that are reflected in the company’s name, and this is what Performance Shipping strives for every day, in every vessel and across all of its operations.\n\n“Performance across every voyage, every decision, and every relationship,” says Andreas Michalopoulos, CEO of Performance Shipping Inc. “At Performance Shipping, ‘performance’ is more than just a name, it’s a mindset.”\n\nPerformance Shipping Inc. is a ship-owning company that operates its own fleet of modern, high-quality tanker vessels. At the time of writing, its fleet includes twelve tankers, ten of which are currently operating on the water, as well as two newbuild tanker vessels scheduled to be delivered in early 2026 and early 2027.\n\nTraditional but Forward-Looking\n\nEvery aspect of the company’s work reflects a commitment to safe, efficient operations, supported by a team of experienced maritime professionals both at sea and ashore. Michalopoulos has led the company since 2020, a period of growth, modernisation, regulatory transformation, and strategic fleet renewal. Michalopoulos has also overseen a company-wide strategic process that has strengthened the company’s position as a reliable and transparent player in the global tanker sector.\n\n“Our approach combines traditional shipping values, safety, reliability, and professionalism, with a forward-looking mindset that embraces technology, environmental performance, and continuous improvement,” Michalopoulos tells us. “We maintain a modern, environmentally efficient fleet while operating with a streamlined structure that allows for quick and well-informed decision-making.”\n\nPerformance Shipping combines this flexibility with a disciplined investment strategy and a strong safety culture, enabling it to deliver consistent value to charterers, investors, and partners.\n\n“Above all, we believe in doing things with transparency, accountability, and care for our people and our trusted charterers,” says Michalopoulos.\n\nA Proud Crew\n\nFor Michalopoulos, mentioning Performance Shipping’s people is not just lip service, but a core component of the business’s strategy and outlook.\n\n“Shipping is ultimately a people business,” he shares. “We take pride in building a loyal and competent team, both onboard and ashore.”\n\nThat pride is reflected in the way Performance Shipping attracts and supports talent.\n\n“We hire individuals who share our values of professionalism, respect, and teamwork,” Michalopoulos says. “We support them through continuous training, open communication, and a focus on health and well-being, because we believe that a motivated team is essential to our long-term success.”\n\nThe investment in Performance Shipping’s people is one that Michalopoulos is clear has paid off, and in talking to him it is clear how much pride he takes in the company’s team on land and at sea.\n\n“I would like to highlight our people. Our success is built on the dedication of our shore and sea staff, who embody our values every day,” Michalopoulos tells us. “Shipping is a demanding industry, but it is also deeply human, and it takes resilience, teamwork, and pride in one’s work to deliver consistent results.”\n\nBeing able to rely on your people is even more important given how volatile and changeable the shipping sector as a whole can be.\n\n“In a world where change is constant, our goal is to remain steady, principled, and forward-looking,” says Michalopoulos. “Performance Shipping continues to evolve by modernising our fleet, strengthening our operations, and investing in our people, while staying true to the values that have brought us here. We don’t chase trends; we build trust and deliver performance.”\n\nAn Evolving Industry\n\nAs proud as Michalopoulos is of his people, he is equally realistic about the challenges facing them.\n\n“The shipping industry is cyclical and constantly evolving. We have faced challenges ranging from global market fluctuations to increasingly complex environmental and regulatory requirements,” Michalopoulos shares. “The path toward decarbonisation, while necessary and welcome, requires substantial investment, planning, and coordination. For a smaller organization like ours, ensuring we stay ahead of these developments has been both a challenge and a defining strength.”\n\nNavigating these challenges is where Performance Shipping lives up to its name, taking proactive steps to improve efficiency and ensure regulatory compliance across its fleet. The company has made strong investments in emissions-monitoring technologies, enabling transparent reporting in line with EU ETS and FuelEU Maritime requirements. That in turn helps to enhance fuel efficiency and reduce emissions through the use of voyage optimising software and speed management practices.\n\n“We are installing energy-saving devices designed to improve the hydrodynamic characteristics of our vessels, resulting in greater fuel efficiency and measurable emissions reduction,” Michalopoulos says. “Looking ahead, our fleet renewal program has positioned us for the future. The two remaining newbuilds we have on order demonstrate our commitment to a modern and sustainable fleet, further enhancing our long-term vision.”\n\nA Vision of the Future\n\nThat long-term vision is important to both Michalopoulos and Performance Shipping as a whole. With a strong team built around strong values, the company plans to go a long way.\n\n“Our focus is on operational excellence and delivering dependable service to our clients. In the near term, our priorities are centred on growth through modernisation and efficiency,” Michalopoulos says. “We are looking forward to the delivery of our newbuilds which marks the next step in our fleet renewal strategy. With the recent addition of the two Suezmax vessels now in operation our fleet is already reflecting this phase of growth. While the industry continues to face delays in the global decarbonization transition, including the slower rollout of alternative fuels, high costs, and ongoing regulatory uncertainty, our approach remains steady and practical. We are investing in technologies that offer tangible efficiency gains today, while preparing our fleet to adapt as the regulatory and energy landscape evolves.”\n\nBeyond those significant but more immediate plans, Performance Shipping has an even greater vision for the future.\n\nAs Michalopoulos tells us, “Our broader goal is to remain a trusted, transparent, and responsible shipping partner that consistently performs as the industry evolves.”\n\nAs the industry evolves, Performance Shipping is sure to evolve with it.",
    "source_url": "https://businessfocusmagazine.com/2026/02/16/performance-shipping-performance-mindset-interview-with-ceo-andreas-michalopoulos/",
    "source": "businessfocusmagazine.com",
    "score": 116
}