{
    "id": 1771398034,
    "date": "2026-02-18",
    "title": "Seanergy adds two bulkers to newbuild slate",
    "summary": "US-listed Greek owner Seanergy Maritime has expanded its newbuilding programme, signing for two additional capesize-class vessels at Chinese yards and lifting its total investment in new tonnage to ab...",
    "content": "US-listed Greek owner Seanergy Maritime has expanded its newbuilding programme, signing for two additional capesize-class vessels at Chinese yards and lifting its total investment in new tonnage to about $226m.\n\nThe Stamatis Tsantanis-led company, which placed its first-ever newbuilding order in October, has now lined up three large scrubber-fitted bulkers for delivery between 2027 and 2028.\n\nIn January, Seanergy contracted a 181,500 dwt newbuild at Hengli Shipbuilding in Dalian – a sister ship to the unit ordered last year at the same yard. The price is about $75.2m, with delivery scheduled for the third quarter of 2027.\n\nThe company also revealed a deal for a 211,000 dwt scrubber-fitted newcastlemax at Jiangsu Hantong Ship Heavy Industry Co for around $75.8m. Delivery is expected in the second quarter of 2028.\n\nSeanergy said that all three vessels will feature modern, fuel-efficient designs aimed at cutting emissions and improving consumption, in line with the company’s fleet renewal and decarbonisation plans.\n\nAlongside the ordering spree, Seanergy has agreed to dispose of the 2010-built Dukeship through an 18-month bareboat charter to spinoff United Maritime. United has advanced a $5.5m downpayment and will pay $9,450 per day, with a purchase obligation of $22.1m at the end of the charter period.\n\nChief executive Tsantanis said the expanded programme secures early delivery positions in what he sees as a supportive capesize market – pointing to firm iron ore and bauxite trades, limited newbuilding supply in the segment and favourable ton-mile trends heading into 2026.",
    "source_url": "https://splash247.com/seanergy-adds-two-bulkers-to-newbuild-slate/",
    "source": "splash247.com",
    "score": 39
}