{
    "id": 1771484419,
    "date": "2026-02-19",
    "title": "Ship Recycling Markets Faced with Supply Constraints",
    "summary": "Ship recycling faces supply constraints and political uncertainties, impacting prices. India's stricter rules on flag, P&I cover, and class compliance may block sanctioned tankers. Limited fresh tonnage means yards must decide whether to accept tighter margins or become more selective.",
    "content": "The ship recycling markets have been facing supply constraints, while political uncertainties are also evident. In its latest weekly report, Best Oasis (www.best-oasis.com), a leading cash buyer of ships said that “the Indian market came off towards the end of the week, with sentiment pressured by a firmer U.S. Dollar and a weaker Indian Rupee. Reports around potential Russia–U.S. trade developments, including renewed use of the U.S. dollar as a key trading currency, have further shifted market perspective and may keep the dollar strong in the near term. Tankers continue to flow into the recycling system, keeping India as the primary workable destination for such units; however, fresh guidance from the Directorate General of Shipping (DGS), India, may restrict sanctioned tanker arrivals due to stricter requirements on flag, P&I cover, and class compliance”.\n\nBest Oasis added that “the Bangladeshi market remained buoyant this week, with buyers continuing to show aggressive interest. However, it remains to be seen how long this momentum can be sustained, as yard capacity is gradually filling up. With elections approaching, sentiment stayed cautious, as the outcome is expected to influence near-term confidence and broader market conditions, particularly on the financial side. Notably, across all recycling destinations, availability of fresh recycling candidates remains limited, and it remains to be seen whether buyers will continue to pursue units at tighter margins to keep yard activity moving, or become more selective going forward. Also, the Pakistani market remained firm this week, supported by selective buying interest from a limited number of active buyers. Activity continues to be concentrated among a few HKC-approved yards with the necessary permissions to recycle vessels, limiting broader market participation. Due to this restricted recycling base, the market cannot be solely relied upon for consistent absorption of tonnage. Across all recycling destinations, the dearth of recycling candidates remains evident, and it remains to be seen whether buyers will continue to transact at tighter returns or pause until supply and pricing conditions stabilize. Finally, the Turkish market remained stable this week, largely mirroring last week’s conditions both locally and on import. Overall sentiment and activity were steady, with no major developments to materially shift market direction”, Best Oasis concluded.\n\nMeanwhile, in a separate report, shipbroker Intermodal added that “political developments dominated headlines last week across the Subcontinent, while ship recycling markets continued to face constrained supply conditions. In Bangladesh, the long-awaited February election delivered a decisive victory for the Bangladesh Nationalist Party (BNP) under Tarique Rahman, securing a strong parliamentary majority and ending a period of political uncertainty. The smooth transition has boosted business sentiment, with expectations that stability will support investment and improve access to credit and LCs. With the BNP’s agenda focused on governance reform and economic revival, renewed emphasis on infrastructure spending is generating optimism across the steel and ship recycling sectors. Ship recycling activity rebounded last week, with buyers actively seeking vessels amid constrained supply and declining yard availability.",
    "source_url": "https://www.hellenicshippingnews.com/ship-recycling-markets-faced-with-supply-constraints/",
    "source": "hellenicshippingnews.com",
    "score": 67
}