{
    "id": 1771657217,
    "date": "2026-02-21",
    "title": "Shipping’s ‘constantly changing reality’",
    "summary": "DNV analysts report that geopolitical instability is derailing shipping's climate focus. Trade wars and the IMO's failure to adopt a Net-Zero Framework are primary concerns. Shifting global power dynamics, especially shipbuilding capacity, will exacerbate shipping's adaptation challenges.",
    "content": "In a year where “geopolitics stole almost all the headlines”, 2025 has left the shipping markets in a “constantly changing reality”, according to Jakub Walenkiewicz, principal market analyst at DNV.\n\nSpeaking in an episode of DNV Market Views, Walenkiewicz said this “new world order … creates a very complex environment to understand”. Shipping markets must therefore find a way to “function, adapt or perhaps even reinvent”.\n\nWalenkiewicz was joined by Christopher Pålsson, managing director and partner of maritime-insight, in a discussion dissecting last year and how it sets the tone for 2026. Last year was marked by trade wars, port fee disputes, and a significant setback in international climate policy with the IMO’s failure to adopt a Net-Zero Framework, noted Walenkiewicz.\n\nPålsson said that while seaborne trade is historically resilient to business cycle disruptions, the current geopolitical climate is “quite different”,\n\nwith dramatic shifts in trade patterns determined by “who does what to whom”. This has fundamentally altered the discourse in shipping forums, where 90% of inquiries now focus on political developments in the Middle East, Russia, Ukraine, and the US rather than traditional commodity drivers.\n\nOne of the themes discussed was the “rise and fall of empires”, a concept Pålsson used to describe the shifting balance of global power. He argued that historically, an empire’s strength was inextricably linked to its control of the seas through shipbuilding capacity. Here he highlighted the US’ total shipbuilding output over the last decade as being roughly equivalent to a single week’s production in China. This imbalance has prompted a renewed focus on domestic shipbuilding in the US, with several initiatives and significant funding now flowing into the sector to restore maritime competitiveness and maintain control over naval interests.\n\nRise of India\n\nBeyond the US and China, India is emerging as a critical player on the new trade map. Although India has struggled for years to establish a dominant shipbuilding presence, Pålsson noted it is now on a “much more positive trajectory” with strong government backing and an influx of contracts. The presence of marine equipment companies in India further suggests a sustainable development cycle. Walenkiewicz added that India’s growth is driven by its status as the world’s most populous country, with immense energy needs that are essential for lifting its population out of poverty.\n\nThis demographic shift is central to the future trade map. With 1.5 billion more people expected on the planet by 2050, the demand for energy, food, and housing will skyrocket, particularly in sub-Saharan Africa and Asia. Walenkiewicz pointed out that even if per-capita energy use remains stagnant, population growth alone will necessitate 15-20% more energy by 2050.\n\nHowever, as these developing regions grow, their energy consumption will likely increase dramatically. Pålsson noted that the average energy consumption in sub-Saharan Africa is currently around 5 gigajoules per capita, compared to 200-400 gigajoules in the Western world.\n\n“1.5 billion more people on this planet in 25 years… requires that we build a new India in 25 years,” Pålsson said\n\nunderscoring the massive implications for the trade of steel, cement, iron ore, and grain.\n\nThis growth is shifting the global economic “centre of gravity” eastward and southward. The traditional trade model—East produces, West consumes—is being challenged as emerging\n\neconomies develop robust domestic demand. Europe must find a new role in this landscape, as it is no longer the primary source of growing demand, Pålsson said. He envisioned a future dominated by intra-Asian trade and increasing South-South trade between Asia, Africa, and Latin America. This shift is not a modern phenomenon but a return to a historical norm; before the Industrial Revolution, global GDP was largely proportional to population size, and the rest of the world is now “catching up quite rapidly”.\n\nEnergy shift\n\nThe energy transition adds another layer of complexity. While the move toward renewable and electro-fuels is underway, Pålsson expressed scepticism about a complete phase-out of fossil fuels in the near term, particularly given the reliance of developing nations on “cheap energy” like steam coal. Currently, fossil energy commodities account for 40% of global shipping. A plateau or decline in oil consumption, driven by electrification in the transportation sector, would significantly impact investment and ship utilisation, particularly for long-haul VLCCs.\n\nIn the immediate future, the shipping industry faces significant logistical hurdles.\n\nThe Red Sea and Suez Canal disruptions remain “the elephant in the room”, with major carriers like Maersk and CMA CGM navigating a precarious environment.\n\nPålsson said that a return to normal Suez traffic would suddenly release 11-15% of existing capacity back into the market, putting downward pressure on freight rates in an already oversupplied environment. While low rates may benefit cargo owners, they present a challenge for ship operators who may resort to “blank sailings” or network changes to manage capacity.\n\nThe aging of the world fleet is another concern. Walenkiewicz noted that disruptions have kept older ships in service longer, resulting in historically low scrapping rates. Replacing these vessels is a monumental task that will likely take a decade rather than a few years. Pålsson highlighted a severe lack of green recycling capacity, with most activities concentrated in India, Pakistan, Bangladesh, and Turkey. Walenkiewicz said that AIS data suggests that many smaller, older vessels may already be mothballed, potentially making the active fleet younger than official registers suggest. However, for the large-vessel segments built during the 2006-2012 boom, the aging problem remains acute and unavoidable.",
    "source_url": "https://www.hellenicshippingnews.com/shippings-constantly-changing-reality/",
    "source": "hellenicshippingnews.com",
    "score": 103
}