{
    "id": 1771743613,
    "date": "2026-02-22",
    "title": "Shipfinex FZCO Secures In-Principle Approval from VARA for Virtual Asset Broker-Dealer License",
    "summary": "Shipfinex's virtual asset license in Dubai aims to tokenize ships, potentially attracting new investors. Fractional ownership won't change the tonnes of HFO burned. We remain skeptical of any scheme that doesn't directly cut ship carbon intensity.",
    "content": "Dubai, UAE, Feb. 21, 2026 (GLOBE NEWSWIRE) -- Shipfinex FZCO, a digital platform dedicated to the democratization of the maritime economy, is pleased to announce it has received In-Principle Approval (IPA) from Dubai’s Virtual Assets Regulatory Authority (VARA) for a Broker-Dealer license.\n\nThis milestone marks a significant step forward in Shipfinex’s mission to enable fractional ownership of ships through compliant, transparent, and regulated pathways. The In-Principle Approval validates that Shipfinex FZCO has met VARA’s rigorous initial requirements regarding compliance, security, and operational capability.\n\nAs the maritime industry seeks new avenues for capital and liquidity, Shipfinex utilizes Distributed Ledger Technology to tokenize maritime assets, converting them into Maritime Asset Tokens (MAT). This process allows investors to hold fractional ownership rights in ships, providing access to an asset class traditionally reserved for institutional funds.\n\n\"Securing this In-Principle Approval from VARA is a testament to our commitment to building a fully regulated, secure, and transparent ecosystem for shipping finance,\" said Capt. Vikas Pandey, Founder & CEO of Shipfinex. \"Dubai is rapidly becoming a global hub for virtual assets, and we are proud to align our operational standards with VARA’s progressive regulatory framework to protect our investors.\"\n\n\"The maritime industry is one of the oldest and most vital pillars of the global economy, yet its financial structures have remained largely unchanged for decades,\" added Mr. Vivek Seth, Chairman of Shipfinex. \"This approval is a validation of our vision to integrate the reliability of traditional shipping with the efficiency of the digital economy.\"\n\nMr. Dipak Karki, CFO of Shipfinex , commented: \"This is an evolutionary step for ship finance, impacting both debt and equity through technology. It allows the exchange to be an efficient, transparent platform for individuals and institutions to share economic ownership of a vessel, a model now validated by a world-class regulator.\"\n\nNext Steps\n\nShipfinex FZCO will now proceed to satisfy the remaining conditions required to secure the full Virtual Asset Service Provider (VASP) license. The platform offers investors a seamless, regulated environment to own fractional ownership in ships, with complete security, transparency, and professional governance.\n\nAbout Shipfinex\n\nShipfinex is a regulated platform building the financial evolution of the maritime industry. By leveraging RWA Tokenization and Distributed Ledger Technology (DLT), Shipfinex enables ship owners to unlock liquidity and allows investors to participate in maritime assets.",
    "source_url": "https://markets.businessinsider.com/news/stocks/shipfinex-fzco-secures-in-principle-approval-from-vara-for-virtual-asset-broker-dealer-license-1035852478",
    "source": "markets.businessinsider.com",
    "score": 57
}