{
    "id": 1771657237,
    "date": "2026-02-21",
    "title": "Sinking trees into the Arctic Ocean could reduce carbon emissions. But is it worth it?",
    "summary": "Scientists propose sinking mature trees in the Arctic Ocean to sequester carbon, but the logistics are daunting. The annual potential of 1 gigatonne CO2 removal is negligible compared to the 37.8 gigatonnes emitted globally in 2024. The energy and emissions costs of harvesting and transporting trees for this scheme would likely negate any climate benefits.",
    "content": "Trees are well known for their ability to store carbon dioxide. They use the gas to fuel their growth, which is why younger, faster-growing trees absorb more carbon than mature trees.\n\nBut this storage solution is not forever. When trees rot or burn in a wildfire, they release that carbon back into the atmosphere.\n\nA group of scientists from the UK, Switzerland, and the Czech Republic p roposed an idea to sink mature trees from the vast boreal forest into the deep Arctic Ocean to lock away their carbon for centuries to come.\n\nIn a study published in the online peer-reviewed journal npj Climate Action, the scientists used computer modelling to explore the effects of removing specific stands of old, fire-prone trees in Canada, Alaska and Russia, floating them down six Arctic rivers including the Yukon and Mackenzie, and sinking them in the Arctic Ocean.\n\nAt the same time, new, fast growing trees would be planted in their place, to accelerate the absorption of carbon from the atmosphere.\n\nLast year, the same scientists discovered 8,000-year-old trees, still intact, in low-oxygen Alpine lakes. So the belief is that the cold, low-oxygen water in the Arctic would also act to reduce decay and keep that carbon in cold storage for thousands of years.\n\nThe study found that if done yearly in t hree areas covering 10,000 square kilometres each, which is just one per cent of the boreal forest, one gigaton of carbon dioxide could be removed from the atmosphere every year.\n\nWhile this idea works as a thought experiment, one gigaton is a drop in the bucket compared to total world carbon emissio ns, which the International Energy Agency says was 37.8 gigatons in 2024 alone, up from previous years.\n\nDespit e the potential gain s of carbon storage, a massive project like this also has to consider the amount of energy and associated carbon emissions needed to carry it out.\n\nIt takes large machinery to go into forests, cut down trees and haul them to rivers. Then, the giant logs need to be either loaded onto barges or floated downstream without jamming up. Once they reach the deep water of the Arctic Ocean, they somehow must be sunk to the bottom and held there.\n\nAs we’ve learned over several centuries of boat building, wood floats really well. The researchers state that it naturally takes around a year for driftwood to sink, but it can take longer if caught in sea ice.\n\nOnce the thousands of logs are permanently sunk, there is also the unknown impact on organisms living on the ocean floor.\n\nThere's also a cost to the forest itself. As ecologist Suzanne Simard pointed out in her book, Finding the Mother Tree, a mature tree supports many other forms of life, from mosses, lichens, insects and birds, to a network of fungus clinging to its widespread roots. Removing the trees is a major disturbance to the forest, which thrives on diversity.\n\nFinally, there is the impact on the traditional lifestyle of the Indigenous populations that live in these forests.\n\nThis is another extreme example of a big geoengineering idea designed to level rising carbon emissions.\n\nConcepts such as spraying sulphur particles into the upper atmosphere to cut down on solar radiation, spraying water onto polar ice to thicken it and prevent loss during the summer, and constructing a huge sunshade in space to cool the Earth would all take considerable efforts over long periods of time.\n\nAnd each comes with the unknown consequences of tampering with the atmosphere, oceans and other natural systems.\n\nThese ideas are all last ditch efforts that are being considered if we do not solve the source of the problem, which is burning fossil fuels.\n\nIt's like being on the Titanic after it hit the iceberg and the captain says, “Don’t worry, we will pump the water out and keep the ship afloat.”\n\nThe Titanic was equipped with pumps, but unfortunately the water was coming into the ship faster than the pumps could remove it, and we all know the result.\n\nOur global carbon emissions are flowing into the atmosphere faster than we can remove them.\n\nThe ultimate solution is to deal with the primary source, which is burning fossil fuels . And the good news is that the technology to produce energy without emissions already exists.\n\nWe know how to capture the energy of the sun, the wind, heat of the Earth and tides. Nuclear power is making a comeback, and waste-free nuclear fusion is on the horizon. Solar power is now cheaper than coal.\n\nThese clean technologies are growing, but not fast enough. There is resistance to change, and a strong e ffort to keep business as usual because a lot of money and jobs are connected to those old technologies.\n\nWe can do more than try to pump water out of a sinking ship. We can plug the hole and stay afloat.",
    "source_url": "https://www.cbc.ca/radio/quirks/sinking-trees-carbon-emissions-9.7099205",
    "source": "cbc.ca",
    "score": 56
}