{
    "id": 1771016365,
    "date": "2026-02-13",
    "title": "Trump Unveils White House Maritime Action Plan to Restore U.S. Seapower",
    "summary": "Trump's Maritime Action Plan aims to revitalize US shipbuilding, which currently produces less than 1% of commercial vessels. The plan proposes vessel fees and zones, but its success hinges on Congressional funding. Without real investment, this \"plan\" will fail to reduce reliance on foreign-flagged ships and their emissions.",
    "content": "America builds under 1% of commercial ships. The White House Maritime Action Plan bets on vessel fees, a trust fund, and zones, but Congress is the clock.\n\nBy Captain John Konrad (gCaptain) The United States builds less than one percent of the world’s commercial ships. Eleven shipyards have active build positions. Eight can build vessels over 400 feet. The supply base has consolidated to the point where many critical components come from a single supplier. And virtually all of America’s oceangoing trade, the goods that stock shelves, fuel refineries, and supply factories from coast to coast, moves on foreign-built, foreign-crewed, foreign-flagged vessels.\n\nTrump’s Maritime Action Plan (MAP), released today, is the most ambitious attempt to reverse that decline since the Merchant Marine Act of 1936. It was supposed to arrive 100 days ago. The maritime executive order President Trump signed on April 9, 2025, gave his team 210 days, a November deadline, to deliver the strategy. It took 310. The delay itself tells you something about the scale of what they’re attempting. The MAP is 35 pages. It is substantive. And it was signed not by the Secretary of Transportation, but by Marco Rubio as National Security Advisor and Russell Vought as OMB Director, which tells you how the administration sees this: not as transportation policy, but as a matter of national survival.\n\n“We will soon revitalize our once-great shipyards with hundreds of billions of dollars in new investments and people coming from all around the world…to build ships in America,” said President Trump in the introduction to the plan. “We want them built in America.”\n\nBut a plan is not a shipyard. And the distance between the two is measured in years, billions of dollars, and the willingness of Congress to actually fund what the White House is proposing.\n\nThis plan is dense, it’s well written, it has real value but agencies like the Maritime Administration are seriously under staffed while others, like the Navy’s NAVSEA are increadibly bloated so the question remains is it too ambitious? And if it all can be accomplish… how long will it take?\n\nWhat the Plan Actually Does\n\nThe MAP is organized around four pillars, but the real story is a handful of policy tools that, if enacted, would fundamentally change the economics of American shipbuilding. The document’s stated objective is worth quoting: not merely to grow the number of vessels built in the United States, but to reconstitute a maritime industrial base capable of self-sustained production. That distinction matters. This is not a subsidy program to build a few more ships. It is an attempt to rebuild an entire industrial ecosystem, shipyards, suppliers, workforce, design capacity, that can sustain itself once the federal scaffolding comes down. As I said, it’s ambitious.\n\nThree things stand out about the MAP’s approach. First, the sheer scale of proposed government investment and intervention… two things Republicans have traditionally avoided. Second, the interagency and allied coordination required to execute it, this plan reaches across OMB, NSC, Maritime Administration (MARAD), the Coast Guard, the Army Corps of Engineers, Commerce, State, Treasury and foreign governments simultaneously. Third, pages of deregulatory actions: a large section of this plan is dedicated to eliminating outdated rules, streamlining compliance, clarifying policies, reducing mandatory able seaman billet requirements, and revising merchant mariner training standards rooted in the IMO’s STCW convention. The MAP wants to cut red tape as aggressively as it spends money, and the deregulatory sections are among the most detailed in the document.\n\nThe industrial strategy is equally specific. The MAP calls for multi-year, multi-vessel procurement to give shipyards predictable order books. It pushes modular production, digital engineering and AI. It demands that performance requirements and ship design packages be fully developed before production begins, and that commercially available designs be used wherever possible. The metric it uses is revealing: reduce time to part and time to hull. That’s not bureaucratic language. That’s manufacturing language. And it signals an administration that understands shipbuilding is an industrial problem, not a policy problem.\n\nThe most consequential is a proposed fee on every foreign-built vessel entering a U.S. port, assessed by the weight of imported tonnage. At one cent per kilogram, the plan estimates this could generates roughly $66 billion over ten years. At 25 cents per kilogram, it approaches $1.5 trillion. That 23x range tells you this is a negotiating position, not a final number, but where the administration lands within it will determine whether the entire plan has a financial engine or just an aspiration. And it’s unclear if they can do it alone or will need cooperation from Congress. The proceeds could fund a new Maritime Security Trust Fund, which was originally proposed in the SHIPs Act. It would provide the dedicated, mandatory funding stream that American shipbuilding has never had. Without that fund, almost everything else in the document is a wish list waiting for annual appropriations that may never come.\n\nThe second major innovation is Maritime Prosperity Zones, 100 designated areas across the coasts, Great Lakes, river systems, Alaska, Hawaii, and U.S. territories where tax-advantaged private investment would flow into shipyards, supply chain companies, workforce training, and advanced manufacturing. The model is the Opportunity Zones from the 2017 tax reform. If well-designed, MPZs could redirect private capital into maritime industrial communities the way OZs reshaped real estate investment. If poorly designed, they become a tax shelter with a maritime label. The difference will be in the eligibility criteria and enforcement, neither of which is specified in the MAP, those details are left to the Secretary of Commerce and forthcoming legislation.\n\nThird, the MAP proposes extending the Capital Construction Fund, a proven tax-deferral tool that has helped vessel owners reinvest in new ships for decades, to shipyard owners. With $2.59 billion currently sitting in vessel-owner CCF accounts, this is a mechanism that works. Extending it to yards would let shipyard owners defer earnings into infrastructure, equipment, and modernization. It’s elegant and overdue.\n\nAnd fourth, there’s what the MAP calls the “Bridge Strategy”, a concept that solves the chicken-and-egg problem of rebuilding from near zero. Allied shipbuilders would build the first hulls of a multi-vessel contract in their home yards while simultaneously investing capital in U.S. shipyards they’ve purchased or partnered with. Later hulls migrate to American production. On the press call, officials pointed to the Finland icebreaker deal, which brings Finnish shipbuilding expertise to the U.S. for Arctic Security Cutters, as the prototype. If it scales to Korean and Japanese yards, this could be the mechanism that actually gets ships in the water while American capacity ramps up.\n\nThese four tools, the vessel fee, the Trust Fund, the MPZs, and the Bridge Strategy, are the plan’s center of gravity. But the supporting architecture matters too and critics we talked to pointed out that not much progress has been made public after Rodolphe Saadé, CEO of CMA CGA, offered to invest $20 Billion in US flagged ships. The MAP proposes a new Strategic Commercial Fleet for international trade routes, expanded cargo preference requirements, Title XI loan guarantee reform, and a land port maintenance tax on merchandise entering the United States through land ports of entry. It calls for recapitalizing the U.S. Coast Guard Yard in Baltimore and much needed refurbishment and modernizing the US Merchant Marine Academy, which it describes as requiring urgent attention. It includes an Arctic maritime strategy and frameworks for autonomous vessels, noting, with unusual candor, that no established procedures or protocols exist for verifying AI-driven navigational decisions. As I’ve stated twice already, it’s ambitious.\n\nThe Ready Reserve Fleet gets particular attention. The MAP acknowledges what everyone in the industry knows: the fleet’s vessels are aging, spare parts are increasingly difficult to source, maintenance costs are climbing, and recruiting qualified civilian mariners to crew activated vessels is a persistent challenge. Recapitalizing the RRF will require significant investment, and the MAP doesn’t pretend otherwise.\n\nThe document is comprehensive. But its fate rests on whether the Administration can find money in tarrifs and port fees directly or will have to wait for a lumbering and broken Congress the enact the revenue and incentive mechanisms that make the rest viable.\n\nI’n a White House meeting with senior Administration official this morning aI sked the question that I think matters most for execution: MARAD has roughly 200 people working on policy and is decades behind in publishing their annual review of shipyards. NAVSEA has 83,000. How does this plan get implemented? The officials pointed to new institutional architecture, a shipbuilding office at OMB focused on implementation, a shipbuilding directorate at NSC focused on policy, and Steve Carmel leading a Maritime Administration that the plan calls to fully resource. They described a “whole-of-government, whole-of-nation” approach where no single agency owns the mission. That’s the right answer in theory. In practice, interagency coordination is where Washington policies go to die, slowly, through turf battles and budget fights that nobody outside the Beltway ever sees.\n\nThe Hard Questions\n\nThe MAP deserves credit for what it gets right. The diagnosis is accurate. The policy toolkit is creative. The people are qualified. But several questions will determine whether this plan joins the long list of ambitious maritime proposals that went nowhere, or becomes the inflection point its authors intend.\n\nThe China contradiction. The MAP’s entire demand-signal architecture depends on generating revunue and making foreign-built ships more expensive to create market space for American-built ones. Yet the most powerful tool for making Chinese-built ships more expensive, the USTR actions, including service fees on foreign-built vehicle carriers and restrictions on certain maritime transport services, is currently suspended. The U.S. and China reached a deal on October 30, 2025, pausing these actions for one year starting November 10, 2025. The administration is simultaneously telling Congress to pass new fees on foreign vessels while pausing existing enforcement against the single largest source of subsidized foreign competition. Mentions of China in the MAP itself are pointed but sparse.\n\nWill allied shipbuilders actually come? The Bridge Strategy and the $150 billion in allied investment secured through trade negotiations depend on foreign shipbuilders, Korean, Japanese, Finnish, possibly Italian, being willing to build capacity inside a competitor nation. The Finland icebreaker deal is one data point. Scaling it requires allied corporations to see strategic benefit in establishing American production lines. What’s in it for Hyundai or Samsung Heavy Industries to help rebuild the shipbuilding capability they currently dominate? Access to U.S. defense contracts is one answer. Tax incentives through MPZs is another. But the question of whether allied capital follows allied rhetoric is one the MAP cannot answer by itself.\n\nWhere do the workers come from? The MAP’s workforce pillar contains two genuinely useful ideas, expanding the Military-to-Mariner pipeline so veterans can convert military sea service to merchant marine credentials, and allowing U.S. mariners on international routes to exclude foreign earned income the way any American working abroad can. Both are overdue and mariners will likely be most excited about the tax breaks. But the binding constraint isn’t training capacity, it’s labor supply competition. Every welder, pipefitter, and electrician who goes to a shipyard is one who doesn’t go to an LNG facility, a semiconductor fab, or a defense plant. In a labor market where every industrial sector in America is competing for the same tradespeople, the MAP’s training proposals are necessary but not sufficient. The shipyard CEOs reading this will notice that gap.\n\nBottom Line\n\nSea power has long been a cornerstone of America’s global leadership, the MAP’s own conclusion says as much, and it’s right. This is the most comprehensive federal maritime policy document since 1936, produced by people who understand both the problem and the politics. The policy toolkit, vessel fees, a Trust Fund, Prosperity Zones, the Bridge Strategy, a Strategic Commercial Fleet, is more creative and more aggressive than anything Washington has proposed for commercial shipbuilding in living memory.\n\nThe plan’s weakness is the same weakness that has killed every previous attempt: the gap between policy ambition and industrial execution. The MAP diagnoses the disease correctly. It prescribes the right medicine. But it doesn’t fill the prescription, that requires Congress, the FY2027 budget, and private capital willing to bet that the demand signals are real and durable.\n\nWhat to watch: the FY2027 budget details, the legislative package timing, the first Maritime Prosperity Zone designations, whether allied investment deals scale beyond Finland, and November 2026, when the China Section 301 suspension expires.\n\nThe MAP is the foundation. The FY2027 budget is the rebar. The legislative package is the concrete. Until all three are in place, this is the best plan American shipbuilding has had in 90 years, and a plan is all it is.\n\n“Investment in the maritime industrial base by both the U.S. government and the private sector has declined. As a result, American shipbuilding capacity has withered, less than 1% of new commercial ships are built in the United States, and government shipbuilding has suffered,” said Anna Kelly, White House Deputy Press Secretary, in a statement to gCaptain this morning. “President Trump is the first president in decades to recognize the critical importance of American maritime dominance, and he has done more than anyone to revitalize this vital sector for our national security.”\n\nBoth these statements are true and this is the frist Administration in recent memory that’s been willing to tell the full unvarnish truth about the decline of shipbuilding and the US Merchant Marine but have they bitten off more than out nation can chew? I sincerly hope not.",
    "source_url": "https://gcaptain.com/white-house-maritime-action-plan/",
    "source": "gcaptain.com",
    "score": 94
}