{
    "id": 1771657230,
    "date": "2026-02-21",
    "title": "U.S. renews threat to quit the International Energy Agency over net zero agenda",
    "summary": "The U.S. threatens to exit the IEA over its commitment to net-zero emissions targets, potentially weakening global climate efforts. This pressure aims to undermine the IEA's 2050 net-zero agenda, favoring continued fossil fuel reliance. Such actions risk destabilizing international climate agreements and could lead to increased carbon intensity in shipping.",
    "content": "U.S. Energy Secretary Chris Wright said on Thursday that the U.S. would “pressure” the International Energy Agency to move away from net zero — and quit from the global watchdog if it failed to do this.\n\nWright was speaking on the last day of an IEA ministerial meeting in Paris and shortly after he said the agency would need to reform for the U.S. to remain a long-term member.\n\n“There has been such a group mentality, 10 years invested in a destructive illusion of net zero by 2050, that the U.S. will use all the pressure we have to get the IEA to eventually, in the next year or so, move away from this agenda,” Wright said, according to Reuters.\n\nThe 2015 Paris Agreement committed nations to “net zero”, the balancing of carbon emitted into the atmosphere and removed from it. The U.S., India and the European Union were among the polluters that ratified the accord.\n\nWright added that it was not Washington’s intention to leave the IEA, as there’s “always a risk” China could gain dominance in the agency if it did.\n\nCNBC has reached out to the U.S. Department of Energy and the IEA for comment.\n\nA long-running war of words\n\nThe IEA, which was established in 1974 to ensure the security of oil supplies, faced criticism from the Trump administration last year when it projected that “peak oil”, when global crude production will reach its highest point before entering an irreversible decline, will take place around 2030.\n\nOPEC, the influential group of oil-exporting countries, accused the energy agency of fearmongering and risking the destabilization of the global economy. Wright called the IEA’s forecast “nonsensical.”\n\nThe energy watchdog later watered down its forecast, signaling in a major tonal shift that oil demand could keep growing through to the middle of the century.\n\nScientists have warned that global average temperatures must not increase by more than 1.5 degrees Celsius, if the worst of the climate crisis is to be avoided.",
    "source_url": "https://www.hellenicshippingnews.com/u-s-renews-threat-to-quit-the-international-energy-agency-over-net-zero-agenda/",
    "source": "hellenicshippingnews.com",
    "score": 55
}