{
    "id": 1770793222,
    "date": "2026-02-11",
    "title": "UK regulator sets out guidance for providing emissions data to passengers booking flights",
    "summary": "The UK Civil Aviation Authority (CAA) has published updated guidance on the emissions information airlines and other booking organisations should provide passengers when booking their flights. Some bo...",
    "content": "The UK Civil Aviation Authority (CAA) has published updated guidance on the emissions information airlines and other booking organisations should provide passengers when booking their flights. Some booking platforms already provide data on the amount of carbon emitted on individual flights and the CAA is looking to make this available on all flights sold and advertised that depart from or arrive at UK airports. The CAA aims to create a framework for presenting the information in a clear and consistent format at the point of booking, and its guidance provides a set of updated principles following feedback to a 2024 public consultation. Although voluntary initially, the information should be made available during the online flight search and booking process for applicable flights by April 2027, says the regulator.\n\nAccording to the CAA’s ten principles set out in its Implementation Framework document, environmental information provided to consumers should be accessible, transparent, accountable and accurate, specific, timely, consistent, standardised, comprehensive and subject to continuous improvement.\n\nTo ensure comparability and credibility, airlines and other flight booking platforms should, says the CAA, use existing, internationally recognised methodologies for their environmental impact calculations. It names four that it says currently provide a consistent, science-based approach that aligns with international best practice:\n\n• The estimates for UK aviation emissions from the Department for Energy Security and Net Zero (DESNZ);\n\n• The IATA Recommended Practice Per-Passenger CO2 Calculation Methodology;\n\n• The EU’s Flight Emissions Label under development by EASA; and\n\n• The Travel Impact Model (TIM), Google’s implementation of the Travalyst Shared Framework, that is used by a number of flight booking sites.\n\nThe CAA acknowledges the methodologies use different approaches to estimating fuel burn where the actual data is not available, with some using a time-based approach and others based on distance flown. However, it considers they are within an acceptable tolerance for long-haul and medium-haul flights, which create the bulk of aviation’s carbon emissions.\n\n“We therefore do not intend at this stage to recommend one above the other,” says the regulator. “It is clear, however, that using actual data removes this ambiguity and we encourage industry to work with us and methodology owners to further harmonise the different approaches and gain greater accuracy by sharing the relevant data as fully as possible.\n\n“We will continue to engage directly with international organisations including ICAO, the European Commission and EASA, Google and Travalyst on this matter and will continue to monitor and review any changes to relevant methodologies as they develop.”\n\nThe CAA says it will also monitor developments and research on the non-CO2 impacts, particularly from contrails, of flights so that more accurate environmental information can be provided to passengers. Such information should also incorporate data on the use of sustainable aviation fuel.\n\nIt expects airlines and other relevant organisations to take “adequate steps” towards implementing the framework by the end of April 2027.\n\n“We will review a range of websites of airlines operating in the UK and booking platforms, including those of flight comparison sites, during 2027 to monitor uptake of this approach,” adds the regulator. “We will aim to publish initial findings in 2027. Following that review, and considering other developments in this area by other organisations, including internationally, we will assess whether this approach is fit for purpose or whether the CAA should take further steps to ensure consumers receive transparent and accurate environmental data at the point of booking flights.\n\n“If airlines and other organisation that advertise and sell applicable flights in the UK do not take credible steps to work towards the display of environmental information for consumers using one of the listed methodologies, or provide reasons why they have chosen an alternative credible methodology, the CAA will consider additional actions and whether a mandatory approach is necessary.”\n\nCommenting on the release of the document, Tim Johnson, Director at the UK CAA, said: “We encourage all airlines and travel companies that advertise or sell flights in the UK which depart from or arrive at UK airports to follow this guidance.”\n\nImage: Screenshot of Google’s flight booking platform",
    "source_url": "https://www.greenairnews.com/?p=8501",
    "source": "greenairnews.com",
    "score": 85
}