{
    "id": 1771016352,
    "date": "2026-02-13",
    "title": "UK Shipping Industry Urges Course Correction on UK ETS Expansion",
    "summary": "The UK Chamber of Shipping is whining about the UK Emissions Trading Scheme, set to include domestic maritime in 2026. They claim a lack of infrastructure and expensive alternative fuels will hurt competitiveness and island communities, conveniently ignoring the environmental impact of continued HFO use. Without ringfenced ETS revenues for green upgrades, this smacks of industry delaying tactics to avoid paying for their pollution.",
    "content": "The UK shipping industry has raised serious concerns over Government plans to extend the UK Emissions Trading Scheme (UK ETS) to domestic maritime from 1 July 2026, warning that the policy risks harming UK competitiveness, increasing costs for island communities and slowing progress towards net zero.\n\nOn Wednesday 11 February, the Draft Greenhouse Gas Emissions Trading Scheme (Amendment) (Extension to Maritime Activities) Order 2026, to extend the UK ETS to domestic maritime was passed by the Commons, following limited Parliamentary scrutiny and despite broad-reaching concerns.\n\nA spokesperson for the UK Chamber of Shipping said:\n\nThe sector supports the UK’s climate goals, but cannot deliver meaningful emissions reduction without the necessary fuels, infrastructure, and clear guidance in place – and unreasonable timeframes to implement flawed policy.\n\nPremature implementation risks higher costs for passengers and freight, with limited environmental gain. However, Government is pressing ahead, despite concerns from several quarters, leaving industry in an untenable position.\n\nTo ensure the scheme is both workable and fair, the industry has urged further scrutiny of the measures and called for:\n\nRingfencing maritime ETS revenues for shore power, grid upgrades, retrofits and clean fuels.\n\nTargeted protections for ferry‑dependent and island communities.\n\nAlignment with EU ETS rules to avoid double‑charging and carbon leakage.\n\nA phased or “monitor‑only” period until operators and ports have the systems required for compliance.\n\nIndustry representatives warn that the UK does not yet have viable fuel alternatives or the port energy capacity required to support low‑carbon operations. Alternative fuels currently cost four to five times more than conventional options, and most UK ports lack the shoreside electricity needed to power vessels in port.\n\nWithout Government reinvestment of ETS revenues, the scheme risks raising costs rather than driving emissions reduction.\n\nConcerns are particularly acute for island and lifeline ferry routes, where fare increases would disproportionately affect residents who rely on maritime transport for essential services, food supply and economic activity.\n\nDespite clear precedents such as protections for Scottish islands under the EU ETS, equivalent safeguards have not been committed for the UK.\n\nThe sector is also facing a compressed preparation period. The regulations were published on 13 January and come into force just six months later, requiring operators to finalise emissions monitoring plans, hire verifiers, upgrade systems and forecast financial impacts on extremely tight timelines, without full guidance or clarity from Government.\n\nIndustry warns this could divert investment away from decarbonisation projects already underway.\n\nThe Chamber is urging Government to:",
    "source_url": "https://www.hellenicshippingnews.com/uk-shipping-industry-urges-course-correction-on-uk-ets-expansion/",
    "source": "hellenicshippingnews.com",
    "score": 144
}