{
    "id": 1771311621,
    "date": "2026-02-17",
    "title": "ZIM sets out terms of $4.2bn Hapag",
    "summary": "Hapag-Lloyd's acquisition of ZIM, valued at $4.2 billion, raises concerns about the carbon intensity of the combined fleet of over 400 vessels. The deal, expected to close by late 2026, could lead to increased usage of high sulfur fuel oil (HSFO) if unchecked. \"New ZIM\", operating 16 vessels with Hapag-Lloyd's support, must prioritize emissions reduction to avoid future FuelEU Maritime penalties.",
    "content": "New York-listed Israeli carrier ZIM Integrated Shipping Services has laid out the full terms of its agreed sale, confirming shareholders will receive $35 per share in cash under a merger deal that values the company at about $4.2bn.\n\nThe price represents a 58% premium to ZIM’s closing share price on February 13, 2026, a 90% premium to its 90-day VWAP and a 126% premium to its unaffected price of $15.50 in August 2025, before takeover speculation surfaced.\n\nUnder the agreement, Germany’s Hapag-Lloyd will acquire 100% of ZIM’s share capital, with the transaction expected to close by late 2026, subject to shareholder and regulatory approvals.\n\nZIM said the tie-up will expand service offerings across the transpacific, intra-Asia, Atlantic, Latin America and East Mediterranean trades. The combined company will control more than 400 vessels, with capacity exceeding 3m teu and projected annual volumes above 18m teu by 2027.\n\nFor customers, the carriers are pointing to a broader port network and access to the Gemini cooperation platform as key benefits. For Hapag-Lloyd, the acquisition secures its position as the world’s fifth-largest container shipping line.\n\nA central feature of the structure is the creation of a separate Israeli liner, “New ZIM”, to be formed by Tel Aviv-based private equity firm FIMI Opportunity Funds.\n\nThe new company will operate 16 vessels focused on serving Israel’s main trade lanes, linking the country directly with ports in Europe, the US, the Mediterranean and the Black Sea. It will operate under the ZIM brand and receive commercial support from Hapag-Lloyd, including access to the Gemini network.\n\nThe Special State Share held by the State of Israel in ZIM is intended to be transferred to a FIMI subsidiary, subject to government approval. The aim is to ensure continued secure liner services to and from Israel.\n\nHapag-Lloyd has also indicated it plans to maintain a significant business presence in Israel and retain ZIM employees after completion.\n\nZIM chief executive Eli Glickman said the deal follows several years of restructuring and fleet renewal. Since 2017, the carrier has moved from negative equity to sustained profitability, returning $5.7bn in dividends since its 2021 IPO. On completion of the transaction, total capital returned to shareholders is expected to reach about $10bn.\n\nOver the past few years, ZIM has taken delivery of 46 newbuild containerships ranging from 5,300 teu to 15,000 teu, with around 40% of its operated capacity now LNG-fuelled. The company has also invested more than $1bn in container equipment since 2021 and expanded into the car carrier segment, alongside securing LNG supply arrangements.\n\nChairman Yair Seroussi described the agreement as the outcome of a strategic review and a competitive process designed to maximise shareholder value while safeguarding national shipping interests.\n\nUntil the deal closes, ZIM and Hapag-Lloyd will continue to operate independently on a business-as-usual basis. If approved, the transaction will mark one of the largest liner deals in recent years and further consolidate capacity among the top global carriers.",
    "source_url": "https://splash247.com/zim-sets-out-terms-of-4-2bn-hapag-lloyd-deal-outlines-new-zim-carve-out/",
    "source": "splash247.com",
    "score": 80
}