[
  {
    "id": 1771016389,
    "date": "2026-02-13",
    "title": "\"Green\" Vessel Investments Continue Despite Delays",
    "summary": "Shipping lines persist with \"green\" investments despite delays in global carbon pricing, potentially to avoid future FuelEU Maritime penalties. Dual-fuel vessel orders are increasing, but these ships often still burn HFO, impacting their Carbon Intensity Indicator (CII) rating. Wärtsilä profits regardless, selling both scrubbers and dual-fuel engines that may not deliver promised emissions reductions.",
    "content": "The shipping industry's biggest players are shrugging off Trump administration opposition to a global carbon price and are forging ahead with billions of dollars in emissions-reducing investments, according to company officials and a Reuters analysis of data.\n\nEurope, Brazil and a host of other nations are pushing the sector, which is responsible for nearly 3% of the world's greenhouse gas emissions, to go green. But, in October, the U.S. and Saudi Arabia, the world's two largest oil producers, successfully spearheaded efforts to postpone by one year a decision on the International Maritime Organization's proposal of a $380-per-metric-ton levy.\n\nSome analysts and industry observers initially warned that the absence of such a global framework added complexity to companies' planning and could cause some to pause their green investments.\n\nBut in interviews with 15 shipping companies, ports, bunker suppliers and marine technology companies, 10 told Reuters that regional regulations, long investment lead times, and expectations of a continuing trend towards decarbonisation all argued in favour of staying the course.\n\nAnd a Reuters analysis of vessel delivery data through 2028 showed orders of ships capable of running on alternative fuels dominating new shipbuilding.\n\nHakan Agnevall - chief executive of Wartsila WRT1V.HE, a major producer of ship engines and exhaust gas cleaning scrubbers - told Reuters that a one-year carbon price postponement is unlikely to rattle customers, like his, who generally take a 30-year investment perspective.\n\n\"It's not bold to say that regulations will change during those 30 years.\"\n\nNew Ship Orders Dominated by Dual Fuel\n\nMost of the nearly 50,000 commercial ships operating globally today run on fuel oil or gas oil. But in a unanimous decision in 2023, IMO member states set a target of net-zero emissions by or around 2050.\n\nFirms have, in anticipation, begun ordering dual-fuel ships that can use both fuel oil as well as greener alternatives like liquefied natural gas, methanol and ammonia.\n\nWhile Pacific Basin - a large dry bulk ship owner - did opt to buy four newbuild vessels running only on oil-derived fuels, citing the postponement of the IMO's carbon price, the company is an outlier.\n\nUnlike other sectors - from energy to auto manufacturing - that have curbed their green ambitions in a rollback that has only accelerated since Donald Trump's return to the White House, the shipping industry has, so far, declined to pivot.\n\nMajor ship owners have reiterated their commitments to invest in emissions reduction measures, including dual-fuel vessels and onboard energy-saving devices.\n\nBy the end of December, companies had invested over $150 billion in dual-fuel vessels, according to a Reuters analysis of data from the World Shipping Council, an industry group for container shipping and vehicle carriers.\n\nIn total, 1,126 dual-fuel container ships and vehicle carriers have now been either delivered or are on order, the data showed. That marks an increase of 28% compared with the previous year, indicating that newbuilding orders for lower-emission fuel vessels continued even after the IMO delay.\n\nThey also continued to outpace orders for traditional ships, with dual-fuel vessels now accounting for 74% of the overall container ship and vehicle carrier orderbook.\n\nAnd investments in new marine fuels are also moving ahead.\n\nAlexander Saverys, CEO of Belgian ship owner CMB.Tech, told Reuters it will continue investments in both ammonia bunkering and production.\n\nA Mitsui O.S.K. Lines spokesperson told Reuters the IMO postponement just means a longer transition to low and zero-carbon fuels, and the company is still focused on LNG-fuelled vessels and early-stage adoption of ammonia and methanol.\n\nMaersk, among the first to explore emissions-reducing alternative fuels, initially opted for methanol but has since ordered LNG-fuelled ships and has now also started testing ethanol as an alternative.\n\nNYK Group 9101.T, which reaffirmed its emissions reduction strategy after the IMO decision, sees the one-year delay as an opportunity for discussion and refinement of the regulatory framework, a company spokesperson said.\n\n\"While recent regulatory uncertainties might lead some operators to take a more cautious approach, the overall direction of maritime decarbonisation has not changed significantly,\" said Jason Stefanatos, decarbonisation director at maritime consultancy DNV.\n\n\"The commercial drivers still remain.\"\n\nGreen Incentives Continue\n\nMany companies cited regional green fuel regulations among the main reasons for moving ahead with investments.\n\nThe European Union's FuelEU Maritime, which requires vessels to pay penalties for failing to achieve lower emissions, makes a business case for greener fleets, ship owners and fuel suppliers said. And the EU Emissions Trading System and voluntary initiatives provide further incentives.\n\nShip owners with dual-fuel vessels will likely use them on EU voyages to avoid paying FuelEU Maritime penalties, and some should also receive rewards for over-compliance, said Kenneth Tveter, an analyst at shipbroker Clarksons.\n\n\"The case for low-carbon fuels such as ammonia and methanol is still alive if you have a trade concentrated around Europe,\" he said.\n\nMajor Horn of Africa port Djibouti and OPEC member Gabon have also introduced levies on maritime emissions.\n\nAnd current momentum could see punitive regulations and incentive schemes introduced in other important shipping hubs soon.\n\nBritain, notably, has proposed to expand its emissions trading system to international shipping from 2028. And Turkey is considering a scheme similar to the EU's.\n\nSuch factors should drive demand for LNG, bio-LNG and biofuels over the next five years, said Nacho de Miguel, head of alternative fuels at bunker supplier Peninsula.\n\n\"Whilst the IMO's net-zero framework has been postponed, this does not change our strategy,\" he said.",
    "source_url": "https://www.marinelink.com/news/green-vessel-investments-continue-despite-535722",
    "source": "marinelink.com",
    "score": 304
  },
  {
    "id": 1771016346,
    "date": "2026-02-13",
    "title": "Fragmented Carbon Schemes Threaten Maritime Progress, Warns BAR Technologies",
    "summary": "BAR Technologies is urging immediate action toward a unified global carbon framework, warning that the proliferation of regional emissions trading schemes is placing unprecedented compliance pressure ...",
    "content": "BAR Technologies is urging immediate action toward a unified global carbon framework, warning that the proliferation of regional emissions trading schemes is placing unprecedented compliance pressure on the maritime sector and risks delaying progress on decarbonisation.\n\nWith multiple overlapping schemes now in effect or emerging, including the EU ETS, FuelEU Maritime, the IMO’s postponed Net-Zero Framework, and proposed Greenhouse gas Fuel Intensity (GFI) measures, shipowners are increasingly navigating a maze of conflicting obligations. According to the International Carbon Action Partnership (ICAP), over 30 emissions trading systems are now either in force or under development worldwide. This pattern of fragmentation reflects a broader global challenge: recent research from the Grantham Research Institute at the London School of Economics identified over 900 climate adaptation laws and policies adopted across 35 countries since the Paris Agreement. While this surge signals growing ambition, it also highlights the risks of uncoordinated frameworks that lead to implementation gaps, increased costs and regulatory friction across borders.\n\n“Carbon compliance is becoming more fragmented by the month,” said John Cooper, CEO of BAR Technologies. “Instead of building momentum behind a single global framework, we’re creating a patchwork of schemes with different baselines, rules and cost mechanisms. That creates confusion, inflates costs, and weakens the industry’s ability to invest in real, scalable solutions.”\n\nThe situation is further complicated by mechanisms such as the EU’s Carbon Border Adjustment Mechanism (CBAM), which went live on 1 January 2026. While not directly taxing shipping emissions, CBAM introduces indirect carbon costs into the trade system by pricing the embedded emissions of goods such as steel, aluminium, cement, and fertilisers, all of which are major seaborne cargoes.\n\n“CBAM is an example of how carbon pricing is now embedded into trade,” Cooper noted. “But it’s also a reminder that without multilateral alignment, we risk policy friction and commercial uncertainty on a global scale.”\n\nTo avoid paralysis through bureaucracy, BAR Technologies is calling for a single carbon policy, one that is globally agreed, fairly administered and financially transparent. The company continues to advocate for a bunker-level collection mechanism to fund climate-positive reinvestment, while avoiding the duplication and complexity of overlapping schemes.\n\n“While we await consensus on a unified framework, we cannot afford inaction,” Cooper continued. “We need technologies that work today, across regulatory zones and wind propulsion is leading that charge.”\n\nBAR Technologies’ WindWings®, already deployed on multiple vessels, offer immediate fuel savings and emissions reductions. Beyond near-term impact, they enhance the viability of alternative fuels like methanol and ammonia by reducing overall fuel demand.\n\n“Wind doesn’t need permission,” said Lauren Eatwell, Head of WindWings® at BAR Technologies. “It’s scalable, proven, and will be around forever. The industry has an opportunity to act now and lead, not wait to be regulated into action.”",
    "source_url": "https://www.hellenicshippingnews.com/fragmented-carbon-schemes-threaten-maritime-progress-warns-bar-technologies/",
    "source": "hellenicshippingnews.com",
    "score": 153
  },
  {
    "id": 1771016352,
    "date": "2026-02-13",
    "title": "UK Shipping Industry Urges Course Correction on UK ETS Expansion",
    "summary": "The UK Chamber of Shipping is whining about the UK Emissions Trading Scheme, set to include domestic maritime in 2026. They claim a lack of infrastructure and expensive alternative fuels will hurt competitiveness and island communities, conveniently ignoring the environmental impact of continued HFO use. Without ringfenced ETS revenues for green upgrades, this smacks of industry delaying tactics to avoid paying for their pollution.",
    "content": "The UK shipping industry has raised serious concerns over Government plans to extend the UK Emissions Trading Scheme (UK ETS) to domestic maritime from 1 July 2026, warning that the policy risks harming UK competitiveness, increasing costs for island communities and slowing progress towards net zero.\n\nOn Wednesday 11 February, the Draft Greenhouse Gas Emissions Trading Scheme (Amendment) (Extension to Maritime Activities) Order 2026, to extend the UK ETS to domestic maritime was passed by the Commons, following limited Parliamentary scrutiny and despite broad-reaching concerns.\n\nA spokesperson for the UK Chamber of Shipping said:\n\nThe sector supports the UK’s climate goals, but cannot deliver meaningful emissions reduction without the necessary fuels, infrastructure, and clear guidance in place – and unreasonable timeframes to implement flawed policy.\n\nPremature implementation risks higher costs for passengers and freight, with limited environmental gain. However, Government is pressing ahead, despite concerns from several quarters, leaving industry in an untenable position.\n\nTo ensure the scheme is both workable and fair, the industry has urged further scrutiny of the measures and called for:\n\nRingfencing maritime ETS revenues for shore power, grid upgrades, retrofits and clean fuels.\n\nTargeted protections for ferry‑dependent and island communities.\n\nAlignment with EU ETS rules to avoid double‑charging and carbon leakage.\n\nA phased or “monitor‑only” period until operators and ports have the systems required for compliance.\n\nIndustry representatives warn that the UK does not yet have viable fuel alternatives or the port energy capacity required to support low‑carbon operations. Alternative fuels currently cost four to five times more than conventional options, and most UK ports lack the shoreside electricity needed to power vessels in port.\n\nWithout Government reinvestment of ETS revenues, the scheme risks raising costs rather than driving emissions reduction.\n\nConcerns are particularly acute for island and lifeline ferry routes, where fare increases would disproportionately affect residents who rely on maritime transport for essential services, food supply and economic activity.\n\nDespite clear precedents such as protections for Scottish islands under the EU ETS, equivalent safeguards have not been committed for the UK.\n\nThe sector is also facing a compressed preparation period. The regulations were published on 13 January and come into force just six months later, requiring operators to finalise emissions monitoring plans, hire verifiers, upgrade systems and forecast financial impacts on extremely tight timelines, without full guidance or clarity from Government.\n\nIndustry warns this could divert investment away from decarbonisation projects already underway.\n\nThe Chamber is urging Government to:",
    "source_url": "https://www.hellenicshippingnews.com/uk-shipping-industry-urges-course-correction-on-uk-ets-expansion/",
    "source": "hellenicshippingnews.com",
    "score": 144
  },
  {
    "id": 1771016375,
    "date": "2026-02-13",
    "title": "Bad start to the New Year for the container shipping companies",
    "summary": "Container lines are increasing Energy Transition Surcharges to $170 per 40' dry container due to expanding EU ETS obligations. These ETS obligations now include methane and nitrous oxide, alongside CO2 emissions, increasing costs. Surcharges will be adjusted quarterly based on carbon prices, but expect further increases as FuelEU Maritime penalties begin.",
    "content": "BAROMETER. Spot freight rates began falling again in mid-January as pre-Chinese New Year transport capacity finally outstripped demand, despite the latter being sustained. Revenue per container fell for the shipping companies, while operating costs remain on an upward curve.Main developments\n\nIncrease in energy transition surcharges\n\nThe shipping companies have announced big increases in the European Union’s Energy Transition Surcharge (ETS) which is supposed to cover the costs generated by the EU Emissions Trading System (EU ETS) and the FuelEU Maritime regulations. The companies justified the increases by the heavier obligations placed on them by the EU ETS. From 2026 on, they have to include all their emissions in the scheme, compared to 75% in 2025 and 40% in 2024. The field of application of the system has also been widened to include methane and nitrogen protoxide, as well as CO². The companies also point out that they have incurred extra costs in meeting the requirements of the FuelEU regulation because of changing biofuel prices. The result is an average surcharge of USD170 for the transportation of a 40’ dry container from Asia to North Europe during the first quarter and USD250 for a 40’ reefer.\n\nThe surcharges are reviewed by the companies on a quarterly basis in line with changes in the price for a tonne of carbon. It has yet to be decided definitively if they...",
    "source_url": "https://market-insights.upply.com/en/bad-start-to-the-new-year-for-the-container-shipping-companies",
    "source": "market-insights.upply.com",
    "score": 111
  },
  {
    "id": 1771016380,
    "date": "2026-02-13",
    "title": "BAR Technologies Calls for Global Carbon Framework as Compliance Pressures Grow",
    "summary": "BAR Technologies urges a unified global carbon framework, citing the increasing complexity of regional emissions regulations. The EU's Carbon Border Adjustment Mechanism (CBAM) will indirectly impact shipping costs for major commodities. ECSA has requested the EU abandon regional rules upon the IMO's Net-Zero Framework (NZF) adoption, revealing compliance fatigue.",
    "content": "John Cooper is the CEO of BAR Technologies. Image Credit: BAR\n\nWind propulsion firm BAR Technologies is calling for a unified global carbon framework, warning that a growing patchwork of regional rules is increasing compliance pressure on shipowners.\n\nOverlapping measures such as the EU ETS, FuelEU Maritime and emerging IMO proposals are creating a complex regulatory landscape with differing baselines and cost structures, the firm said in an email statement on Thursday.\n\n“Carbon compliance is becoming more fragmented by the month,” John Cooper, CEO of BAR Technologies, said.\n\n“Instead of building momentum behind a single global framework, we’re creating a patchwork of schemes with different baselines, rules and cost mechanisms.”\n\nThe company also pointed to the EU’s Carbon Border Adjustment Mechanism (CBAM), which took effect on January 1, 2026, as an example of carbon pricing becoming embedded in global trade.\n\nWhile CBAM does not directly tax shipping emissions, it introduces indirect costs for major seaborne commodities.\n\nThe firm said it supports a globally agreed carbon policy with a bunker-level collection mechanism to fund climate investment while avoiding duplication across regional schemes.\n\n“While we await consensus on a unified framework, we cannot afford inaction,” Cooper said, adding that wind-assisted propulsion technologies can deliver immediate emissions reductions across regulatory regimes.\n\nThe European Community Shipowners' Associations (ECSA) has also urged the European Commission to withdraw EU shipping regulations once the IMO’s Net-Zero Framework (NZF) is adopted.",
    "source_url": "https://shipandbunker.com/news/world/929566-bar-technologies-calls-for-global-carbon-framework-as-compliance-pressures-grow",
    "source": "shipandbunker.com",
    "score": 105
  },
  {
    "id": 1771016372,
    "date": "2026-02-13",
    "title": "BBC Verify: Verified video shows collision between US Navy ships in Caribbean Sea",
    "summary": "This BBC report lacks crucial details on the US Navy ship collision's impact on marine pollution. Any resulting fuel spills or damage to sensitive marine ecosystems remains unaddressed. We await further investigation into potential violations of MARPOL regulations and associated environmental damage.",
    "content": "Fact-checking Farage and verifying US naval collision\n\nThomas Copeland\n\nBBC Verify Live journalist\n\nIt’s been a busy Friday here at BBC Verify, so here’s a quick recap of what we’ve been covering.\n\nOur fact-check team has been looking into a series of claims made by Reform UK leader Nigel Farage in an X post and during an interview for the BBC’s Political Thinking podcast.\n\nThey looked into how many stations in London run by transport body TfL have signs in foreign languages and dug into the data on the number of people living in the UK who don’t speak English.\n\nAnd after President Donald Trump revoked a landmark Obama-era ruling on greenhouse gases, BBC Verify has been assessing how that move might affect US emissions.\n\nElsewhere, our video verification team worked on the latest footage showing the impact of attacks on Ukraine and two videos showing a collision between US Navy ships in the Caribbean.\n\nThat’s all from the live page for this week. Our verification and eyewitness journalists will be here through the weekend working with teams across BBC News. BBC Verify Live will be back on Monday.\n\nVerifying videos of a fire in Gaza City\n\nKumar Malhotra\n\nBBC Verify senior journalist\n\nI’ve been looking at footage showing a fire blazing at a building in the northern part of the Gaza Strip, with fire crews and emergency workers in attendance.\n\nWe confirmed the location as being in the Rimal area of Gaza City by comparing the building, the neighbouring structures and the street layout to visible features on Google Earth.\n\nWe also matched the footage posted on social media today with images published by news agencies.\n\nIsraeli forces have pulled back from the Rimal area. A spokesman for Gaza’s Hamas-run Civil Defence agency said fire fighters had been battling the blaze for eight hours, and were facing major challenges due to a lack of resources.\n\nIt also said a number of people had to be treated for smoke inhalation.\n\nFootage shows collision between two US Navy ships in Caribbean Sea\n\nThomas Copeland\n\nBBC Verify Live journalist\n\nWe’ve just verified two videos showing a collision between two US Navy ships on Wednesday.\n\nTwo people reported minor injuries after the incident involving the Arleigh Burke-class destroyer USS Truxtun and Supply-class combat support ship USNS Supply.\n\nThe US military's Southern Command confirmed to the BBC the collision took place during an at-sea refuelling operation and both ships were able to continue safely afterwards.\n\nShip-tracking site MarineTraffic shows USNS Supply last broadcast its position on Thursday where it was docked at the port of Ponce in the US territory of Puerto Rico.\n\nSouthern Command said the incident was under investigation.\n\nBoth videos were taken aboard USNS Supply and we’ve been able to match key features on the vessels to publicly available images. These included the forward gun and hull number on USS Truxtun and the cranes, hoses and steps on USNS Supply.\n\nReverse images searches indicate that neither of these videos appeared online before yesterday.\n\nHow might Trump’s climate rollback affect US emissions?\n\nMark Poynting\n\nBBC Verify researcher\n\nThe US is currently the second-biggest emitter of planet-warming greenhouse gases - such as carbon dioxide - but its emissions have generally been falling over the past two decades. Many analysts say this is partly due to the “endangerment finding” made in 2009 when Barack Obama was president.\n\nThis concluded that greenhouse gases were a risk to public health - and was reversed by President Donald Trump yesterday.\n\nThe endangerment finding underpinned US efforts to cut emissions in transport, power stations and industry, according to the Environmental Protection Agency.\n\nThe consequences of Trump’s move for US emissions - and global climate change - are uncertain.\n\nPrevious modelling by independent researchers at Rhodium Group suggested rolling back US climate regulations would slow - but not reverse - emissions cuts.\n\nIt also appears unlikely that US car manufacturers will abandon all carbon-cutting efforts as they sell to other markets like the EU that have their own emissions rules.\n\n“American gas-guzzlers aren't popular abroad, and allowing them to become more polluting will further lessen their appeal,” said Chris Aylett, research fellow at Chatham House’s Environment and Society Centre.\n\nThe US Alliance for Automotive Innovation welcomed yesterday’s announcement but said the industry would stay “on a long-term path of emissions reductions and cleaner vehicles”.\n\nAccusations of Bangladesh election rigging circulate online without evidence\n\nShruti Menon and Shyadul Islam\n\nBBC Verify and BBC Bangla\n\nWe’ve been monitoring Bangladesh’s landmark elections for evidence of misinformation and false posts online.\n\nNow the outcome is clear - a landslide victory for the Bangladesh Nationalist Party - we’ve continued to look online for social posts challenging the validity of the results and scrutinising the evidence presented.\n\nOne in particular has caught our eye - which is being widely shared on Facebook and X - that claims to show evidence of vote rigging.\n\nIt shows a voter tally sheet at one counting station with crossed-out figures suggesting the results were changed after first being recorded.\n\nWe contacted the election duty officer whose signature appears on the sheet. He confirmed this was a genuine voter tally sheet and the corrections were a result of a clerical error while recording the vote.\n\nA later version of the sheet was submitted without the strikethroughs, he said.\n\nWe can’t say whether the alterations on this occasion were made as a result of manipulation or clerical error, but this post has clearly led to speculation about the conduct of the election on Bengali-language social media.\n\nHow much do Nato members spend on defence?\n\nAnthony Reuben\n\nBBC Verify senior journalist\n\nThe annual Munich Security Conference gets under way in Germany today - and is due to hear from US Secretary of State Marco Rubio tomorrow.\n\nRubio’s appearance follows recent tensions between the US and its Nato allies after President Donald Trump threatened Danish sovereignty with a pledge to annex Greenland.\n\nSpeaking to reporters as he left, Rubio insisted the US wasn't abandoning Europe, but said it should learn to defend itself.\n\nWhile the US defence budget has come down from 3.6% of its GDP in 2020 to an estimated 3.2% in 2025, spending by the rest of Nato, external - Canada and the European members - has gone up from 1.7% of their combined GDP in 2020 to an estimated 2.3% in 2025.\n\nHowever in cash terms, the US is still by far the biggest spender on defence, spending about $980bn (£720bn) last year, which was 62% of the Nato total.\n\nMembers are now committed to spending, external 3.5% of GDP on defence by 2035, with another 1.5% going on things like protecting critical infrastructure and ensuring civil preparedness.\n\nTrump’s climate comments at odds with overwhelming scientific consensus\n\nMark Poynting\n\nBBC Verify researcher\n\nOn Thursday US President Donald Trump revoked a landmark Obama-era ruling that greenhouse gases – such as carbon dioxide and methane – endanger public health.\n\n“This determination had no basis, in fact, had none whatsoever,” he said, later adding that the ruling had “nothing to do with public health”.\n\nDiana Furchtgott-Roth – who served in the first Trump administration – defended the move, telling BBC Radio 4’s Today programme “harms from climate change are risks for the future”.\n\nBoth claims run contrary to the overwhelming scientific consensus on the causes and impacts of climate change.\n\n“Human activities, principally through emissions of greenhouse gases, have unequivocally caused global warming,” states the UN’s Intergovernmental Panel on Climate Change (IPCC), external.\n\nIts reports are signed off by governments around the world as an accurate reflection of the science.\n\nRather than being risks for the future, the IPCC says, external human-caused climate change “is already affecting many weather and climate extremes in every region across the globe”, such as heatwaves or heavy rainfall events.\n\nThe IPCC adds, external that human-caused climate change – driven by greenhouse gas emissions - has “adversely affected the physical health of people globally” through extreme heat and climate-related diseases.\n\nHow many TfL stations in London have signs in foreign languages?\n\nLucy Gilder\n\nBBC Verify journalist\n\nDuring his interview on the BBC’s Political Thinking podcast, Reform UK’s Nigel Farage said: “If you go to parts of east London… you see London Underground stations with foreign languages next to them.”\n\nIn response to a 2025 Freedom of Information (FOI) request Transport for London (TfL) referenced two stations in the capital with dual-language signs, external.\n\nOne is Southall in west London which has Punjabi signage and the other is Whitechapel, east London, which has signs in Bengali.\n\nTfL said the Bengali sign was added to Whitechapel station following a request from the mayor of Tower Hamlets borough.\n\nMayor of London Sadiq Khan said on X at the time, external that the signage was about “recognising and celebrating the vital contribution Bangladeshi Londoners have made shaping the Tower Hamlets community”.\n\nTfl says the Southall Punjabi signs were there before it took over the station which is now part of the Elizabeth Line.\n\nIn the same FOI answer, TfL responded “no” when asked if it had plans for more stations to be bilingual.\n\nBBC Verify has asked TfL whether any more dual-language signs have been added to its stations since it provided that FOI response last year.\n\nSudanese army destroys paramilitary air defence system\n\nPeter Mwai and Richard Irvine-Brown\n\nBBC Verify\n\nVideo has emerged showing the moment a Sudanese army drone struck an air defence system used by the paramilitary Rapid Support Forces (RSF) in the Kordofan region of southern Sudan earlier this week.\n\nAlthough images claiming to show the destroyed Chinese-made FK-2000 system first appeared on social media on 10 February, the video published yesterday by the state news agency, tells us more about the attack.\n\nIn the last frames of the video we can make out the FK-2000 - its launching and transport platforms, plus its radars - before the camera cuts out.\n\nWe were able to match the long straight dirt track near a river bed, a small group of houses and what looks like a reservoir so we could confirm the strike was 3 miles (5km) west of al-Debeibat - a town people have mentioned on Sudanese social media as being close to the attack.\n\nThis puts it in the heart of the fighting between the government’s forces and RSF in the region. Both sides have been fighting a civil war across Sudan for almost three years.\n\nAnd we can be confident the attack was on 10 February because satellite images from that day show scrub burning at the same place.\n\nAnalysing footage of Russian strikes on Ukraine\n\nPaul Brown\n\nBBC Verify senior journalist\n\nWe've been reviewing footage following overnight attacks on Ukraine which local officials say have killed at least six people across the country.\n\nThe strikes reportedly targeted Odesa, Kramatorsk and Zaporizhzhia, and involved one missile and 154 drones, according to the Ukrainian Air Force.\n\nFootage filmed this morning in the city of Odesa shows widespread damage to a car dealership, where one building has been almost completely blown out, and a number of vehicles destroyed.\n\nAmong the vehicles seen in the video were Mitsubishis and Peugeots which meant we could narrow down our search for where the attack happened to the location of these dealerships.\n\nAt one point the video offers a very similar angle on the Peugeot showroom to one seen in a photograph on the outlet's official website.\n\nWelcome to BBC Verify\n\nRob Corp\n\nBBC Verify Live editor\n\nGood morning.\n\nWe start today by fact-checking claims made by Reform UK leader Nigel Farage about immigration.\n\nFarage posted a video on X yesterday, following comments made by billionaire Manchester United co-owner Sir Jim Ratcliffe, where the Reform UK leader wrote: “Jim Ratcliffe is right”.\n\nIn the video he claims that “one million people living in this country don’t speak any English at all”. He’s wrong, and we’ll bring you more shortly on what we know.\n\nElsewhere, there’s been another night of drone and missile attacks across Ukraine. At least six people were killed across the country, according to officials. We’re verifying footage showing the aftermath of one attack on the southern Ukrainian city of Odesa.\n\nUS Secretary of State Marco Rubio is expected to tell European leaders the continent must learn to defend itself when he visits the Munich Security Conference which gets under way today. We’re looking at what Europe’s Nato members spend on defence.",
    "source_url": "https://www.bbc.com/news/live/c1kgn2pjpyxt",
    "source": "bbc.com",
    "score": 96
  },
  {
    "id": 1771016391,
    "date": "2026-02-13",
    "title": "World largest battery electric ship begins harbour trials in Tasmania",
    "summary": "Incat's 130-metre battery-electric ferry, \"Hull 096,\" began harbour trials, a first for a vessel of this size. The trials will assess the viability of large-scale electric propulsion under real-world commercial conditions. Despite the hype, dirtiestships.com awaits data on the vessel's lifecycle carbon intensity versus conventional ferries.",
    "content": "Subscribe to our free newsletter today to keep up to date with the latest transportation and logistics news.\n\nA 130 metre vessel has quietly shifted the trajectory of commercial maritime transport. Hull 096, built by Incat Tasmania, began harbour trials on the River Derwent, becoming the largest battery electric ship ever to move under its own propulsion.\n\nThe milestone marks the first time a vessel of this scale and passenger vehicle capacity has operated solely on battery power. For an industry under mounting pressure to decarbonise, the significance extends far beyond southern Australia.\n\n“This is the moment where the ship truly comes alive,” Incat Chairman Robert Clifford said as the vessel undertook its first controlled movements. “Moving Hull 096 under its own battery electric power is a world first at this scale and confirms that electric propulsion is viable for large commercial vessels.”\n\nThe harbour trials signal the transition from construction to operational testing, a phase that will determine how convincingly electric propulsion can perform in real world commercial conditions.\n\nTesting the limits of large scale electric propulsion\n\nHarbour trials are a structured process. Crews test propulsion systems, manoeuvrability, control integration and onboard operational performance. For Hull 096, those tests carry added scrutiny. Scaling battery systems to power a vessel of 130 metres represents a technical leap for shipbuilders accustomed to diesel driven ferries and hybrid systems.\n\nUnlike smaller electric craft that operate on short commuter routes, Hull 096 is designed for significant passenger and vehicle throughput. Its propulsion system must deliver not only emissions free movement but also reliability, redundancy and performance consistent with commercial ferry operations.\n\nEngineers will evaluate how propulsion and steering respond under varying loads, how energy management systems balance power demand, and how onboard systems interact when running entirely on battery supply. The objective is not symbolic success but operational proof.\n\nElectric propulsion at this size requires extensive battery capacity, advanced power management and thermal control systems capable of sustaining high output without compromising safety. The trials will test those systems in dynamic harbour conditions where wind, current and vessel traffic introduce variables that static dockside testing cannot replicate.\n\nThe fact that the vessel has now moved under its own stored energy demonstrates that large scale electrification is no longer theoretical. It is operational.\n\nA signal to a decarbonising maritime industry\n\nShipping accounts for a significant share of global greenhouse gas emissions, and regulators and cargo owners alike are pressing operators to accelerate decarbonisation. While alternative fuels such as methanol and ammonia remain under development, battery electric propulsion offers a commercially available pathway for specific routes, particularly high frequency ferry services.\n\nHull 096 represents a case study in how established shipbuilders are adapting to that shift. Incat Tasmania has long specialised in fast ferries. The move toward full electrification reflects both technological maturity and market demand.\n\nThe vessel is scheduled for delivery to South America following completion of its testing and commissioning program. That deployment will place one of the most advanced electric ships into an operational environment where passenger transport volumes and environmental expectations continue to rise.\n\nFor operators, the economic equation is central. Electric vessels promise lower fuel costs over time, reduced maintenance complexity compared with internal combustion engines and insulation from fossil fuel price volatility. However, those advantages must offset the upfront capital required for battery systems and charging infrastructure.\n\nThe harbour trials therefore serve not only as a technical milestone but also as a commercial signal. If Hull 096 performs as expected, it strengthens the case for electric propulsion in larger classes of vessels.\n\nThe broader implication is competitive. Shipyards that demonstrate competence in battery integration and electric system management will be positioned to capture a growing share of new build contracts as environmental regulation tightens.\n\nFor now, the River Derwent has become a proving ground. The sight of a 130 metre vessel moving silently under battery power may appear incremental to casual observers. Within boardrooms and design offices across the maritime sector, it will be read as evidence that the electrification of large commercial vessels has moved from ambition to application.\n\nSources",
    "source_url": "https://tlimagazine.com/news/world-largest-battery-electric-ship-begins-harbour-trials-in-tasmania/",
    "source": "tlimagazine.com",
    "score": 95
  },
  {
    "id": 1771016365,
    "date": "2026-02-13",
    "title": "Trump Unveils White House Maritime Action Plan to Restore U.S. Seapower",
    "summary": "Trump's Maritime Action Plan aims to revitalize US shipbuilding, which currently produces less than 1% of commercial vessels. The plan proposes vessel fees and zones, but its success hinges on Congressional funding. Without real investment, this \"plan\" will fail to reduce reliance on foreign-flagged ships and their emissions.",
    "content": "America builds under 1% of commercial ships. The White House Maritime Action Plan bets on vessel fees, a trust fund, and zones, but Congress is the clock.\n\nBy Captain John Konrad (gCaptain) The United States builds less than one percent of the world’s commercial ships. Eleven shipyards have active build positions. Eight can build vessels over 400 feet. The supply base has consolidated to the point where many critical components come from a single supplier. And virtually all of America’s oceangoing trade, the goods that stock shelves, fuel refineries, and supply factories from coast to coast, moves on foreign-built, foreign-crewed, foreign-flagged vessels.\n\nTrump’s Maritime Action Plan (MAP), released today, is the most ambitious attempt to reverse that decline since the Merchant Marine Act of 1936. It was supposed to arrive 100 days ago. The maritime executive order President Trump signed on April 9, 2025, gave his team 210 days, a November deadline, to deliver the strategy. It took 310. The delay itself tells you something about the scale of what they’re attempting. The MAP is 35 pages. It is substantive. And it was signed not by the Secretary of Transportation, but by Marco Rubio as National Security Advisor and Russell Vought as OMB Director, which tells you how the administration sees this: not as transportation policy, but as a matter of national survival.\n\n“We will soon revitalize our once-great shipyards with hundreds of billions of dollars in new investments and people coming from all around the world…to build ships in America,” said President Trump in the introduction to the plan. “We want them built in America.”\n\nBut a plan is not a shipyard. And the distance between the two is measured in years, billions of dollars, and the willingness of Congress to actually fund what the White House is proposing.\n\nThis plan is dense, it’s well written, it has real value but agencies like the Maritime Administration are seriously under staffed while others, like the Navy’s NAVSEA are increadibly bloated so the question remains is it too ambitious? And if it all can be accomplish… how long will it take?\n\nWhat the Plan Actually Does\n\nThe MAP is organized around four pillars, but the real story is a handful of policy tools that, if enacted, would fundamentally change the economics of American shipbuilding. The document’s stated objective is worth quoting: not merely to grow the number of vessels built in the United States, but to reconstitute a maritime industrial base capable of self-sustained production. That distinction matters. This is not a subsidy program to build a few more ships. It is an attempt to rebuild an entire industrial ecosystem, shipyards, suppliers, workforce, design capacity, that can sustain itself once the federal scaffolding comes down. As I said, it’s ambitious.\n\nThree things stand out about the MAP’s approach. First, the sheer scale of proposed government investment and intervention… two things Republicans have traditionally avoided. Second, the interagency and allied coordination required to execute it, this plan reaches across OMB, NSC, Maritime Administration (MARAD), the Coast Guard, the Army Corps of Engineers, Commerce, State, Treasury and foreign governments simultaneously. Third, pages of deregulatory actions: a large section of this plan is dedicated to eliminating outdated rules, streamlining compliance, clarifying policies, reducing mandatory able seaman billet requirements, and revising merchant mariner training standards rooted in the IMO’s STCW convention. The MAP wants to cut red tape as aggressively as it spends money, and the deregulatory sections are among the most detailed in the document.\n\nThe industrial strategy is equally specific. The MAP calls for multi-year, multi-vessel procurement to give shipyards predictable order books. It pushes modular production, digital engineering and AI. It demands that performance requirements and ship design packages be fully developed before production begins, and that commercially available designs be used wherever possible. The metric it uses is revealing: reduce time to part and time to hull. That’s not bureaucratic language. That’s manufacturing language. And it signals an administration that understands shipbuilding is an industrial problem, not a policy problem.\n\nThe most consequential is a proposed fee on every foreign-built vessel entering a U.S. port, assessed by the weight of imported tonnage. At one cent per kilogram, the plan estimates this could generates roughly $66 billion over ten years. At 25 cents per kilogram, it approaches $1.5 trillion. That 23x range tells you this is a negotiating position, not a final number, but where the administration lands within it will determine whether the entire plan has a financial engine or just an aspiration. And it’s unclear if they can do it alone or will need cooperation from Congress. The proceeds could fund a new Maritime Security Trust Fund, which was originally proposed in the SHIPs Act. It would provide the dedicated, mandatory funding stream that American shipbuilding has never had. Without that fund, almost everything else in the document is a wish list waiting for annual appropriations that may never come.\n\nThe second major innovation is Maritime Prosperity Zones, 100 designated areas across the coasts, Great Lakes, river systems, Alaska, Hawaii, and U.S. territories where tax-advantaged private investment would flow into shipyards, supply chain companies, workforce training, and advanced manufacturing. The model is the Opportunity Zones from the 2017 tax reform. If well-designed, MPZs could redirect private capital into maritime industrial communities the way OZs reshaped real estate investment. If poorly designed, they become a tax shelter with a maritime label. The difference will be in the eligibility criteria and enforcement, neither of which is specified in the MAP, those details are left to the Secretary of Commerce and forthcoming legislation.\n\nThird, the MAP proposes extending the Capital Construction Fund, a proven tax-deferral tool that has helped vessel owners reinvest in new ships for decades, to shipyard owners. With $2.59 billion currently sitting in vessel-owner CCF accounts, this is a mechanism that works. Extending it to yards would let shipyard owners defer earnings into infrastructure, equipment, and modernization. It’s elegant and overdue.\n\nAnd fourth, there’s what the MAP calls the “Bridge Strategy”, a concept that solves the chicken-and-egg problem of rebuilding from near zero. Allied shipbuilders would build the first hulls of a multi-vessel contract in their home yards while simultaneously investing capital in U.S. shipyards they’ve purchased or partnered with. Later hulls migrate to American production. On the press call, officials pointed to the Finland icebreaker deal, which brings Finnish shipbuilding expertise to the U.S. for Arctic Security Cutters, as the prototype. If it scales to Korean and Japanese yards, this could be the mechanism that actually gets ships in the water while American capacity ramps up.\n\nThese four tools, the vessel fee, the Trust Fund, the MPZs, and the Bridge Strategy, are the plan’s center of gravity. But the supporting architecture matters too and critics we talked to pointed out that not much progress has been made public after Rodolphe Saadé, CEO of CMA CGA, offered to invest $20 Billion in US flagged ships. The MAP proposes a new Strategic Commercial Fleet for international trade routes, expanded cargo preference requirements, Title XI loan guarantee reform, and a land port maintenance tax on merchandise entering the United States through land ports of entry. It calls for recapitalizing the U.S. Coast Guard Yard in Baltimore and much needed refurbishment and modernizing the US Merchant Marine Academy, which it describes as requiring urgent attention. It includes an Arctic maritime strategy and frameworks for autonomous vessels, noting, with unusual candor, that no established procedures or protocols exist for verifying AI-driven navigational decisions. As I’ve stated twice already, it’s ambitious.\n\nThe Ready Reserve Fleet gets particular attention. The MAP acknowledges what everyone in the industry knows: the fleet’s vessels are aging, spare parts are increasingly difficult to source, maintenance costs are climbing, and recruiting qualified civilian mariners to crew activated vessels is a persistent challenge. Recapitalizing the RRF will require significant investment, and the MAP doesn’t pretend otherwise.\n\nThe document is comprehensive. But its fate rests on whether the Administration can find money in tarrifs and port fees directly or will have to wait for a lumbering and broken Congress the enact the revenue and incentive mechanisms that make the rest viable.\n\nI’n a White House meeting with senior Administration official this morning aI sked the question that I think matters most for execution: MARAD has roughly 200 people working on policy and is decades behind in publishing their annual review of shipyards. NAVSEA has 83,000. How does this plan get implemented? The officials pointed to new institutional architecture, a shipbuilding office at OMB focused on implementation, a shipbuilding directorate at NSC focused on policy, and Steve Carmel leading a Maritime Administration that the plan calls to fully resource. They described a “whole-of-government, whole-of-nation” approach where no single agency owns the mission. That’s the right answer in theory. In practice, interagency coordination is where Washington policies go to die, slowly, through turf battles and budget fights that nobody outside the Beltway ever sees.\n\nThe Hard Questions\n\nThe MAP deserves credit for what it gets right. The diagnosis is accurate. The policy toolkit is creative. The people are qualified. But several questions will determine whether this plan joins the long list of ambitious maritime proposals that went nowhere, or becomes the inflection point its authors intend.\n\nThe China contradiction. The MAP’s entire demand-signal architecture depends on generating revunue and making foreign-built ships more expensive to create market space for American-built ones. Yet the most powerful tool for making Chinese-built ships more expensive, the USTR actions, including service fees on foreign-built vehicle carriers and restrictions on certain maritime transport services, is currently suspended. The U.S. and China reached a deal on October 30, 2025, pausing these actions for one year starting November 10, 2025. The administration is simultaneously telling Congress to pass new fees on foreign vessels while pausing existing enforcement against the single largest source of subsidized foreign competition. Mentions of China in the MAP itself are pointed but sparse.\n\nWill allied shipbuilders actually come? The Bridge Strategy and the $150 billion in allied investment secured through trade negotiations depend on foreign shipbuilders, Korean, Japanese, Finnish, possibly Italian, being willing to build capacity inside a competitor nation. The Finland icebreaker deal is one data point. Scaling it requires allied corporations to see strategic benefit in establishing American production lines. What’s in it for Hyundai or Samsung Heavy Industries to help rebuild the shipbuilding capability they currently dominate? Access to U.S. defense contracts is one answer. Tax incentives through MPZs is another. But the question of whether allied capital follows allied rhetoric is one the MAP cannot answer by itself.\n\nWhere do the workers come from? The MAP’s workforce pillar contains two genuinely useful ideas, expanding the Military-to-Mariner pipeline so veterans can convert military sea service to merchant marine credentials, and allowing U.S. mariners on international routes to exclude foreign earned income the way any American working abroad can. Both are overdue and mariners will likely be most excited about the tax breaks. But the binding constraint isn’t training capacity, it’s labor supply competition. Every welder, pipefitter, and electrician who goes to a shipyard is one who doesn’t go to an LNG facility, a semiconductor fab, or a defense plant. In a labor market where every industrial sector in America is competing for the same tradespeople, the MAP’s training proposals are necessary but not sufficient. The shipyard CEOs reading this will notice that gap.\n\nBottom Line\n\nSea power has long been a cornerstone of America’s global leadership, the MAP’s own conclusion says as much, and it’s right. This is the most comprehensive federal maritime policy document since 1936, produced by people who understand both the problem and the politics. The policy toolkit, vessel fees, a Trust Fund, Prosperity Zones, the Bridge Strategy, a Strategic Commercial Fleet, is more creative and more aggressive than anything Washington has proposed for commercial shipbuilding in living memory.\n\nThe plan’s weakness is the same weakness that has killed every previous attempt: the gap between policy ambition and industrial execution. The MAP diagnoses the disease correctly. It prescribes the right medicine. But it doesn’t fill the prescription, that requires Congress, the FY2027 budget, and private capital willing to bet that the demand signals are real and durable.\n\nWhat to watch: the FY2027 budget details, the legislative package timing, the first Maritime Prosperity Zone designations, whether allied investment deals scale beyond Finland, and November 2026, when the China Section 301 suspension expires.\n\nThe MAP is the foundation. The FY2027 budget is the rebar. The legislative package is the concrete. Until all three are in place, this is the best plan American shipbuilding has had in 90 years, and a plan is all it is.\n\n“Investment in the maritime industrial base by both the U.S. government and the private sector has declined. As a result, American shipbuilding capacity has withered, less than 1% of new commercial ships are built in the United States, and government shipbuilding has suffered,” said Anna Kelly, White House Deputy Press Secretary, in a statement to gCaptain this morning. “President Trump is the first president in decades to recognize the critical importance of American maritime dominance, and he has done more than anyone to revitalize this vital sector for our national security.”\n\nBoth these statements are true and this is the frist Administration in recent memory that’s been willing to tell the full unvarnish truth about the decline of shipbuilding and the US Merchant Marine but have they bitten off more than out nation can chew? I sincerly hope not.",
    "source_url": "https://gcaptain.com/white-house-maritime-action-plan/",
    "source": "gcaptain.com",
    "score": 94
  },
  {
    "id": 1771016360,
    "date": "2026-02-13",
    "title": "Halten Bulk doubles down on low",
    "summary": "Halten Bulk's order for up to four 7,100 dwt bulk carriers masks the emissions from their existing fleet. Despite rotor sails and hybrid-electric systems, the actual carbon intensity reduction remains to be seen. The promise of hydrogen-fueled ships is undermined by continued investment in conventional vessels.",
    "content": "Norwegian shortsea specialist Halten Bulk has signed contracts for up to four 7,100 dwt self-discharging bulk carriers at Jiangsu Soho Marine Heavy Industry.\n\nThe vessels will be built to the Norwegian Ship Design Company’s NSD 105CC design and fitted with rotor sails as part of a package aimed at cutting fuel use and emissions in coastal trades.\n\nThe ships are tailored for wind-assisted propulsion and will also feature hybrid-electric systems, including a shaft generator and battery pack. Cargo handling will be fully electric, alongside additional energy-efficiency measures, the ship designer said.\n\nThe newbuilds will trade in the spot market along the Norwegian coast, in the North Sea, the wider Nordic region and the Baltic — areas where wind conditions and shortsea distances make wind assistance and hybrid solutions commercially viable.\n\n“This is a major day for us as we replace older tonnage with new low-emission vessels,” said Halten Bulk chief executive Ivar Ulvan. He added that the project builds on the “Powered by Nature” concept developed together with Egil Ulvan Rederi.\n\nHalten Bulk was founded in 2014 in Trondheim and operates a fleet of self-discharging bulkers focused on North Sea and Baltic trades. The company is a partnership between Brødrene Nordbø, Egil Ulvan and Strand Shipping.\n\nAlongside the new order order, Halten Bulk has also been developing two hydrogen-fuelled bulkers in Norway, backed by funding from Enova. The 88-m ships are designed to run on hydrogen combustion engines combined with battery power and wind-assisted propulsion using two rotor sails.\n\nThe contracts are effective for the first two vessels, with options secured for two additional units, giving the owner flexibility as it renews its fleet and tests new propulsion concepts in the shortsea bulk segment.",
    "source_url": "https://splash247.com/halten-bulk-doubles-down-on-low-emission-shortsea-shipping/",
    "source": "splash247.com",
    "score": 46
  },
  {
    "id": 1770793212,
    "date": "2026-02-11",
    "title": "LR Advisory partners with Geogas Trading to strengthen operational readiness for FuelEU pooling",
    "summary": "Geogas Trading hires LR Advisory to prepare for FuelEU Maritime compliance and emissions pooling. This partnership aims to mitigate commercial risks associated with the impending FuelEU regulations and associated penalties. Will Geogas reduce its carbon intensity, or simply shuffle credits to appear compliant?",
    "content": "The project will draw on LR Advisory’s regulatory, technical and commercial expertise to ensure Geogas Trading is well positioned with the first FuelEU Maritime compliance cycle and pooling opportunity approaching.\n\nLloyd’s Register (LR) Advisory has been appointed by Geneva-based LPG trader and shipowner Geogas to support the development of a multi-year emissions compliance plan and operationalisation of FuelEU pooling, as it prepares for the first compliance cycle of FuelEU Maritime.\n\nUnder the agreement, LR Advisory will provide expert insight into the commercial implications of current and forthcoming emissions regulations, alongside targeted knowledge transfer to build internal capability. The project will support Geogas Trading to design and implement its own FuelEU Maritime pooling structure and develop the operational frameworks and steps needed to execute pooling.\n\nLR Advisory will also work with the company to map and mitigate commercial risk of FuelEU , helping to shape a forward-looking compliance strategy that extends beyond the initial FuelEU cycle.\n\nLuke Shu, Technical Advisory Manager – Maritime Commercial Markets, LR Advisory, said: “FuelEU Maritime represents a fundamental shift in how emissions regulation affects commercial outcomes.\n\n“Charterers and shipowners are now directly exposed to incentives and penalties that influence day-to-day operational, chartering decisions and P&L. Our role is to support organisations like Geogas understand those impacts in detail and put practical structures in place that allow them to operate confidently and competitively as the regulatory landscape tightens.”",
    "source_url": "https://www.hellenicshippingnews.com/lr-advisory-partners-with-geogas-trading-to-strengthen-operational-readiness-for-fueleu-pooling/",
    "source": "hellenicshippingnews.com",
    "score": 113
  },
  {
    "id": 1770755293,
    "date": "2026-02-10",
    "title": "Caribbean Pushes for Coordinated Maritime Decarbonisation Strategy",
    "summary": "Caribbean nations are coordinating maritime decarbonisation efforts, but dirtiestships.com questions if this will truly reduce carbon intensity or just create bureaucracy. Calls for investment in alternative fuels and infrastructure must prioritize lifecycle emissions, not just \"greenwashing\" projects. We will monitor if these policies lead to a demonstrable reduction in heavy fuel oil (HFO) consumption and compliance with FuelEU Maritime regulations.",
    "content": "Caribbean policymakers and financiers have called for stronger regional coordination to advance maritime decarbonisation following an IMO roundtable in Port of Spain, Trinidad and Tobago.\n\nThe meeting, held on January 29-30 under the IMO's GreenVoyage2050 programme with the Global MTCC Network, brought together representatives from governments and maritime administrations, the IMO said in a press release last week.\n\nParticipants said shipping decarbonisation in the region will depend on coordinated policies, shared knowledge and investment-ready projects rather than isolated initiatives.\n\nDraft recommendations included harmonising national policies, strengthening capacity building and improving access to finance for clean fuels and port infrastructure.\n\n\"The IMO GHG Strategy sets a clear global direction, but implementation happens at country and regional level, Dr Jose Matheickal, Director of the IMO's Technical Cooperation and Implementation Division, said.\n\nHe said credible project pipelines are needed to allow finance to flow.\n\nDiscussions also covered fuel pathways, infrastructure needs and barriers to adoption, with findings from a Jamaica alternative fuels study presented as a regional example.\n\nThe second day focused on improving project bankability and mobilising finance for green maritime projects, with development banks outlining financing tools and risk-sharing approaches.\n\nDelegates also visited the ammonia-fuelled vessel Fortescue Green Pioneer during the event.",
    "source_url": "https://shipandbunker.com/news/am/821927-caribbean-pushes-for-coordinated-maritime-decarbonisation-strategy-at-imo-event",
    "source": "shipandbunker.com",
    "score": 149
  },
  {
    "id": 1769799019,
    "date": "2026-01-30",
    "title": "Why Canada, Iceland and Norway Must Show Leadership on Cutting Shipping’s Arctic Emissions",
    "summary": "Ahead of next month’s meeting of the International Maritime Organization’s (IMO) Pollution Prevention and Response committee (PPR 13, February 9-13), the Clean Arctic Alliance is calling on Canada, Ic...",
    "content": "Ahead of next month’s meeting of the International Maritime Organization’s (IMO) Pollution Prevention and Response committee (PPR 13, February 9-13), the Clean Arctic Alliance is calling on Canada, Iceland and Norway to demonstrate solidarity with Denmark and Greenland’s leadership by supporting a proposal to reduce black carbon emissions from international shipping in the Arctic.\n\nJoin today’s pre-PPR13 briefing on Zoom with the Clean Arctic Alliance: Black carbon, Scrubbers, Sewage and the Arctic\n\nDenmark, which represents Greenland at the International Maritime Organization, is proposing, along with France, Germany and the Solomon Islands a new mandatory measure on “polar fuels”, PPR 13-6, which would require that only cleaner fuels with low emissions of black carbon be used by ships sailing in the Arctic.\n\n“As Arctic leaders, Canada, Iceland and Norway must show their support for an Arctic fuel proposal which sets out the characteristics of fuels that would be considered suitable for use in the Arctic – so-called polar fuels – at the IMO in February”, said Dr Sian Prior, Lead Advisor to the Clean Arctic Alliance. “This is a chance for democratic Arctic coastal nations of the north Atlantic to show their leadership and green credentials by supporting one another in the efforts to clean-up air polluting emissions from international shipping.”\n\nSupport from Canada, Iceland and Norway is essential to follow up on the adoption of two emission control areas (in the Canadian Arctic and the Norwegian Sea), and approval of a further Northeast Atlantic emission control area (ECA)which is due to be adopted in 2026 and includes Iceland and Greenland’s waters. While the ECAs are important in terms of reducing SOx and NOx air pollution, they do not adequately reduce emissions of superpollutant black carbon which poses both a health and a climate risk in the Arctic.”\n\nLast October, the Nordic Council recommended that Nordic Governments take action to require that theses cleaner “polar” fuels be used in the Arctic, but so far, Denmark and Greenland are the only Nordic nations to co-sponsor the proposal for an Arctic fuel measure.\n\nCanada\n\nThe Nordic Council Recommendation does not address Canada, but as an Arctic nation, Canada’s support is equally necessary to reduce air pollution and the impact of Black Carbon on sea ice.\n\n“Canada has supported the need for regulating Black Carbon from shipping for many years at the IMO, and also in domestic climate and air pollution strategies”, said Andrew Dumbrille, Advisor to the Clean Arctic Alliance and Director of Equal Routes, a Clean Arctic Alliance member. “PPR 13 is a prime opportunity to put this into action. For the first time a globally binding measure can be developed which will clean the air for Indigenous and local communities, contribute to maintaining ice habitat for wildlife, safeguard harvest rights key for local food sovereignty, and urgently address the climate crisis in the Arctic.”\n\nIceland\n\nIn recent weeks, months and years, Iceland has repeatedly declared its support for Greenland’s rights for full sovereignty; rights which are threatened by the rapid loss of ice and glaciers in the Arctic.\n\n“It is vital that Iceland support this proposal from Denmark, Greenland and others which with a wide scope can improve air quality in Iceland’s waters and reduce black carbon emissions originating within Iceland’s Exclusive Economic Zone (EEZ) from settling onto sea- and land-ice in the Arctic – this pollution is speeding up melting, which in turn is contributing to the slowing down of the Atlantic Meridional Overturning Circulation”, said Arni Finnsson, Board Chair at the Iceland Nature Conservation Association.\n\nNote: Iceland deems possible Atlantic current collapse a security risk (Reuters)\n\nNorway\n\n“Norway has already introduced an Emission Control Area in the Norwegian Sea which will take effect from 1 March 2027, and has supported the adoption of the Nordic Council Recommendation on action by Nordic Governments on the use of polar fuels in the Arctic”, said Karoline Andaur, CEO of WWF Norway (WWF Verdens naturfond). “Norway should support the proposal from Denmark, Greenland and others which with a wide scope can improve air quality in Norwegian waters, reduce black carbon emissions originating within Norway’s EEZ settling onto sea- and land-ice in the Arctic, and reduce the threat of heavy fuel oil spills.”\n\nSource: Clean Arctic Alliance",
    "source_url": "https://www.hellenicshippingnews.com/why-canada-iceland-and-norway-must-show-leadership-on-cutting-shippings-arctic-emissions/",
    "source": "hellenicshippingnews.com",
    "score": 123
  },
  {
    "id": 1769795391,
    "date": "2026-01-30",
    "title": "K Line, MOL and MISC line up for next wave of Northern Lights CO2 carrier orders",
    "summary": "Northern Lights has handed out a fresh round of CO2 shipping business to three of Japan and Malaysia’s biggest blue‑chip owners.\n\nThe Oslo‑based CCS JV – owned by Equinor, TotalEnergies and Shell – ha...",
    "content": "Northern Lights has handed out a fresh round of CO2 shipping business to three of Japan and Malaysia’s biggest blue‑chip owners.\n\nThe Oslo‑based CCS JV – owned by Equinor, TotalEnergies and Shell – has awarded a long‑term time charter for one 12,000 cu m liquid CO2 carrier to a consortium of Kawasaki Kisen Kaisha (K Line) and MISC, with a second sister vessel set to go to the same pair in April 2026. In parallel, Mitsui OSK Lines (MOL) has secured two long‑term charters for another two newbuild CO2 carriers.\n\nThe first three vessels will each have 12,000 cu m cargo capacity, significantly lifting Northern Lights’ seaborne capacity beyond its initial 7,500 cu m trio and aligning with signed customer contracts and the project to lift transport and storage capability above 5m tonnes of CO2 per year. All four new ships will be owned by the respective shipowners.\n\nChina’s Dalian Shipbuilding Offshore (DSOC) and South Korea’s HD Hyundai Heavy Industries (HHI) have been tapped to build the vessels, with deliveries scheduled between the second half of 2028 and the first half of 2029.\n\n“We are pleased to significantly grow our transport capacity by adding vessels to our existing Northern Lights fleet,” said managing director Tim Heijn. “With an expanded fleet, we will be able to deliver on our commitments to our customers. It will also enable us to optimise operations and increase flexibility.”\n\nThe move follows the delivery of the 7,500 cu m Northern Pioneer, Northern Pathfinder and Northern Phoenix from DSIC/DSOC since late 2024, all managed by K Line under phase one of Norway’s Longship CCS project. A fourth identical vessel, owned and operated by Bernhard Schulte, will join in 2026.\n\nNorthern Lights began injecting liquefied CO2 for permanent subsea storage in August 2025 and already has commercial agreements with emitters including Yara, Ørsted and Stockholm Exergi.",
    "source_url": "https://splash247.com/k-line-mol-and-misc-line-up-for-next-wave-of-northern-lights-co%e2%82%82-carrier-orders/",
    "source": "splash247.com",
    "score": 46
  }
]