[
  {
    "id": 1771743613,
    "date": "2026-02-22",
    "title": "Shipfinex FZCO Secures In-Principle Approval from VARA for Virtual Asset Broker-Dealer License",
    "summary": "Shipfinex's virtual asset license in Dubai aims to tokenize ships, potentially attracting new investors. Fractional ownership won't change the tonnes of HFO burned. We remain skeptical of any scheme that doesn't directly cut ship carbon intensity.",
    "content": "Dubai, UAE, Feb. 21, 2026 (GLOBE NEWSWIRE) -- Shipfinex FZCO, a digital platform dedicated to the democratization of the maritime economy, is pleased to announce it has received In-Principle Approval (IPA) from Dubai’s Virtual Assets Regulatory Authority (VARA) for a Broker-Dealer license.\n\nThis milestone marks a significant step forward in Shipfinex’s mission to enable fractional ownership of ships through compliant, transparent, and regulated pathways. The In-Principle Approval validates that Shipfinex FZCO has met VARA’s rigorous initial requirements regarding compliance, security, and operational capability.\n\nAs the maritime industry seeks new avenues for capital and liquidity, Shipfinex utilizes Distributed Ledger Technology to tokenize maritime assets, converting them into Maritime Asset Tokens (MAT). This process allows investors to hold fractional ownership rights in ships, providing access to an asset class traditionally reserved for institutional funds.\n\n\"Securing this In-Principle Approval from VARA is a testament to our commitment to building a fully regulated, secure, and transparent ecosystem for shipping finance,\" said Capt. Vikas Pandey, Founder & CEO of Shipfinex. \"Dubai is rapidly becoming a global hub for virtual assets, and we are proud to align our operational standards with VARA’s progressive regulatory framework to protect our investors.\"\n\n\"The maritime industry is one of the oldest and most vital pillars of the global economy, yet its financial structures have remained largely unchanged for decades,\" added Mr. Vivek Seth, Chairman of Shipfinex. \"This approval is a validation of our vision to integrate the reliability of traditional shipping with the efficiency of the digital economy.\"\n\nMr. Dipak Karki, CFO of Shipfinex , commented: \"This is an evolutionary step for ship finance, impacting both debt and equity through technology. It allows the exchange to be an efficient, transparent platform for individuals and institutions to share economic ownership of a vessel, a model now validated by a world-class regulator.\"\n\nNext Steps\n\nShipfinex FZCO will now proceed to satisfy the remaining conditions required to secure the full Virtual Asset Service Provider (VASP) license. The platform offers investors a seamless, regulated environment to own fractional ownership in ships, with complete security, transparency, and professional governance.\n\nAbout Shipfinex\n\nShipfinex is a regulated platform building the financial evolution of the maritime industry. By leveraging RWA Tokenization and Distributed Ledger Technology (DLT), Shipfinex enables ship owners to unlock liquidity and allows investors to participate in maritime assets.",
    "source_url": "https://markets.businessinsider.com/news/stocks/shipfinex-fzco-secures-in-principle-approval-from-vara-for-virtual-asset-broker-dealer-license-1035852478",
    "source": "markets.businessinsider.com",
    "score": 57
  },
  {
    "id": 1771657217,
    "date": "2026-02-21",
    "title": "Shipping’s ‘constantly changing reality’",
    "summary": "DNV analysts report that geopolitical instability is derailing shipping's climate focus. Trade wars and the IMO's failure to adopt a Net-Zero Framework are primary concerns. Shifting global power dynamics, especially shipbuilding capacity, will exacerbate shipping's adaptation challenges.",
    "content": "In a year where “geopolitics stole almost all the headlines”, 2025 has left the shipping markets in a “constantly changing reality”, according to Jakub Walenkiewicz, principal market analyst at DNV.\n\nSpeaking in an episode of DNV Market Views, Walenkiewicz said this “new world order … creates a very complex environment to understand”. Shipping markets must therefore find a way to “function, adapt or perhaps even reinvent”.\n\nWalenkiewicz was joined by Christopher Pålsson, managing director and partner of maritime-insight, in a discussion dissecting last year and how it sets the tone for 2026. Last year was marked by trade wars, port fee disputes, and a significant setback in international climate policy with the IMO’s failure to adopt a Net-Zero Framework, noted Walenkiewicz.\n\nPålsson said that while seaborne trade is historically resilient to business cycle disruptions, the current geopolitical climate is “quite different”,\n\nwith dramatic shifts in trade patterns determined by “who does what to whom”. This has fundamentally altered the discourse in shipping forums, where 90% of inquiries now focus on political developments in the Middle East, Russia, Ukraine, and the US rather than traditional commodity drivers.\n\nOne of the themes discussed was the “rise and fall of empires”, a concept Pålsson used to describe the shifting balance of global power. He argued that historically, an empire’s strength was inextricably linked to its control of the seas through shipbuilding capacity. Here he highlighted the US’ total shipbuilding output over the last decade as being roughly equivalent to a single week’s production in China. This imbalance has prompted a renewed focus on domestic shipbuilding in the US, with several initiatives and significant funding now flowing into the sector to restore maritime competitiveness and maintain control over naval interests.\n\nRise of India\n\nBeyond the US and China, India is emerging as a critical player on the new trade map. Although India has struggled for years to establish a dominant shipbuilding presence, Pålsson noted it is now on a “much more positive trajectory” with strong government backing and an influx of contracts. The presence of marine equipment companies in India further suggests a sustainable development cycle. Walenkiewicz added that India’s growth is driven by its status as the world’s most populous country, with immense energy needs that are essential for lifting its population out of poverty.\n\nThis demographic shift is central to the future trade map. With 1.5 billion more people expected on the planet by 2050, the demand for energy, food, and housing will skyrocket, particularly in sub-Saharan Africa and Asia. Walenkiewicz pointed out that even if per-capita energy use remains stagnant, population growth alone will necessitate 15-20% more energy by 2050.\n\nHowever, as these developing regions grow, their energy consumption will likely increase dramatically. Pålsson noted that the average energy consumption in sub-Saharan Africa is currently around 5 gigajoules per capita, compared to 200-400 gigajoules in the Western world.\n\n“1.5 billion more people on this planet in 25 years… requires that we build a new India in 25 years,” Pålsson said\n\nunderscoring the massive implications for the trade of steel, cement, iron ore, and grain.\n\nThis growth is shifting the global economic “centre of gravity” eastward and southward. The traditional trade model—East produces, West consumes—is being challenged as emerging\n\neconomies develop robust domestic demand. Europe must find a new role in this landscape, as it is no longer the primary source of growing demand, Pålsson said. He envisioned a future dominated by intra-Asian trade and increasing South-South trade between Asia, Africa, and Latin America. This shift is not a modern phenomenon but a return to a historical norm; before the Industrial Revolution, global GDP was largely proportional to population size, and the rest of the world is now “catching up quite rapidly”.\n\nEnergy shift\n\nThe energy transition adds another layer of complexity. While the move toward renewable and electro-fuels is underway, Pålsson expressed scepticism about a complete phase-out of fossil fuels in the near term, particularly given the reliance of developing nations on “cheap energy” like steam coal. Currently, fossil energy commodities account for 40% of global shipping. A plateau or decline in oil consumption, driven by electrification in the transportation sector, would significantly impact investment and ship utilisation, particularly for long-haul VLCCs.\n\nIn the immediate future, the shipping industry faces significant logistical hurdles.\n\nThe Red Sea and Suez Canal disruptions remain “the elephant in the room”, with major carriers like Maersk and CMA CGM navigating a precarious environment.\n\nPålsson said that a return to normal Suez traffic would suddenly release 11-15% of existing capacity back into the market, putting downward pressure on freight rates in an already oversupplied environment. While low rates may benefit cargo owners, they present a challenge for ship operators who may resort to “blank sailings” or network changes to manage capacity.\n\nThe aging of the world fleet is another concern. Walenkiewicz noted that disruptions have kept older ships in service longer, resulting in historically low scrapping rates. Replacing these vessels is a monumental task that will likely take a decade rather than a few years. Pålsson highlighted a severe lack of green recycling capacity, with most activities concentrated in India, Pakistan, Bangladesh, and Turkey. Walenkiewicz said that AIS data suggests that many smaller, older vessels may already be mothballed, potentially making the active fleet younger than official registers suggest. However, for the large-vessel segments built during the 2006-2012 boom, the aging problem remains acute and unavoidable.",
    "source_url": "https://www.hellenicshippingnews.com/shippings-constantly-changing-reality/",
    "source": "hellenicshippingnews.com",
    "score": 103
  },
  {
    "id": 1771657240,
    "date": "2026-02-21",
    "title": "Barbados to explore green shipping corridors",
    "summary": "Barbados is \"exploring\" green shipping corridors with an IMO-funded study, conveniently ignoring the massive carbon debt of its existing cruise ship industry. This \"pre-feasibility\" exercise seems designed to generate headlines, not reduce the tonnes of HFO burned offshore daily. Don't expect actual emissions reductions any time soon.",
    "content": "Barbados is exploring ways to advance green shipping corridors to cut maritime emissions, starting with a pre-feasibility study commissioned by the IMO. As announced, an initial meeting with the Government and national stakeholders in the framework of the Barbados Green Shipping Corridors: Pre-Feasibility, Policy and Regulatory Pathways study was held on 12 February.\n\nThe study is funded through the IMO Integrated Technical Cooperation Programme (ITCP) and builds on earlier work undertaken under the GreenVoyage2050 Programme, including support for countries to develop National Action Plans (NAPs) on maritime decarbonization.\n\nParticipants from Barbados included the Maritime Transport Administration, the Ministry of Tourism and International Transport, and Barbados Port Inc.\n\nThe study aims to assess Barbados’ readiness and potential to participate in scalable zero-emission shipping initiatives, while identifying policy, regulatory and infrastructure considerations at national and regional level. IMO will continue to work closely with the Government of Barbados and relevant stakeholders as the work progresses.",
    "source_url": "https://safety4sea.com/barbados-to-explore-green-shipping-corridors/",
    "source": "safety4sea.com",
    "score": 84
  },
  {
    "id": 1771657237,
    "date": "2026-02-21",
    "title": "Sinking trees into the Arctic Ocean could reduce carbon emissions. But is it worth it?",
    "summary": "Scientists propose sinking mature trees in the Arctic Ocean to sequester carbon, but the logistics are daunting. The annual potential of 1 gigatonne CO2 removal is negligible compared to the 37.8 gigatonnes emitted globally in 2024. The energy and emissions costs of harvesting and transporting trees for this scheme would likely negate any climate benefits.",
    "content": "Trees are well known for their ability to store carbon dioxide. They use the gas to fuel their growth, which is why younger, faster-growing trees absorb more carbon than mature trees.\n\nBut this storage solution is not forever. When trees rot or burn in a wildfire, they release that carbon back into the atmosphere.\n\nA group of scientists from the UK, Switzerland, and the Czech Republic p roposed an idea to sink mature trees from the vast boreal forest into the deep Arctic Ocean to lock away their carbon for centuries to come.\n\nIn a study published in the online peer-reviewed journal npj Climate Action, the scientists used computer modelling to explore the effects of removing specific stands of old, fire-prone trees in Canada, Alaska and Russia, floating them down six Arctic rivers including the Yukon and Mackenzie, and sinking them in the Arctic Ocean.\n\nAt the same time, new, fast growing trees would be planted in their place, to accelerate the absorption of carbon from the atmosphere.\n\nLast year, the same scientists discovered 8,000-year-old trees, still intact, in low-oxygen Alpine lakes. So the belief is that the cold, low-oxygen water in the Arctic would also act to reduce decay and keep that carbon in cold storage for thousands of years.\n\nThe study found that if done yearly in t hree areas covering 10,000 square kilometres each, which is just one per cent of the boreal forest, one gigaton of carbon dioxide could be removed from the atmosphere every year.\n\nWhile this idea works as a thought experiment, one gigaton is a drop in the bucket compared to total world carbon emissio ns, which the International Energy Agency says was 37.8 gigatons in 2024 alone, up from previous years.\n\nDespit e the potential gain s of carbon storage, a massive project like this also has to consider the amount of energy and associated carbon emissions needed to carry it out.\n\nIt takes large machinery to go into forests, cut down trees and haul them to rivers. Then, the giant logs need to be either loaded onto barges or floated downstream without jamming up. Once they reach the deep water of the Arctic Ocean, they somehow must be sunk to the bottom and held there.\n\nAs we’ve learned over several centuries of boat building, wood floats really well. The researchers state that it naturally takes around a year for driftwood to sink, but it can take longer if caught in sea ice.\n\nOnce the thousands of logs are permanently sunk, there is also the unknown impact on organisms living on the ocean floor.\n\nThere's also a cost to the forest itself. As ecologist Suzanne Simard pointed out in her book, Finding the Mother Tree, a mature tree supports many other forms of life, from mosses, lichens, insects and birds, to a network of fungus clinging to its widespread roots. Removing the trees is a major disturbance to the forest, which thrives on diversity.\n\nFinally, there is the impact on the traditional lifestyle of the Indigenous populations that live in these forests.\n\nThis is another extreme example of a big geoengineering idea designed to level rising carbon emissions.\n\nConcepts such as spraying sulphur particles into the upper atmosphere to cut down on solar radiation, spraying water onto polar ice to thicken it and prevent loss during the summer, and constructing a huge sunshade in space to cool the Earth would all take considerable efforts over long periods of time.\n\nAnd each comes with the unknown consequences of tampering with the atmosphere, oceans and other natural systems.\n\nThese ideas are all last ditch efforts that are being considered if we do not solve the source of the problem, which is burning fossil fuels.\n\nIt's like being on the Titanic after it hit the iceberg and the captain says, “Don’t worry, we will pump the water out and keep the ship afloat.”\n\nThe Titanic was equipped with pumps, but unfortunately the water was coming into the ship faster than the pumps could remove it, and we all know the result.\n\nOur global carbon emissions are flowing into the atmosphere faster than we can remove them.\n\nThe ultimate solution is to deal with the primary source, which is burning fossil fuels . And the good news is that the technology to produce energy without emissions already exists.\n\nWe know how to capture the energy of the sun, the wind, heat of the Earth and tides. Nuclear power is making a comeback, and waste-free nuclear fusion is on the horizon. Solar power is now cheaper than coal.\n\nThese clean technologies are growing, but not fast enough. There is resistance to change, and a strong e ffort to keep business as usual because a lot of money and jobs are connected to those old technologies.\n\nWe can do more than try to pump water out of a sinking ship. We can plug the hole and stay afloat.",
    "source_url": "https://www.cbc.ca/radio/quirks/sinking-trees-carbon-emissions-9.7099205",
    "source": "cbc.ca",
    "score": 56
  },
  {
    "id": 1771657230,
    "date": "2026-02-21",
    "title": "U.S. renews threat to quit the International Energy Agency over net zero agenda",
    "summary": "The U.S. threatens to exit the IEA over its commitment to net-zero emissions targets, potentially weakening global climate efforts. This pressure aims to undermine the IEA's 2050 net-zero agenda, favoring continued fossil fuel reliance. Such actions risk destabilizing international climate agreements and could lead to increased carbon intensity in shipping.",
    "content": "U.S. Energy Secretary Chris Wright said on Thursday that the U.S. would “pressure” the International Energy Agency to move away from net zero — and quit from the global watchdog if it failed to do this.\n\nWright was speaking on the last day of an IEA ministerial meeting in Paris and shortly after he said the agency would need to reform for the U.S. to remain a long-term member.\n\n“There has been such a group mentality, 10 years invested in a destructive illusion of net zero by 2050, that the U.S. will use all the pressure we have to get the IEA to eventually, in the next year or so, move away from this agenda,” Wright said, according to Reuters.\n\nThe 2015 Paris Agreement committed nations to “net zero”, the balancing of carbon emitted into the atmosphere and removed from it. The U.S., India and the European Union were among the polluters that ratified the accord.\n\nWright added that it was not Washington’s intention to leave the IEA, as there’s “always a risk” China could gain dominance in the agency if it did.\n\nCNBC has reached out to the U.S. Department of Energy and the IEA for comment.\n\nA long-running war of words\n\nThe IEA, which was established in 1974 to ensure the security of oil supplies, faced criticism from the Trump administration last year when it projected that “peak oil”, when global crude production will reach its highest point before entering an irreversible decline, will take place around 2030.\n\nOPEC, the influential group of oil-exporting countries, accused the energy agency of fearmongering and risking the destabilization of the global economy. Wright called the IEA’s forecast “nonsensical.”\n\nThe energy watchdog later watered down its forecast, signaling in a major tonal shift that oil demand could keep growing through to the middle of the century.\n\nScientists have warned that global average temperatures must not increase by more than 1.5 degrees Celsius, if the worst of the climate crisis is to be avoided.",
    "source_url": "https://www.hellenicshippingnews.com/u-s-renews-threat-to-quit-the-international-energy-agency-over-net-zero-agenda/",
    "source": "hellenicshippingnews.com",
    "score": 55
  },
  {
    "id": 1771657222,
    "date": "2026-02-21",
    "title": "Biofuel Bunker Snapshot: Global B30-VLSFO prices gain on VLSFO price",
    "summary": "B30-VLSFO biofuel blends are becoming more expensive, with Singapore seeing a $48/tonne increase. Despite the price increases, Singapore's bio-blended bunker sales fell 34% to 60,000 tonnes in January, indicating limited demand. Shippers should note that these price fluctuations will impact the cost-effectiveness of biofuel strategies for CII compliance.",
    "content": "ARA and Gibraltar\n\nRotterdam’s B30-VLSFO (POMEME) price and Antwerp’s B30-VLSFO (UCOME) price has gained over the last week.\n\nRotterdam’s conventional VLSFO price has increased $34/mt during the last week, while Antwerp’s VLSFO price has increased $29/mt. These rises may have supported the rise in the B30-VLSFO prices.\n\nThe Prima Markets-assessed ARA POMOME and UCOME barge prices have inched just $4/mt higher over the same period.\n\nAntwerp’s blend price now holds a $54/mt premium over Rotterdam, narrowing from a $67/mt premium seen last week.\n\nBiofuel deliveries in the ARA may take around 7-10 days of lead time, a trader said.\n\nGibraltar’s B30-VLSFO price has increased $36/mt over the last week. Congestion caused at the port due to rough weather over the past few weeks has now cleared, port agent MH Bland said.\n\nSupplies of B30-VLSFO blend in the port may take around 10 days of lead time, a trader told ENGINE.\n\nSingapore and Fujairah\n\nSingapore B30-VLSFO price has also gained $48/mt over the last week, its price premium over the port’s conventional VLSFO has gained by $12/mt over the same period.\n\nPrima-assessed UCOME China barge prices, which are closely related to Singapore’s blend prices, have remained unchanged over the same period.\n\nFujairah’s B30-VLSFO price has gained by $39/mt over the same period, Its premium over Singapore’s blend price has decreased $9/mt over the last week.\n\nSeparately, Singapore’s bio-blended bunker sales declined 34% to 60,000 mt in January, data from the Maritime Port Authority said this week.\n\nIn other biofuels news",
    "source_url": "https://www.hellenicshippingnews.com/biofuel-bunker-snapshot-global-b30-vlsfo-prices-gain-on-vlsfo-price/",
    "source": "hellenicshippingnews.com",
    "score": 53
  },
  {
    "id": 1771657225,
    "date": "2026-02-21",
    "title": "Shipfinex FZCO Secures In-Principle Approval from VARA for Virtual Asset Broker-Dealer License",
    "summary": "Shipfinex's VARA approval in Dubai will tokenize vessel assets using blockchain. This venture presents an opportunity for investors to fractionally own ships, but also introduces new regulatory risks. We remain skeptical of the environmental impact of democratizing ship ownership, especially with the potential for increased utilization of older, less efficient vessels.",
    "content": "Shipfinex FZCO (https://www.shipfinex.com/) has received In-Principle Approval (IPA) from Dubai’s Virtual Assets Regulatory Authority (VARA) for a Broker-Dealer license.\n\nThis milestone validates Shipfinex’s operational framework, confirming it has met VARA’s rigorous requirements regarding compliance, governance, and security. It marks a significant step in establishing a compliant infrastructure for the global maritime industry.\n\nA Regulated Platform for Shipping Finance\n\nShipfinex utilizes Distributed Ledger Technology (DLT) to tokenize maritime assets, creating a trusted bridge between ship owners and a broader customer base.\n\nFor Ship Owners: The platform provides an alternative liquidity channel to tokenize vessel ownership and raise capital efficiently while maintaining operational control.\n\nFor Investors: The platform offers regulated access to fractional ownership in ships, enabling participation in an asset class previously inaccessible due to high capital thresholds.\n\nCommitment to Regulatory Standards “Securing this In-Principle Approval is a foundational step in our roadmap to modernize shipping finance,” said Capt. Vikas Pandey, Founder & CEO. “To truly democratize the industry, trust is paramount. Aligning with VARA’s robust regulatory framework ensures a secure, transparent, and compliant environment for all participants.”\n\n“Shipping requires constant reinvestment. As traditional funding retreats, we must embrace compliant financial pathways,” added Mr. Vivek Seth, Chairman. “Shipfinex respects operational realities while solving liquidity challenges with the governance owners expect.”\n\nMr. Dipak Karki, CFO, stated: “This is evolutionary progress for ship finance, impacting both debt and equity. It allows the exchange to be an efficient, transparent platform for individuals and institutions to share economic ownership of a vessel.”\n\nNext Steps\n\nShipfinex FZCO will now proceed to satisfy the remaining conditions required to secure the full Virtual Asset Service Provider (VASP) license. The platform offers customers a seamless, regulated environment to own fractional ownership in ships, with complete security, transparency and professional governance.",
    "source_url": "https://www.hellenicshippingnews.com/shipfinex-fzco-secures-in-principle-approval-from-vara-for-virtual-asset-broker-dealer-license/",
    "source": "hellenicshippingnews.com",
    "score": 49
  },
  {
    "id": 1771657212,
    "date": "2026-02-21",
    "title": "2 ‘exogenous shocks’ needed to boost stocks from lofty levels: BofA’s Hartnett",
    "summary": "BofA strategists predict that only a Middle East regime change ensuring abundant oil and a US-China trade deal can sustain current equity levels. This reliance on continued oil supply undermines emissions reduction efforts. Investors should be wary of betting on fossil fuels for future profits.",
    "content": "Bank of America (BofA) strategist Michael Hartnett said equities may need “two exogenous shocks” to push meaningfully higher from current elevated levels.\n\nIn the latest Flow Show report, Hartnett said that risk assets would likely require a “regime change in Middle East to secure abundant future oil supply and collapse in oil price” alongside a “Trump-Xi U.S.-China trade deal in April to reduce tariffs and improve Trump approval rating.”\n\nHartnett said positioning and profit expectations are flashing contrarian signals, noting that “positioning (extreme bull) & profits (consensus = boom) both say ‘sell’ stocks & credit; policy (tax & rate cuts) says ‘buy-any-dip.’”\n\nOn sentiment, the firm’s Bull & Bear Indicator eased to 9.4 from 9.5 but remained firmly in “extreme bull” territory. The elevated reading reflects sustained inflows to global stock ETFs and tech funds alongside strong global equity breadth, Hartnett said.\n\nHistorically, such levels have been associated with weaker near-term returns. The strategist noted that in past instances when the indicator rose above 9.5, the median three-month drawdown was about 4.3% for the , 5.5% for the and 8.6% for the .\n\nFlow data still showed solid risk appetite. In the latest week, equities drew $35.2 billion, bonds took in $26.4 billion and cash funds attracted $23.8 billion. Gold funds saw $1.4 billion of outflows — the largest in four months — while crypto funds lost $0.8 billion.\n\nIn other notable trends, BofA highlighted record four-week inflows into international equities of $64.6 billion and the largest six-week inflow ever into Korean equities.",
    "source_url": "https://www.hellenicshippingnews.com/2-exogenous-shocks-needed-to-boost-stocks-from-lofty-levels-bofas-hartnett/",
    "source": "hellenicshippingnews.com",
    "score": 10
  },
  {
    "id": 1771570817,
    "date": "2026-02-20",
    "title": "New analysis warns there is no obvious compromise to the Net Zero Framework",
    "summary": "UCL's analysis reveals that weakening the IMO's Net Zero Framework (NZF) would delay zero-emission fuel adoption until the 2040s. A single-tier fuel standard or NZF without economic penalties would undermine investment and enforcement. The current NZF \"as is\" remains the only viable option for a stable demand signal, despite potential deadlock at the IMO.",
    "content": "A new insight brief by the UCL Shipping and Oceans Research Group for the Getting to Zero coalition, titled “Uncertainty at the IMO: Three scenarios and their consequences for shipping’s transition”, concludes that of those options only the ‘as is’ (Net Zero Framework as agreed in principle in April 2025) has the potential to provide a credible, stable demand signal and revenue stream to support early and mass-market uptake of scalable zero-emission fuels. Weaker alternatives risk delaying scalable zero-emission fuel availability into the 2040s, whilst also reducing just and equitable transition opportunities through weakening or removing the fund.\n\nProf. Tristan Smith, Professor of Energy and Transport at UCL Shipping and Oceans Research Group said: “The Net Zero Framework was a fragile compromise in April last year. It should not be surprising that analysis finds that adjustments to make it acceptable to some governments, can be expected to lose support from other governments. Pursuing compromise to the Net Zero Framework ‘as is’ therefore risks further deadlock, and further extension to delay at IMO, and increased likelihood of a patchwork of regional regulation.”\n\nThe insight brief considers three potential scenarios, each having materially different impacts on enforcement, investment signals, revenues, low-income countries, and regional policies:\n\n1. NZF ‘as is’: The framework agreed in principle at MEPC 83 in April 2025 is adopted without modification in November 2026, entering into force in 2028.\n\n2. Single-tier global fuel standard (GFS): A compromise that removes the two-tier GHG fuel intensity architecture, retaining some but not all economic elements.\n\n3. NZF without an economic element: A framework stripped of its compliance market, non-compliance costs, Net-Zero Fund, and zero- and near-zero (ZNZ) reward — leaving only an aspirational GHG fuel intensity trajectory with no material consequences for non-compliance.\n\nThe insight brief concludes that alternative scenarios to NZF ‘as is’ would:\n\n• Provide little or no demand signal and revenue to support uptake of the scalable zero-emission fuels needed in the long run.\n\n• Still raise costs for lower income countries but would severely limit the capacity to support their transitions and mitigate disproportionate impacts.\n\n• More likely to encourage regulatory fragmentation, heighten investment risk, and decreased alignment with the IMO’s overall emissions reduction strategy.\n\nWhile the Net-Zero Framework is imperfect, many of these risk factors could be managed through the development of its guidelines for implementation. Even the NZF ‘as is’ is projected to deliver only around 10% absolute GHG reduction by 2030 against 2008 levels — below the Revised Strategy’s 20-30% checkpoint in 2030. Weaker scenarios would fall even shorter. The NZF ‘as is’ had the support of 88% of MARPOL signatories at the point of agreement. The report finds little evidence that reopening the framework text would produce broader consensus, and significant risk it would reignite political deadlock.\n\nThe insight brief therefore finds that progressing to adopt the Net-Zero Framework ‘as is’ at MEPC.ES2 in November 2026 has the lowest transition risk, both, for countries and for many companies. Deferment of long-term investment decisions from a protracted delay in search of a majority that is unlikely to exist increase the risk of a disorderly, expensive and inequitable transition.\n\nDisclaimer: This insight brief is written for the Getting to Zero Coalition and does not necessarily reflect the views of the Coalition or its individual members.",
    "source_url": "https://www.hellenicshippingnews.com/new-analysis-warns-there-is-no-obvious-compromise-to-the-net-zero-framework/",
    "source": "hellenicshippingnews.com",
    "score": 130
  },
  {
    "id": 1771570812,
    "date": "2026-02-20",
    "title": "An overview of BIMCO’s Emissions Trading Scheme Clause for Memoranda of Agreement 2025",
    "summary": "BIMCO's ETS clause for vessel sales puts responsibility for emissions reporting and allowance surrender squarely on the seller up to the point of delivery. This contrasts sharply with FuelEU Maritime, where buyers inherit the seller's compliance balance, a potential financial liability. Will this clause prevent sellers from offloading polluting vessels just before FuelEU Maritime penalties kick in?",
    "content": "The BIMCO Emissions Trading Scheme Clause for Memoranda of Agreement 2025 was formally adopted in December 2025, reflecting BIMCO’s commitment to providing clear and practical contractual tools that address the growing complexity of environmental regulation in the sale and purchase of vessels. Developed by a BIMCO subcommittee comprising shipowners, brokers, legal specialists, and P&I experts, and supported by broad stakeholder consultation, the clause offers a clear and practical framework for allocating responsibilities between buyers and sellers of vessels falling within the scope of an emissions trading scheme.\n\nThe clause builds on the established terminology of earlier ETS clauses and maintaining the scope to cover any applicable emission scheme(s) worldwide extending beyond the European Emission Trading Scheme (EU ETS) and anticipating future cap and trade mechanisms adopted by competent authorities.\n\nSellers’ Obligations Prior to Delivery\n\nUnder the clause, the sellers are responsible for compliance up to and including the moment of delivery. This includes fulfilling all reporting obligations required under the relevant emission scheme(s) and, where applicable, submitting a verified partial emission report that sets out the vessel’s emissions for the portion of the reporting period during which they owned the vessel. Sellers also remain responsible for surrendering the emission allowances corresponding to all predelivery emissions. This structure ensures that no emissions-related liabilities arising before delivery are transferred to the buyers.\n\nImportantly, this approach differs from the regime under FuelEU Maritime. Whereas the EU ETS places predelivery liabilities with the sellers, FuelEU Maritime requires the buyers to assume the sellers’ accrued compliance balance at delivery, meaning these liabilities must be financially settled between the parties at the time ownership transfers.\n\nTransfer of Responsibilities to Buyers\n\nFrom the point of delivery, buyers take on full responsibility for the vessel’s compliance under the applicable emission scheme(s). This includes the obligation to surrender allowances for emissions generated after delivery and to fulfil any ongoing reporting requirements. By ensuring that the transfer of obligations aligns exactly with the transfer of ownership, the clause provides a smooth and predictable compliance transition. This clarity is particularly important in sale and purchase transactions where uncertainty can otherwise arise over which party is accountable for portions of the reporting period.\n\nUnder the clause, the sellers must indemnify and hold the buyers harmless against any and all claims, losses, damages, or liabilities that may be incurred by, or alleged against, the buyers and/or the vessel under any emission scheme(s), or that arise from, or are connected with, any non-compliance or failure to surrender emission allowances under the applicable emission scheme(s).\n\nAs outlined above, this indemnity is unlikely to be triggered under the EU ETS, as all liabilities for the period prior to delivery remain with the sellers, and the buyers do not inherit any predelivery compliance obligations. However, it is important to recognise that future emission trading schemes may adopt different mechanisms. Including an indemnity provision was therefore essential to futureproof the clause and ensure the parties remain protected should regulatory schemes evolve.\n\nConclusion\n\nThe adoption of the Emissions Trading Scheme Clause for Memoranda of Agreement 2025 provides the maritime industry with a structured, transparent and future-oriented approach to managing emissions compliance during vessel ownership transfers. By clearly assigning responsibilities to sellers and buyers, introducing a verified reporting mechanism, and anticipating multiple emission scheme(s), the clause ensures contractual certainty in a regulatory landscape where such certainty is increasingly essential.",
    "source_url": "https://www.hellenicshippingnews.com/an-overview-of-bimcos-emissions-trading-scheme-clause-for-memoranda-of-agreement-2025/",
    "source": "hellenicshippingnews.com",
    "score": 106
  },
  {
    "id": 1771570836,
    "date": "2026-02-20",
    "title": "Great Lakes Maritime Academy sees influx of Louisiana cadets",
    "summary": "Great Lakes Maritime Academy attracts Louisiana cadets seeking maritime careers. Graduates often pilot vessels on the Mississippi River or operate offshore supply ships. The academy encourages graduates to remain in the Great Lakes region, despite Louisiana's proximity to Gulf shipping lanes.",
    "content": "TRAVERSE CITY — The Great Lakes Maritime Academy (GLMA) at Northwestern Michigan College is drawing cadets from an unlikely place. It’s gained a reputation in the “Bayou State” as the place to go if you want to pilot or work on ships.\n\nEvery year, GLMA admits up to 60 cadets. Many of them make the more than 1,200-mile trip all the way from Louisiana to spend four years honing their skills on the Great Lakes.\n\n“Well, in a way, it’s an honor because there are seven federally regulated maritime academies. You’ve got the federal academy and six state academies, and there’s one in Galveston, which is a lot closer to New Orleans than Traverse City,” said Great Lakes Maritime Academy Superintendent, Rear Admiral Jerry Achenbach. “I’m going to guess probably, 15 to 18 percent of the of the cadets are from Louisiana,” he added.\n\nIt’s not really that surprising since Louisiana sits at the mouth of the Mississippi River, one of the most important shipping arteries in the nation. “A majority of them have a goal of being a pilot on the Mississippi River. So, a lot of them will go down and work, offshore supply vessels,” said Achenbach. He goes on to say the desire is to have them stay in the Great Lakes region because of how skilled the cadets become, “We’re very supported by the Great Lakes industry and a cadet sea project on a Great Lakes freighter cost their company about $5,000, you know, so they’re, you know, that that’s how they support us. Our way of supporting is encouraging all the cadets, even though some of the great state of Louisiana to stay on the Great Lakes for a couple of years.”\n\nWhile most want to work as deck officers, there is also an engineering program that prepares cadets to operate and maintain engines and machinery. Second year engineering cadet Karson Keyser is one of them, “Born right around the Baton Rouge area. But spent most of my life in Louisiana. Spent a little bit of time in Texas. Okay, but, Louisiana is the home… Most people that are coming out of New Orleans, river area, they’re coming up here to hopefully become pilots in the Mississippi River. But, my pilot friend, super close with family. Great family. He sent me up here as like, no, you’re going to be an engineer. And I said, okay, I trust you.”\n\nWhile a majority of GLMA’s nearly 200 cadets are from Michigan, it’s just one of six state maritime academies in the country. Achenbach said Louisiana is not the only place outside Michigan sending high school students their way, “Well, obviously up beyond the Great Lakes states. We’ve got one from Montana. We’ve had from Hawaii, from Alaska.”\n\nMost of the cadets from Louisiana have probably never heard of Traverse City before coming here. Besides the winter weather, Karson really likes it, “It’s a unique place. So, when I tell people back home, there’s a place back home, Hammond, Louisiana. It really makes me think about a place back home. Kind of like a medium sized city. It’s super clean up here, too. Super, super clean. I’ve seen that.”\n\nEven though they have a chance to go home during the year, Karson said being so far away can, you can long for being home, “You know, so up here, FaceTime is my best friend. I get to talk to my mom, my sister, my grandparents. But we get, like, weekend trips home every once in a while. We get a spring break and then going home for Christmas.”",
    "source_url": "https://www.9and10news.com/2026/02/19/great-lakes-maritime-academy-sees-influx-of-louisiana-cadets/",
    "source": "9and10news.com",
    "score": 74
  },
  {
    "id": 1771570821,
    "date": "2026-02-20",
    "title": "TTF Prices Rise on LNG Supply Risks",
    "summary": "LNG prices are up 3% to €32.9 per MWh amid US-Iran tensions threatening Strait of Hormuz LNG shipments. This disruption could impact 20% of global LNG supply. Reduced EU gas storage, now at 32.5%, exacerbates the supply vulnerability.",
    "content": "European natural gas futures rose 3% to €32.9 per megawatt-hour, extending a 6.9% gain from the previous session, as fears grow that escalating tensions between United States and Iran could disrupt LNG flows through key Middle East routes.\n\nMarkets are focused on shipments via the Strait of Hormuz, a route for about 20% of global LNG, including exports from Qatar, the second largest exporter.\n\nA report from Axios said US military action against Iran could come sooner than expected, with Israel pushing for regime change, raising risks to regional supply.\n\nTight EU inventories add support, with European Union storage near 32.5%, the lowest since 2022, and Germany below 23%.",
    "source_url": "https://www.hellenicshippingnews.com/ttf-prices-rise-on-lng-supply-risks/",
    "source": "hellenicshippingnews.com",
    "score": 52
  },
  {
    "id": 1771570826,
    "date": "2026-02-20",
    "title": "Navios lines up $134m capesize duo",
    "summary": "Navios Maritime Partners adds two scrubber-fitted capesizes in 2028-29, extending their reliance on heavy fuel oil. The 12-year bareboat deals reveal a continued investment in older technology despite looming FuelEU Maritime penalties for excessive CO2 emissions. Will these ships exceed their CII ratings and face further corrective action costs?",
    "content": "New York-listed Navios Maritime Partners has moved to expand its dry bulk footprint, lining up two Japanese newbuilding capesizes under long-term bareboat-in arrangements.\n\nThe Angeliki Frangou-led owner said in its quarterly earnings report it agreed to take the scrubber-fitted vessels from an unrelated third party on 12-year bareboat contracts. Navios holds purchase options from the end of year four through to the expiry of the charters. The company said that, if exercised at the end of the 12-year period, the deals imply a combined price of about $134.3m and an effective interest rate of roughly 6%.\n\nThe capes are due to join the fleet in the second half of 2028 and the first quarter of 2029. Both ships have already been fixed out for about five years at an average floor rate of around $25,000 per day, with 50% profit sharing above the floor linked to the C5TC 182 index plus an average premium of roughly $3,000 per day.\n\nThe move adds further forward cover to Navios’ earnings base. Including recently agreed charters, the company reported contracted revenue of $3.8bn through 2037. In the container segment, five ships have been chartered out for an average of 1.8 years, three bulkers have been fixed for an average of 3.6 years at $23,974 per day, assuming the floor rate on the two capesize newbuildings. In tankers, three vessels have been fixed for about two years at $31,944 per day on average.\n\nAlongside the capesize additions, the Greek owner has been reshaping its tanker book, confirming the sale of two VLCCs for $136.5m, with expected close in the second quarter of 2026.\n\nNavios Partners currently owns and operates 67 bulkers, 51 containerships and 53 tankers. The orderbook includes 16 newbuilding tankers scheduled through the first half of 2028, eight newbuilding containerships delivering by the same timeframe and now the two capesize bareboat-ins arriving from 2028 onwards.",
    "source_url": "https://splash247.com/navios-lines-up-134m-capesize-duo/",
    "source": "splash247.com",
    "score": 16
  },
  {
    "id": 1771484434,
    "date": "2026-02-19",
    "title": "Crew change travel carries a carbon cost that shipping can no longer ignore",
    "summary": "Scope 3.6 emissions from crew changes are a largely ignored, yet significant, contributor to shipping's climate impact. Neglecting these emissions exposes the industry to criticism as investors and charterers demand comprehensive environmental accounting. Quantifying crew travel emissions is the first step towards a meaningful, and presently lacking, sustainability strategy.",
    "content": "Pippa Ganderton, head of ATPI Halo, writes for Splash about the largely unaccounted-for environmental impact of crew change travel and why shipping cannot afford to ignore Scope 3.6 emissions.\n\nShipping’s efforts to decarbonise are rightly focused on optimising vessel performance, with the aim of reducing fuel consumption and emissions through more efficient propulsion, operational and digital technology, and ship design. These at-source emissions areas are visible, regulated, and increasingly tracked. But alongside the decarbonisation of ships, Scope 3.6 emissions from the global movement of seafarers for crew changes are a significant contributor to the industry’s climate impact.\n\nCrew change travel is a critical, operational requirement of global shipping, enabling vessels to operate safely, lawfully, and continuously, and every year, millions of flights are taken to move seafarers between home and vessel. Yet the greenhouse gas emissions from these movements rarely feature in carbon accounting, despite their scale and inevitability.\n\nWhile Scope 3 emissions are not yet regulated in any national or international decarbonisation framework, many countries are introducing national disclosure regimes that include them. Investor and charterer expectations are also evolving quickly. Maritime operators are increasingly being asked to account for the full extent of their environmental impact, not just emissions generated onboard, but those embedded in their operational ecosystem. In this context, understanding and addressing emissions from crew travel is becoming not only a matter of environmental responsibility, but of commercial credibility.\n\nThe first step is measurement. Without quantifying the footprint of crew change travel, it is impossible to establish a meaningful sustainability strategy. Once data is available, operators can begin to identify where, if anywhere, emissions can be reduced. In many cases, opportunities to cut emissions are constrained. Crew change travel logistics are dictated by vessel schedules, port locations, and regional infrastructure. Often, only one or two airline options exist for a given route. Bookings are frequently made at short notice to accommodate operational changes.\n\nNevertheless, incremental reductions are still possible. When alternative carriers are available, evaluating their fleet efficiency and sustainability credentials can inform decisions. Direct flights, which avoid the carbon intensity of multiple take-offs and landings, are another area of potential improvement (not to mention the potential to keep crew healthier and happier with simpler travel itineraries). These marginal gains may not be transformative, but they contribute to a culture of accountability.\n\nSustainable aviation fuel (SAF) is a growing direct reduction mechanism for ship operators, although its current cost and availability remain barriers to widespread adoption. Operators may start with a small SAF investment, for example, covering five or ten percent of travel volumes, and scale over time as budgets and infrastructure allow. This phased approach is often viewed positively by auditors and stakeholders when supported by clear reporting.\n\nWhere crew change travel emissions cannot be avoided or reduced, compensation strategies can strengthen a company’s environmental profile or demonstrate to auditors that credible action is being taken to address its footprint.\n\nThe effectiveness of such approaches depends entirely on the quality and transparency of the programmes involved. Some specific carbon offset projects have faced legitimate criticism in the past, making third-party certification, robust audit trails and verifiable project documentation essential. While compensation is no substitute for reduction, it offers a responsible and measurable pathway for addressing emissions that remain unavoidable within operational constraints.\n\nIn terms of compensation, certain initiatives resonate strongly within the maritime sector. Blue carbon projects, which focus on coastal ecosystems such as mangroves, have particular relevance. The Delta Blue project in Pakistan, the world’s largest mangrove restoration programme, is one such initiative that has seen strong engagement from shipping companies. Its alignment with ocean health, biodiversity and climate resilience makes it a compelling example of sector-specific carbon mitigation. Many organisations combine investments in flagship projects like Delta Blue with other certified forestry or community-based initiatives to balance both environmental and social outcomes.\n\nWhile Scope 3.6 emissions are not yet a formal reporting requirement across the shipping industry, they are rapidly moving into view. As emissions from vessels are gradually reduced through advances in propulsion and fuels, the proportion of emissions attributable to air travel will become more prominent by comparison. Companies that have already established strategies for measuring, reducing and compensating these emissions will be better placed to respond to both regulatory shifts and stakeholder expectations.",
    "source_url": "https://splash247.com/crew-change-travel-carries-a-carbon-cost-that-shipping-can-no-longer-ignore/",
    "source": "splash247.com",
    "score": 118
  },
  {
    "id": 1771484424,
    "date": "2026-02-19",
    "title": "Administration’s Maritime Action Plan misses defining an opportunity to strengthen US shipping competitiveness and capture emerging clean maritime markets",
    "summary": "The Maritime Action Plan prioritizes legacy technologies, neglecting zero-emission vessels and risking competitiveness. Rolling back environmental oversight near ports will disproportionately burden already polluted communities. A proposed \"ship tax\" on foreign-built ships, estimated to generate $66 billion over 10 years, may trigger retaliatory tariffs.",
    "content": "The Trump administration released the Maritime Action Plan (MAP) on February 13, 2026, a long-anticipated federal blueprint to revive the American shipbuilding industry amid growing global competition. Yet, for all its ambition, the plan largely focuses on rebuilding capacity around legacy technologies, offering little indication that the federal government is preparing the U.S. industry for next-generation, zero-emission vessels already reshaping global maritime markets and rapidly becoming the benchmark for maritime competitiveness.\n\nThe plan’s simultaneous push to scale up maritime activity, while rolling back environmental oversight raises serious concerns for the roughly 12% of Americans who live near seaports in communities already bearing disproportionate pollution burdens. You cannot build a generational workforce in communities you are simultaneously making less livable. Without a unifying vision that integrates economic, security, environmental and public health priorities the plan risks falling short of its own ambitions.\n\nAmong the MAP’s most consequential proposals is once again a universal fee or “ship tax” on foreign-built ships based on cargo weight — a measure they claim will generate between $66 billion and $1.5 trillion over 10 years to fund a Maritime Security Trust Fund. Economists are likely to view this as a de facto tariff on maritime trade, with costs passed ultimately to American consumers through retailers and importers, carrying the potential to invite retaliation from trading partners.\n\nMandated by a 2025 Executive Order signed by President Trump, the strategy centers on rebuilding U.S. maritime capacity and restoring resilience to the domestic shipbuilding industry. According to the administration, less than 1% of new commercial ships are built in the United States — a stark indicator of the nation’s diminished shipbuilding capacity. With only 66 shipyards nationwide — consisting of just eight active shipbuilding yards, 11 shipyards with build positions, 22 repairs yards with drydocking capability, and 25 topside repairs yards — the United States lacks the industrial infrastructure necessary to scale domestic shipbuilding to the rate required to meet growing economic, security and strategic demands.\n\nThe MAP acknowledges these structural realities and proposes a sweeping set of actions intended to modernize shipyards, expand dry docks, leverage AI and automation, create new tax incentives and federal financing tools, expand cargo preference requirements, and develop a Strategic Commercial Fleet of U.S.-built and U.S.-flagged vessels to ensure sealift readiness and trade continuity. The plan explicitly identifies China as a strategic threat to American maritime dominance and places significant emphasis on autonomous and robotic vessels, Arctic strategy, and workforce expansion through maritime academies and new credentialing pipelines. Notably, much of the foreign investment the MAP celebrates comes from nations — including Finland — whose own shipbuilding industries are racing toward zero-emission compliance, a standard the MAP itself conspicuously does not address.\n\nStatement from Antonio Santos, Federal Climate Policy Director, Pacific Environment:\n\n“While the Trump administration’s Maritime Action Plan seeks to revitalize domestic shipbuilding and exert greater control over global supply chains, the plan lacks a clear commitment to ensuring this new ‘Maritime Golden Age’ in the U.S. is powered by sustainable maritime fuels and next-generation vessels. United States leadership in the development and deployment of cleaner ships is a critical strategy to national energy security, long-term economic competitiveness and creating high-quality manufacturing jobs.\n\n“To truly become a global maritime leader, the U.S. must do more than just build more ships; it must invest in innovation to build the cleanest and most efficient fleet in the world. Zero-emission vessels are rapidly becoming the global benchmark for maritime competitiveness.”\n\nShipowners, financiers and trading partners around the world are already making decisions based on clean maritime standards. The International Maritime Organization’s net-zero framework negotiations are setting the terms of global maritime competition — and the shipyards and nations positioned to build compliant vessels will capture that market. A plan that ignores this reality risks locking the United States into technologies that the rest of the world is moving away from, undermining the very competitiveness it seeks to restore. The MAP proposes to build the hardware of the future on the fuel architecture of the past — and in doing so, risks ceding the most valuable segment of the emerging maritime market before America has even re-entered the race.\n\nStatement from Davina Hurt, Climate Policy Director, Pacific Environment:",
    "source_url": "https://www.hellenicshippingnews.com/administrations-maritime-action-plan-misses-defining-an-opportunity-to-strengthen-us-shipping-competitiveness-and-capture-emerging-clean-maritime-markets/",
    "source": "hellenicshippingnews.com",
    "score": 96
  },
  {
    "id": 1771484438,
    "date": "2026-02-19",
    "title": "Hormuz Pressure Play: Iran’s ‘Temporary’ Closure Sends a Strategic Signal to Global Shipping",
    "summary": "The Strait of Hormuz saw temporary restrictions due to Iranian military exercises, impacting approximately 3.2 million m3 of daily petroleum flow. This action coincides with US-Iran nuclear negotiations, suggesting strategic signalling rather than a mere safety drill. Expect increased war-risk premiums despite the short-term nature of the closure.",
    "content": "Tension in one of the world’s most critical maritime chokepoints spiked this week after Iran temporarily restricted parts of the Strait of Hormuz during live-fire military exercises, a move that underscored how quickly geopolitics can ripple through global shipping markets even without a full blockade.\n\nBy Paul Morgan (gCaptain) – Iranian media described the measure as a short-duration safety restriction linked to Revolutionary Guard drills, rather than a sustained shutdown. That distinction matters. While headlines suggested Iran had “closed” the strait, the available evidence points instead to a limited operational restriction lasting several hours, enough to disrupt sentiment and insurance risk calculations, but not to halt traffic outright.\n\nThe Strait of Hormuz remains the world’s most sensitive maritime chokepoint, carrying roughly one-fifth of global petroleum liquids consumption, around 20 million barrels per day, through narrow traffic lanes only about two miles wide within a waterway roughly 21 miles across at its narrowest point. Even brief exercises that raise perceived risk can ripple through freight markets, war-risk premiums and voyage planning.\n\nWhat made this episode different was timing. The temporary restriction unfolded alongside indirect US-Iran nuclear negotiations in Geneva and a visible military build-up in nearby waters. For shipowners and operators watching from the bridge and the chartering desk, the message felt less like an isolated exercise and more like strategic signalling.\n\nThe current cycle of tension began building in late December and January amid internal unrest in Iran and sharper rhetoric from Washington. Regional naval monitoring intensified as both sides sought to signal resolve without crossing into open conflict.\n\nIn early February, Tehran formally announced its “Smart Control of the Strait of Hormuz” military exercise, broadcasting navigational warnings to vessels about planned live-fire activity. The warnings alone were enough to trigger heightened monitoring by insurers and maritime security analysts.\n\nOn 4 February, tensions escalated further when a US Navy fighter jet shot down an Iranian drone approaching a carrier strike group in the Arabian Sea, a reminder of how quickly encounters in crowded operational environments can spiral.\n\nIn the days that followed, Iranian outlets reported missile tests and surface-firing drills linked to the exercise. US Central Command responded with warnings that unsafe manoeuvring near coalition vessels or commercial shipping risked escalation and destabilisation.\n\nThe most significant moment came Tuesday morning, when Iranian media said parts of the strait would be restricted for several hours for “safety and maritime concerns.” Reports described live-fire activity in or near the shipping lanes. While the extent of disruption remained unclear, the announcement alone triggered renewed attention across the energy and maritime sectors.\n\nSimultaneously, indirect nuclear talks between Washington and Tehran resumed in Geneva. Iranian officials said both sides had agreed on “guiding principles,” though major red lines remained unresolved, according to US officials. Diplomacy and maritime signalling unfolded in parallel, reinforcing the perception that the exercise was as much political theatre as military training.\n\nStrategic Messaging, not a Full Blockade. Despite recurring rhetoric from Tehran about the ability to close Hormuz, a sustained blockade remains unlikely in the near term. The strait is not simply an Iranian waterway; it is an international transit route bordered by Iran and Oman, and any attempt to fully shut it would risk overwhelming international response while also choking Iran’s own export routes.\n\nInstead, analysts say Iran continues to rely on calibrated disruption, exercises, warnings and temporary restrictions, to remind global markets of its leverage without triggering a decisive military reaction.\n\nHistory offers precedent. During the 1980s Iran-Iraq “Tanker War,” mines and attacks made parts of the Gulf effectively impassable at times, but in recent decades Iran has typically stopped short of sustained closure, even during periods of acute confrontation.\n\nFor commercial shipping, the real impact of the latest episode lies not in a dramatic stoppage of traffic but in the accumulation of uncertainty. A few hours of restricted navigation may not halt flows, but it sharpens scrutiny from underwriters, raises the prospect of higher premiums and encourages charterers to reassess routing risk.\n\nOperationally, Hormuz’s geography amplifies that sensitivity. While the strait itself spans more than 30 kilometres at its narrowest point, ships follow tightly defined lanes that compress traffic into predictable corridors. Any military activity in or near those lanes, even if declared safe, introduces an element of unpredictability that shipowners cannot ignore.\n\nThe presence of the USS Abraham Lincoln carrier strike group in the Arabian Sea and Washington’s announcement that the USS Gerald R. Ford would move toward the region added another layer to the strategic backdrop. Tehran’s leadership warned that any attack could trigger retaliation, reinforcing the sense that the maritime environment is becoming a stage for geopolitical signalling.\n\nUltimately, this week’s episode was less about physically shutting the Strait of Hormuz and more about demonstrating the possibility. A Warning Shot to Markets! By temporarily restricting navigation during a high-profile exercise, Iran reminded the shipping industry, and global energy markets, how fragile the balance of security and commerce remains in the Gulf.\n\nFor shipowners and seafarers, the takeaway is familiar: Hormuz rarely closes outright, but it does not need to. Even a short-lived disruption can send shockwaves through freight markets and strategic planning, proving once again that the world’s most vital oil corridor remains as much a political instrument as a maritime highway.",
    "source_url": "https://gcaptain.com/hormuz-pressure-play-irans-temporary-closure-sends-a-strategic-signal-to-global-shipping/",
    "source": "gcaptain.com",
    "score": 68
  },
  {
    "id": 1771484419,
    "date": "2026-02-19",
    "title": "Ship Recycling Markets Faced with Supply Constraints",
    "summary": "Ship recycling faces supply constraints and political uncertainties, impacting prices. India's stricter rules on flag, P&I cover, and class compliance may block sanctioned tankers. Limited fresh tonnage means yards must decide whether to accept tighter margins or become more selective.",
    "content": "The ship recycling markets have been facing supply constraints, while political uncertainties are also evident. In its latest weekly report, Best Oasis (www.best-oasis.com), a leading cash buyer of ships said that “the Indian market came off towards the end of the week, with sentiment pressured by a firmer U.S. Dollar and a weaker Indian Rupee. Reports around potential Russia–U.S. trade developments, including renewed use of the U.S. dollar as a key trading currency, have further shifted market perspective and may keep the dollar strong in the near term. Tankers continue to flow into the recycling system, keeping India as the primary workable destination for such units; however, fresh guidance from the Directorate General of Shipping (DGS), India, may restrict sanctioned tanker arrivals due to stricter requirements on flag, P&I cover, and class compliance”.\n\nBest Oasis added that “the Bangladeshi market remained buoyant this week, with buyers continuing to show aggressive interest. However, it remains to be seen how long this momentum can be sustained, as yard capacity is gradually filling up. With elections approaching, sentiment stayed cautious, as the outcome is expected to influence near-term confidence and broader market conditions, particularly on the financial side. Notably, across all recycling destinations, availability of fresh recycling candidates remains limited, and it remains to be seen whether buyers will continue to pursue units at tighter margins to keep yard activity moving, or become more selective going forward. Also, the Pakistani market remained firm this week, supported by selective buying interest from a limited number of active buyers. Activity continues to be concentrated among a few HKC-approved yards with the necessary permissions to recycle vessels, limiting broader market participation. Due to this restricted recycling base, the market cannot be solely relied upon for consistent absorption of tonnage. Across all recycling destinations, the dearth of recycling candidates remains evident, and it remains to be seen whether buyers will continue to transact at tighter returns or pause until supply and pricing conditions stabilize. Finally, the Turkish market remained stable this week, largely mirroring last week’s conditions both locally and on import. Overall sentiment and activity were steady, with no major developments to materially shift market direction”, Best Oasis concluded.\n\nMeanwhile, in a separate report, shipbroker Intermodal added that “political developments dominated headlines last week across the Subcontinent, while ship recycling markets continued to face constrained supply conditions. In Bangladesh, the long-awaited February election delivered a decisive victory for the Bangladesh Nationalist Party (BNP) under Tarique Rahman, securing a strong parliamentary majority and ending a period of political uncertainty. The smooth transition has boosted business sentiment, with expectations that stability will support investment and improve access to credit and LCs. With the BNP’s agenda focused on governance reform and economic revival, renewed emphasis on infrastructure spending is generating optimism across the steel and ship recycling sectors. Ship recycling activity rebounded last week, with buyers actively seeking vessels amid constrained supply and declining yard availability.",
    "source_url": "https://www.hellenicshippingnews.com/ship-recycling-markets-faced-with-supply-constraints/",
    "source": "hellenicshippingnews.com",
    "score": 67
  },
  {
    "id": 1771484444,
    "date": "2026-02-19",
    "title": "HJSC receives order for two 10,100 TEU scrubber-fitted container ships",
    "summary": "HJSC will build two 10,100-TEU container ships fitted with scrubbers, likely continuing the use of heavy fuel oil (HFO). Scrubbers do not reduce CO2 emissions, so the \"eco-friendly\" label is misleading. It remains to be seen if these ships can achieve a competitive CII rating and avoid FuelEU Maritime penalties.",
    "content": "HJ Shipbuilding & Construction (HJSC) has signed a contract with a European shipowner to build two 10,100-TEU eco-friendly container ships, with options for two more.\n\nThe vessels will be constructed at the company’s 90-year-old Yeongdo Shipyard, marking the first time the yard will produce container ships exceeding 10,000 TEU. As informed, the newbuilds feature advanced hull designs, optimized forms for maximum operational efficiency, and scrubber systems to meet International Maritime Organization (IMO) environmental standards.\n\nThe order is a milestone for Yeongdo Shipyard, which has steadily expanded its technical capabilities. In 2004, HJSC pioneered an innovative “DAM technique” to extend its 300-meter dock and build a 325-meter, 8,000-TEU vessel.\n\nThrough continuous innovation and engineering breakthroughs, we have overcome physical limitations and are now able to build container ships exceeding 10,000 TEU at Yeongdo Shipyard\n\n… said CEO Yoo Sang-cheol.",
    "source_url": "https://safety4sea.com/hjsc-receives-order-for-two-10100-teu-scrubber-fitted-container-ships/",
    "source": "safety4sea.com",
    "score": 51
  },
  {
    "id": 1771484429,
    "date": "2026-02-19",
    "title": "Halten Bulk orders wind-assisted bulk carriers",
    "summary": "Halten Bulk's new 7,100-tonne deadweight ships will likely reduce fuel consumption, but wind-assisted propulsion alone rarely achieves substantial carbon intensity improvements. The Baltic and North Sea are already subject to stringent sulphur emission controls, so the impact of these ships may be limited. We will monitor their carbon intensity to ensure compliance and report any FuelEU Maritime violations.",
    "content": "Norwegian shipping company Halten Bulk has placed an order for two 7,100 DWT self-dischargingbulk carriers equipped with rotor sails.\n\nA self-discharging bulk carrier is a bulk cargo vessel fitted with onboard conveyor and boom systems that unload cargo without shore-based equipment.\n\nThe ships will be built in China by Jiangsu SOHO Marine Heavy Industry, based on a design from Norwegian Ship Design Company.\n\nOnce delivered, they will operate along the Norwegian coast, as well as across the North Sea, the wider Nordic region and the Baltic.",
    "source_url": "https://www.hellenicshippingnews.com/halten-bulk-orders-wind-assisted-bulk-carriers/",
    "source": "hellenicshippingnews.com",
    "score": 11
  },
  {
    "id": 1771398011,
    "date": "2026-02-18",
    "title": "IMO Sub-Committee on Pollution Prevention and Response (PPR 13)",
    "summary": "IMO's PPR 13 discussed a legally binding framework to control ships' biofouling, aiming for a draft convention by 2029. Concerns remain over port reception facilities for high-viscosity cargoes as more products fall under special requirement 16.2.7. Proposals to improve cargo tank stripping will be discussed further, but position logging during tank washing discharge gained support.",
    "content": "The 13th session of the IMO’s Sub-Committee on Pollution Prevention and Response (PPR 13) was held in London from 9 to 13 February 2026. PPR commenced discussions on a legally binding framework on biofouling. PPR also agreed on amendments to requirements regarding NOx emissions certification for engines running on noncarbon fuels, P/V valves on new crude oil carriers, and the dewatering of oily bilge water.\n\nSafety and pollution hazards of chemicals and preparation of amendments to the IBC Code\n\nPPR agreed to assign special requirement 16.2.7 to twelve additional highviscosity or solidifying products and highlighted concerns over adequate port reception facilities as the amount of affected cargo increases. Two new tankcleaning additives were also approved.\n\nDevelopment of a legally binding framework for the control and management of ships’ biofouling\n\nPPR 13 commenced discussion of a legally binding framework for the control and management of ships’ biofouling to minimize the transfer of invasive aquatic species. PPR 13 agreed that a new convention would be most suitable way forward and recommended this approach for consideration at MEPC 86 in 2027. The aim is to finalize a draft legal framework by 2029 for consideration by MEPC 89.\n\nImproving the effectiveness of cargo tank stripping, tank washing operations and prewash procedures\n\nRegarding efforts to enhance the effectiveness of cargo tank stripping, tank washing operations and prewash procedures, there was broad support in principle for proposals for improving stripping operations. It was decided to continue the in-depth technical discussion at Evaluation of Safety and Pollution Hazards of Chemicals (ESPH) 32.\n\nFurthermore, there was support for including the ship’s position during the discharge of tank washings within the format of the Cargo Record Book (CRB) for vessels carrying noxious liquid substances in bulk. Member states and international organizations were invited to submit proposals for a new output on this matter to MEPC.\n\nAir pollution\n\nBlack carbon (BC)\n\nPPR 13 discussed the development of a polar fuel concept to reduce BC emissions in the Arctic. A polar fuel standard was identified as a possible initial measure, but it was also emphasized that fuel quality alone cannot mitigate BC formation and that there are overlaps with measures such as the Arctic HFO ban and sulphur limits in Emission Control Areas (ECAs). PPR 13 concluded by inviting member states and organizations to submit refined proposals to PPR 14 in 2027, taking into account the need for consistency with other MARPOL Annex VI requirements.\n\nDischarge water from Exhaust Gas Cleaning Systems (EGCSs)\n\nPPR 13 considered a proposal for the restriction of EGCS discharge within Particularly Sensitive Sea Areas (PSSAs). The SubCommittee concluded that, for any future PSSA designations, proposing member states should first undertake a risk assessment in accordance with the methodology set out in MEPC.1/Circ.899, and subsequently determine whether discharge restrictions are reasonable based on the assessment’s findings.\n\nReview and development of NOx emission requirements\n\nPPR 13 commenced its review of the NOx emission requirements under MARPOL Annex VI and the NOx Technical Code (NTC) 2008, structuring its work around engine test cycles, on-board verification methods, the Selective Catalytic Reduction (SCR) system operational status, and other related matters. PPR 13 acknowledged the need to address elevated NOx emissions at low engine loads, while noting divergent views on whether this should be achieved through modifications to test cycles and weighting factors or through alternative regulatory approaches. PPR 13 also examined options to enhance on-board NOx compliance verification, including the potential use of electronic diagnostic functionalities, though no preferred solution was identified. Intersessional work will be necessary across all major areas to develop coherent and technically sound regulatory proposals for consideration at PPR 14 in 2027.\n\nCertification of engines that operate on non-carbon-containing fuels\n\nPPR 13 agreed to proposed amendments to the NTC 2008 to enable the certification of engines operating on noncarbon fuels or fuel mixtures. The revisions include the introduction of hydrogen and oxygenbalance methodologies to complement the existing carbonbalance approach. The amendments are expected to be approved at MEPC 84, for subsequent adoption at MEPC 85 in November 2026 to facilitate timely certification of engines using fuels such as ammonia and hydrogen.\n\nSewage treatment and revision of MARPOL Annex IV\n\nPPR 13 progressed on the revision of MARPOL Annex IV, including developing draft amendments related to the Sewage Record Book (SRB), Sewage Management Plan (SMP) and associated guidance. Due to time constraints, PPR 13 could not finalize discussions on the Type Approval Guidelines and remaining Annex IV amendments. A Correspondence Group was established to continue this work, reporting to PPR 14 in 2027.\n\nRevision of guidelines and specifications for pollution prevention equipment for machinery space bilges\n\nPPR 13 considered updates to the Type Approval Guidelines for oily water separators, which aims to require alarms and automatic discharge stops if the sample water supply is lost, and to add more relevant test fluids to better match current ship fuels. A Correspondence Group was established and tasked with drafting revised guidelines for PPR 14 in 2027.\n\nReview of the IBTS guidelines and amendments to the IOPP certificate and Oil Record Book\n\nPPR 13 agreed on amendments to MARPOL Annex I, introducing a new Regulation 12B and revising the format of the IOPP certificate and the Oil Record Book (ORB). The new regulation introduces the Oily Bilge Water Service Tank, which is intended for the controlled dewatering of oily bilge water, including removal of water by forced evaporation. Regulation 12B will apply to ships above 400 GT fitted with an Integrated Bilge Water Treatment System (IBTS) installed on or after the entry into force date of the new regulation. For ships fitted with IBTS prior to the entry into force date, the regulation needs only to be applied as far as is reasonable and practicable. The amendments are expected to be approved by MEPC 84 in April and adopted by MEPC 85 in November.\n\nThe work on amending the IBTS guidelines – to better reflect the current arrangements and operational procedures, and guidance for the recording of operations in the Oil Record Book Part I (machinery space operations) – was concluded and agreed with a view to approval by MEPC in conjunction with the adoption of the draft amendments to MARPOL Annex I.\n\nMarine plastic litter\n\nStrategy and action plan on marine plastic litter\n\nThe IMO Strategy and Action Plan on marine plastic litter was updated, merging the existing strategy and the 2025 action plan into a single 2026 Strategy and Action Plan, subject to approval by MEPC 84.\n\nPlastic pellets\n\nAfter having considered different pathways for making mandatory measures to prevent environmental pollution from plastic pellets transported at sea, the preferred option was to consider developing a new mandatory code for plastic pellets, under MARPOL Annex III, SOLAS or both. PPR 13 recommended MEPC 84 to make a policy decision on the preferred mandatory instrument.\n\nMarking of fishing gear\n\nA draft MEPC circular was developed to promote the implementation of fishing gear marking systems and the Food and Agriculture Organization of the United Nations (FAO) Voluntary Guidelines on the Marking of Fishing Gear, subject to approval by MEPC 84.\n\nUnified Interpretations (UIs)\n\nPPR 13 agreed on three UIs for approval by MEPC 84 in April 2026.\n\nRegulation 16.9 of MARPOL Annex VI (incinerators)\n\nThe revised UI clarifies that batchloaded incinerators must be designed to reach 600°C in the actual combustion space within five minutes after startup, and this requirement is verified only during typeapproval testing. On-board monitoring of the fluegas outlet temperature is intended solely for safe operation and continuous compliance, not for verifying the design requirement.\n\nRegulation 13.2.3.2 of MARPOL Annex VI (NOx emissions)\n\nThe UI clarifies that for ships constructed on or after the specified dates and operating in the Norwegian Sea or NorthEast Atlantic NOx Emission Control Areas, the threedates criteria (building contract date, keellaying date or delivery date) must be used to determine “the time the ship was constructed” when determining the NOx Tier level required.\n\nRegulation 13.5.1.2 of MARPOL Annex VI (NOx emissions)\n\nThe revised UI clarifies that if an engine is installed on board and tested for its intended purpose more than six months after the applicable reference date in regulations 13.5.1.2 or 13.5.1.3, the actual on-board test date determines which NOx standards apply. If the engine cannot be tested within six months due to unforeseen circumstances beyond the shipowner’s control, the administration may apply the “unforeseen delay in delivery” provisions in a manner consistent with MARPOL Annex I, UI4.\n\nParagraph 7.1.5.4 of the IBC Code (inhibitors)\n\nRather than making a UI for paragraph 7.1.5.4 of the IBC Code, it was determined that amending the text of the IBC Code would be the most suitable approach to address temperature monitoring issues related to products requiring additional inhibitors. The amendments to the IBC Code will be prepared by ESPH 32 for consideration by PPR 14 in 2027.\n\nAny other business\n\nManagement of ammonia effluent from ships using ammonia as fuel\n\nPPR 13 considered four documents addressing the handling of ammonia effluent from ammonia-fuelled ships. The need to properly manage ammonia effluents to safeguard environmental integrity was recognized. However, due to limited available data, further policy discussions were considered premature at this stage. PPR 13 therefore invited additional proposals for PPR 14 in 2027.\n\nRequirement for new tankers carrying crude oil to be fitted with P/V valves\n\nAs a measure to reduce emissions of Volatile Organic Compounds (VOCs), it was agreed to amend Regulation 15 of MARPOL Annex VI to require tankers carrying crude oil to be fitted with P/V valves having a minimum opening pressure of 0.20 bar. This requirement will only apply to crude oil tankers constructed on or after the entry into force date of the amendments. The amendments are expected to be approved by MEPC 84 in April and adopted by MEPC 85 in November.\n\nRecommendations\n\nAs PPR is a Sub-Committee, all decisions concerning rules, regulations and dates are subject to further consideration and approval by the Marine Environment Protection Committee (MEPC).",
    "source_url": "https://www.hellenicshippingnews.com/imo-sub-committee-on-pollution-prevention-and-response-ppr-13/",
    "source": "hellenicshippingnews.com",
    "score": 174
  },
  {
    "id": 1771398038,
    "date": "2026-02-18",
    "title": "PPR 13: The Quiet IMO Meeting That Could Change How Ships Are Actually Run",
    "summary": "IMO's PPR 13 indicates a shift towards measuring environmental performance by actual vessel operation, not just fuel type. Increased scrutiny of biofouling management will likely force operators to demonstrate measurable hull performance. Expect more frequent inspections and hull performance data integrated into compliance reporting, impacting maintenance decisions.",
    "content": "The latest gathering of the Pollution Prevention and Response Sub-Committee at the International Maritime Organization in London did not produce dramatic headlines or sweeping new regulations, yet for those running ships day-to-day it may prove one of the most consequential technical meetings in recent years.\n\nBy Paul Morgan (gCaptain) – Beneath the procedural language and incremental drafting work, PPR 13 signaled a clear shift in how environmental performance will be measured, not just by fuel type or installed equipment, but by the way vessels are actually operated across their entire lifecycle.\n\nIndustry groups such as the World Shipping Council were heavily engaged in discussions ranging from biofouling and Arctic emissions to scrubber discharges and low-load engine certification. The themes were familiar, but the direction of travel was different. Rather than simply tightening emissions limits, IMO is increasingly examining the operational realities that chief engineers and superintendents deal with every day, hull condition, partial engine loads, hybrid power arrangements and end-of-life recycling obligations.\n\nOne of the most telling developments was the renewed focus on biofouling management. For years, hull cleanliness has been framed primarily as an invasive species issue, yet the debate at PPR reflects a growing recognition that biofouling is fundamentally an efficiency and emissions problem. As regulators push for science-based controls, the subtext is clear: operators may soon face expectations not just to carry a biofouling plan but to demonstrate measurable performance.\n\nThat could translate into more frequent inspections of niche areas such as sea chests and thrusters, and potentially a future where hull performance data sits alongside fuel consumption metrics in compliance reporting. For engineers, this reinforces an uncomfortable reality, maintenance decisions once driven purely by cost and scheduling may increasingly be scrutinised through an environmental lens.\n\nThe Arctic black carbon discussions reveal a similar evolution. While there is not yet a formal polar fuel standard, the direction of policy suggests increasing pressure to move away from high-soot fuels in sensitive regions. The IMO has already edged toward restrictions on heavy fuel oil in Arctic waters, and PPR’s work on measurement methodologies hints at more granular controls in the future. From an operational perspective, the implications are significant. Fuel choice in polar routes may become less about compliance with sulphur caps and more about particulate performance and combustion quality. For shipowners, the cost equation could shift once again, favouring cleaner distillates or alternative fuels despite higher price tags.\n\nPerhaps the most contentious issue remains exhaust gas cleaning system discharge water. Scrubbers were once presented as a relatively straightforward compliance solution, yet the ongoing review at PPR highlights the growing regulatory discomfort around wash-water impacts in sensitive environments. Industry voices continue to call for globally consistent, science-based standards rather than a patchwork of regional bans, but the trajectory is unmistakable: the operational flexibility of open-loop systems may narrow over time. Engineers who have relied on scrubbers as a long-term fuel strategy must now plan for scenarios where switching to compliant fuels near shore or upgrading to hybrid systems becomes unavoidable. The real challenge is not technical feasibility but the uncertainty surrounding future enforcement, which complicates investment decisions today.\n\nEqually revealing is the renewed scrutiny of NOx certification, particularly in relation to low-load operations. Modern shipping rarely mirrors the steady-state engine cycles used during certification tests. Slow steaming, dynamic positioning, hybrid propulsion and alternative fuels have all reshaped how engines are run, yet regulatory frameworks have struggled to keep pace. The discussions at PPR suggest that IMO is finally acknowledging this gap.\n\nIf certification processes evolve to reflect real-world operating profiles, it could change how engines are tuned, monitored and maintained. For chief engineers, this is more than a bureaucratic adjustment; it touches directly on daily operational choices, from load management strategies to maintenance planning aimed at avoiding liner glazing or combustion instability at low outputs.\n\nShip recycling, another agenda item that might appear distant from daily operations, is also moving into sharper focus as the industry prepares for stricter implementation of environmentally sound dismantling standards. The emphasis on hazardous material inventories and pollution prevention throughout a vessel’s life cycle indicates a broader shift toward cradle-to-grave environmental accountability. Owners may find that decisions made during construction or retrofits, coatings, insulation materials, even equipment selections, carry regulatory consequences decades later when the vessel reaches the yard.\n\nTaken together, the themes emerging from PPR 13 reveal a subtle but important transformation in IMO thinking. Environmental regulation is no longer centred solely on emissions limits or fuel sulphur content; it is increasingly about operational behaviour and lifecycle performance. That means compliance will depend less on installing a single piece of equipment and more on how effectively ships are managed over time. Data monitoring, maintenance discipline and operational flexibility are becoming as critical as hardware solutions.\n\nFor shipowners, the message is clear: the era of simple compliance checklists is fading. Future regulations are likely to reward vessels that can demonstrate consistent performance, clean hulls, optimised engine loads, responsible recycling practices, rather than those relying solely on technological add-ons. For chief engineers, the implications are equally profound. The engine room is no longer just a place where emissions limits are met; it is becoming a central arena where environmental performance is proven through daily operational decisions.\n\nPPR meetings rarely capture headlines in the way that high-level climate negotiations do, yet the technical groundwork laid in London this week may shape the next generation of IMO rules. The shift underway is subtle but unmistakable: environmental compliance is moving from static standards to dynamic performance. For an industry already navigating alternative fuels, carbon pricing and efficiency mandates, that evolution will demand a new level of operational awareness, and perhaps a redefinition of what it means to run an environmentally responsible ship.",
    "source_url": "https://gcaptain.com/ppr-13-the-quiet-imo-meeting-that-could-change-how-ships-are-actually-run/",
    "source": "gcaptain.com",
    "score": 100
  },
  {
    "id": 1771398021,
    "date": "2026-02-18",
    "title": "Brazil’s ABIOVE challenges EU soy biofuel phase-out methodology, calls for revision",
    "summary": "ABIOVE disputes the EU's assessment that Brazilian soy biofuel causes high indirect land-use change (ILUC). ABIOVE claims the EU methodology overestimates deforestation linked to soy, placing it unfairly in a high-ILUC risk category and jeopardizing its future use in EU renewable targets. This challenge could weaken the EU's efforts to reduce deforestation-linked emissions and maintain FuelEU Maritime's carbon intensity targets.",
    "content": "The Brazilian Association of Vegetable Oil Industries (ABIOVE) has pushed back against the European Commission’s proposal to phase out soybean-based biofuels by 2030, arguing that the underlying Indirect Land-Use Change (ILUC) analysis overstates soybean’s deforestation footprint.\n\nIn a note published on LinkedIn on Feb. 16 , ABIOVE said the data used in the commission’s draft contains methodological flaws that unfairly classify soybean as a “high ILUC-risk” feedstock.\n\nThe European Commission on Jan. 21 released a draft regulation setting a linear phase-out of high ILUC-risk biofuels from 2024 to 2030, effectively eliminating soybean- and palm-based fuels from counting toward EU renewable energy targets by the end of the decade.\n\nDispute over deforestation share\n\nAt the center of the dispute is the commission’s updated assessment, prepared by Guidehouse, which found that 14.1% of global soybean expansion between 2014 and 2021 occurred on high-carbon-stock land, placing soybean above the 1% expansion and 100,000-hectare threshold used to determine high ILUC risk.\n\nABIOVE said its own analysis, based on Brazil’s MapBiomas dataset and alternative mapping by Serasa Experian, shows a significantly lower share of soybean expansion over forested areas.\n\nUsing land-use transitions strictly within the 2014–2021 period, ABIOVE estimates soybean expansion over forest in Brazil at 3.6%-5.5%, well below the commission’s figure. Even when applying a methodology closer to Guidehouse’s — which overlays 2014–2021 soybean expansion with deforestation dating back to 2008 — the Brazilian group calculated a 10.4% share before adjusting for productivity factors.\n\nThe association argues that the Guidehouse approach inflates results by combining a longer deforestation reference period with a shorter expansion period, effectively tripling the area attributed to soybean.\n\nProductivity factor under scrutiny\n\nABIOVE also challenged the soybean “productivity factor” (PF) used in the ILUC formula, which Guidehouse set at 1.0. The PF influences the final classification of feedstocks under the Renewable Energy Directive framework.\n\nThe group said Brazil’s widespread soybean–maize multi-cropping system increases the effective energy yield per hectare and should result in a PF of 1.2 to 1.3, rather than 1.0. Applying a PF of 1.3 would reduce soybeans’ calculated share of expansion over high-carbon-stock land to 7.9%, according to ABIOVE’s recalculation.\n\nWhen using only 2014–2021 land-use data and the higher PF, the group said soybeans’ adjusted share could fall as low as 2.8%, placing it in a low-risk category under the directive’s formula.\n\nMarket implications\n\nThe commission’s draft regulation is open for public feedback until Feb. 18 and, if adopted, would gradually reduce the maximum contribution of high ILUC-risk biofuels to 0% by 2030.\n\nABIOVE warned that the Renewable Energy Directive’s objectives to curb deforestation-linked imports must rely on “the best available sources and maps” to avoid distorting market flows and unfairly penalizing specific commodities.\n\nThe association called on the commission and Guidehouse to revise the data and methodology before finalizing the delegated act, saying that while RED is a necessary regulation, inaccurate risk classification could have far-reaching consequences for biofuel markets and EU–Mercosur trade dynamics.\n\nAudit irregularities\n\nAn audit carried out by Brazil’s federal audit office, TCU, and published on Jan. 28 showed that 60% of the soybeans used in biodiesel production have irregularities in their anti-deforestation certification under the national biofuels policy, RenovaBio.\n\nThe analysis showed that only 40% of biodiesel produced by soybean plants certified under the CBIO decarbonizationcredits market can be verified — through satisfactory certification — to be sourced without any deforestation. In comparison, 70% of cornbased ethanol and 85% of sugarcane ethanol meet the same deforestationfree standard.\n\nIn response to the TCU report, the Brazilian Association of Vegetable Oil Industries, or Abiove, told Platts, part of S&P Global Energy, on Feb. 3 that it is monitoring the audit developments, and reaffirmed that the RenovaBio program applies strict sustainability criteria, including the Brazilian Forest Code’s “most restrictive compliance standard.”\n\nIn a written statement, the association said these criteria “guarantee that the program delivers the expected environmental benefit at the lowest economic cost to society, preserving the competitiveness of the Brazilian energy matrix.”\n\nPlatts assessed the FOB Paranagua soybean oil price for March loading down $10.14/metric ton day over day, while the March basis was unchanged at minus 450 points to CBOT H futures, reflecting the absence of new business rather than any deterioration in fundamentals. For April loading, the FOB price declined $3.09/mt, and the basis weakened by 30 points to minus 690 points to CBOT May (K) futures.",
    "source_url": "https://www.hellenicshippingnews.com/brazils-abiove-challenges-eu-soy-biofuel-phase-out-methodology-calls-for-revision/",
    "source": "hellenicshippingnews.com",
    "score": 85
  },
  {
    "id": 1771398029,
    "date": "2026-02-18",
    "title": "False flags are an evolution of the business model",
    "summary": "Flags of Convenience enable shipowners to evade regulations, undermining maritime security and seafarer rights. The FOC system allows registration in states with minimal oversight, contravening international law. This lack of genuine connection between shipowners and flags exacerbates issues like seafarer abandonment and environmental risks.",
    "content": "David Heindel from the International Transport Workers’ Federation on the dangers lurking behind the maritime industry’s use of flags of convenience.\n\nRecent reporting on false flags and the rise of shadow fleets has rightly raised alarms about maritime security, sanctions enforcement, environmental safety – and, too often as a secondary concern, seafarers rights. But much of the analysis still stops short of naming the enabling root cause.\n\nIn reality, these developments are the predictable outcome of what the ITF named as the flag of convenience (FOC) system more than 75 years ago – a business model deliberately designed to obscure ownership, fragment jurisdiction, and weaken enforcement with direct and devastating consequences for seafarers, for maritime security, and for the rule of law at sea.\n\nMuch of the current coverage describes the symptoms but avoids the diagnosis. False flags – the practice of flying fake flags disowned by the given registry – are not mere anomalies. They are, fundamentally, a natural outcome of the FOC system.\n\nUnder the FOC model, shipowners can register vessels in states with no meaningful genuine link to ownership, management, or operation – in direct contravention of international law under the UN Convention on the Law of the Sea. In exchange for registration fees, those flag states offer minimal scrutiny and weak enforcement, effectively selling enforcement-free sovereignty.\n\nAs Mark Dickinson, general secretary of UK maritime union, Nautilus, explained to the BBC, when it comes to spiralling seafarer abandonment, including on shadow fleet ships, FOC states have demonstrated, “a complete derogation of responsibility” towards their fleets and the crews who sail on them”. He then rightly outlined the demand, in line with international law, for there to always be “a genuine link between shipowners and the flags under which they sail”.\n\nThe jurisdictional ambiguity that allows ships to shift identities, manipulate registries, or operate without effective oversight is not accidental. It is built into the business model.\n\nThis is why false flags and shadow fleets have continued to proliferate despite increased sanctions, surveillance, and massively increased media and political attention. Industry profits from opacity. Flag states – in the case of the worst offenders, with flags often outsourced to unscrupulous overseas business interests – profit from regulatory leniency. Together, they create exactly the conditions in which fraudulent registries, identity switching, and impunity thrive.\n\nAnd the same governance failures driving false flags also produce severe human consequences.\n\nLast month, the International Transport Workers’ Federation released new data showing that 2025 was the worst year on record for seafarer abandonment. More than 6,200 seafarers were abandoned across 410 ships, a 32% increase on the previous year and the sixth consecutive year of rising cases.\n\nWhen ownership is hidden and flag state responsibility is diluted, seafarers are left exposed to a perfect storm of profit driven abuse. Abandonment, unpaid wages, unsafe vessels, denial of shore leave, and the absence of legal protection are not incidental outcomes. They are direct consequences of a system designed to enable the evasion of responsibility.\n\nThe same dynamics were laid bare during the global crew change crisis, when hundreds of thousands of seafarers were trapped on board for months beyond their contracts. Once again, fragmented jurisdiction and weak flag-state responsibility allowed governments and shipowners to deflect accountability, leaving workers stranded.\n\nThese are not abstract failures. They are human crises: crews stuck on rusting ships running out of food, isolated from their families, unpaid or underpaid, and far from home, with no authority willing or able to intervene because ownership has vanished behind layers of opaque registration and flag state evasion.\n\nBut the risks extend well beyond labour. The FOC system undermines maritime security, environmental protection, and the rule of law itself – risks that policymakers can no longer afford to treat as peripheral or theoretical.\n\nIf governments are serious about tackling false flags and shadow fleets, they must move beyond reactive enforcement and confront the structure that enables abuse – and government investigations into FOCs, as currently underway in the US, are a necessary and welcome first step.\n\nUltimately, this means enforcing the long-ignored principle of a genuine link between a vessel’s flag and its beneficial owners, operators, and managers. It means mandatory beneficial ownership transparency as a condition of registration and operation. It means holding flag states accountable when they repeatedly fail to meet their legal responsibilities.\n\nFalse flags, shadow fleets, and abandonment are not separate problems. They are interconnected outcomes of a failing system abandoned by decades of government inaction.\n\nHistory provides a clear warning: when countries retreat from national flags and cabotage, enforcement fractures as opacity becomes the norm. And the shadows become used to hide all manner of illegality and criminality, not least abuses of seafarers’ rights.\n\nWe saw this in the decades following World War II as the costs savings of FOCs led to its alternative structure shifting from being the exception to becoming the norm. And without challenging false flags as the central enabler of the shadow fleet via its near-zero accountability and structurally lower costs, we risk this super-charged false flagging system becoming even more commonplace: evasion will become the dominant business model with compliance a commercial liability.\n\nWe must rebuild and defend national-flag shipping and cabotage laws to bring all maritime trade back into the open, where there is no hiding place for shadow fleets, and no means to side-step accountability, national security, safety, and fair competition.",
    "source_url": "https://splash247.com/false-flags-are-an-evolution-of-the-business-model/",
    "source": "splash247.com",
    "score": 63
  },
  {
    "id": 1771398024,
    "date": "2026-02-18",
    "title": "LR approval clears path for cubic LNG tank design for LNG-fuelled vessels",
    "summary": "GTT's CUBIQ tank design receives LR approval, promising increased cargo space on LNG-fueled vessels. The cubic design streamlines construction, but LNG's methane slip remains a climate concern. Will this efficiency gain offset the environmental impact of continued reliance on fossil fuels?",
    "content": "Lloyd’s Register (LR) has issued an approval in principle (AiP) for GTT’s CUBIQ™ LNG fuel containment system. This cubic tank design aims to streamline project engineering and planning, simplify shipyard construction processes and free up more cargo space on LNG-fuelled vessels.\n\nGTT CUBIQ™ brings a new approach to LNG containment by extending its suitability to various types of LNG-fuelled ships, including container and passenger ships. Its near-cubic geometry eliminates traditional upper and lower chambers, enabling standardised engineering and simplifying construction. With fewer complex corner areas, installation is faster, helping shipyards reduce build time. Once in service, GTT CUBIQ™ provides strong volumetric efficiency, maximising usable space and unlocking additional cargo capacity.\n\nThe approval also verified the ability of GTT CUBIQ to operate under 1 barg design pressure, a feature that would support cold ironing regulation compliance. Pressure build-up capability for membrane tanks is being evaluated for GTT Mark III Technology conventional designs for the use of LNG as fuel and is becoming a key consideration for LNG-fuelled newbuilds.\n\nLR’s role was to provide early-stage assurance that new designs meet rule requirements and are supported by appropriate risk assessment through construction and operation.\n\nConstantinos Chaelis, LR’s Global Gas Segment Director, said: “As the use of LNG as fuel grows at a considerable pace, expanding beyond gas carriers, it is critical that novel containment designs are assessed against robust rule requirements.\n\n“This approval in principle supports the safe development of an innovative containment system that can be applied across a wider range of ship types.”\n\nFrançois Michel, CEO of GTT, said: “The AiP from Lloyd’s Register is a strong endorsement of our GTT CUBIQ™ technology and confirms the robustness of its design.\n\n“This innovation responds directly to shipyards and ship-owners’ expectations by simplifying the integration of membrane containment systems for LNG tanks, optimising space on the vessels, and thereby supporting the growing adoption of LNG as a marine fuel.”",
    "source_url": "https://www.hellenicshippingnews.com/lr-approval-clears-path-for-cubic-lng-tank-design-for-lng-fuelled-vessels/",
    "source": "hellenicshippingnews.com",
    "score": 56
  },
  {
    "id": 1771398034,
    "date": "2026-02-18",
    "title": "Seanergy adds two bulkers to newbuild slate",
    "summary": "US-listed Greek owner Seanergy Maritime has expanded its newbuilding programme, signing for two additional capesize-class vessels at Chinese yards and lifting its total investment in new tonnage to ab...",
    "content": "US-listed Greek owner Seanergy Maritime has expanded its newbuilding programme, signing for two additional capesize-class vessels at Chinese yards and lifting its total investment in new tonnage to about $226m.\n\nThe Stamatis Tsantanis-led company, which placed its first-ever newbuilding order in October, has now lined up three large scrubber-fitted bulkers for delivery between 2027 and 2028.\n\nIn January, Seanergy contracted a 181,500 dwt newbuild at Hengli Shipbuilding in Dalian – a sister ship to the unit ordered last year at the same yard. The price is about $75.2m, with delivery scheduled for the third quarter of 2027.\n\nThe company also revealed a deal for a 211,000 dwt scrubber-fitted newcastlemax at Jiangsu Hantong Ship Heavy Industry Co for around $75.8m. Delivery is expected in the second quarter of 2028.\n\nSeanergy said that all three vessels will feature modern, fuel-efficient designs aimed at cutting emissions and improving consumption, in line with the company’s fleet renewal and decarbonisation plans.\n\nAlongside the ordering spree, Seanergy has agreed to dispose of the 2010-built Dukeship through an 18-month bareboat charter to spinoff United Maritime. United has advanced a $5.5m downpayment and will pay $9,450 per day, with a purchase obligation of $22.1m at the end of the charter period.\n\nChief executive Tsantanis said the expanded programme secures early delivery positions in what he sees as a supportive capesize market – pointing to firm iron ore and bauxite trades, limited newbuilding supply in the segment and favourable ton-mile trends heading into 2026.",
    "source_url": "https://splash247.com/seanergy-adds-two-bulkers-to-newbuild-slate/",
    "source": "splash247.com",
    "score": 39
  },
  {
    "id": 1771311610,
    "date": "2026-02-17",
    "title": "Maress 2.0: Data-driven Decarbonization Steering Towards New Performance Heights",
    "summary": "VPS's Maress software claims to have saved 300+ vessels 12,000 tonnes of CO2 during a summer campaign. We remain skeptical of self-reported data without independent verification of actual fuel consumption. Has Maress addressed the fundamental issue of excessive heavy fuel oil (HFO) usage?",
    "content": "Maritime decarbonization legislation and directives continue to increase and diversify. This places elevated demands upon shipowners and operators to provide meaningful, transparent and traceable data to legislative bodies, in order to substantiate their hopefully decreasing carbon-footprint and increasing compliance performance.\n\nSince its launch in 2016, the VPS Maress software application has led the drive to assist in the decarbonization of the offshore shipping market. This cloud-based system, where no hardware installation is required, seamlessly connects with leading providers of data collection and ship-to-shore technologies. The aim is to significantly reduce fuel and energy consumption, offering environmental, financial, and strategic benefits to its users, delivering tangible business value through its functionality and insights.\n\nWith more than 700 offshore vessels currently utilizing Maress to reduce their fuel consumption, emissions and costs, via the proven energy efficiency solutions Maress provides, has seen this software application go from strength to strength.\n\nThe proof of the impact Maress can provide, has been seen through three successive Annual Summer Campaigns 2023-25, where VPS invited numerous offshore shipping companies and their vessels to participate in a three-month programme (June-August), each year. With each vessel using Maress, the campaign is a competition to see how much carbon dioxide emissions could be reduced per vessel and as a collective fleet, utilizing the tools Maress provides.\n\nThe results have been very impressive: 2025 – 300+ vessels from 12 leading shipping companies saved approximately 12,000mt of carbon dioxide emissions. On average the participating vessels improved their efficiency by more than 10%. That kind of progress doesn’t happen by chance – it is the result of practice, dedication and crews continuously refining how they operate. Post-campaign, VPS highlighted the vessel, Volantis, a CSV operated by Havila Subsea & Renewables, and its dedicated crew. Throughout the campaign Volantis spent ~75 % of her days in DP or Transit, modes that account for >85 % of total fuel use. Yet the crew still delivered significant savings through relentless, real time optimization. The Master of the Volantis stated, “We’re always chasing the next increment. There’s a continuous dialogue between bridge, engine room, charterer and shore management on how to do better. During transits we agree an economical speed window with the client, then run only the engines and thrusters we need – each kept in its sweet spot load range.”\n\n2024 – 303 vessels from 12 leading shipping companies saved over 7,000 mt of carbon dioxide emissions. Back in 2024, REM HSEQ Manager Iliyan Aleksandrov commented: “REM has committed to optimising the energy consumption of our operations and being an active player in the ongoing transition to a more sustainable maritime industry. We achieved our ISO 50001 certification this year, and amongst other initiatives, we were excited to extend our working relationship with VPS Decarbonisation on this campaign. Crew dedication, strong focus on energy efficiency and consumption optimization, combined with VPS´ decarb advisory service and Maress software were the key factors in achieving the amazing results”.\n\n2023 – 133 vessels from 8 leading shipping companies saved 10,000mt of carbon dioxide emissions. Back in 2023, Solstad Offshore’s Chief Sustainability Officer, Tor Inge Dale concluded: “We strive to stay in the forefront of the industry’s change towards more sustainable operations, and we firmly believe in collaboration in combination with powerful digital tools such as Maress to facilitate just the kind of benchmarking to make this happen. We´ll be ready for the next campaign, and hopefully with friendly competition against even more vessels and companies wanting to be part of the change”.\n\nMaress has and continues to evolve, to lessen the workload on ship operators, when it comes to monitoring, verifying and reporting, vessel performance and efficiency, plus providing actionable insights at every level, from fleet-wide trends to the performance of individual vessel operations.\n\nAnd now, the evolution continues through the recently launched Maress 2.0. This enhanced and advanced version, allows users to instantly compare vessels, or track a single vessel’s progress over time, helping to identify opportunities for efficiency and cost savings. Integrated data validation and smart notifications support in ensuring the vessel data remains trustworthy, so operators and their crew can respond to issues before they impact operations or compliance.\n\nExisting users of Maress will have peace-of-mind as they see that the new Maress works seamlessly alongside their existing version, allowing the continuation of all previous functionalities. All the key features from legacy Maress have been transferred and enhanced within the new Maress 2.0 platform, with the addition of new key features.\n\nKey Highlights of Maress 2.0:\n\nImproved analytics and reporting with great flexibility on time periods\n\nWeather information per day in-map provides more insights\n\nUnderstand the effect of your initiatives by baseline comparison year on year\n\nSupport for alternative fuels such as Biofuels\n\nUseful voyage replay with weather, activities and efficiency meters\n\nEnhance your data quality with the new Data QA and Validation module\n\nOptimize your energy utilization with advanced Energy Analytics\n\nFuture-proof technology and adaptive user interface\n\nIn terms of benchmarking a fleet’s performance against historical baselines or any custom data range, Maress Fleet alows comparison of any period in order to identify trends and measure the impact of operational changes.\n\nUsers can visualize, time spent vs fuel spent, to understand where their fleet operates most efficiently and where optimization opportunities exist.\n\nThe software now includes a new “Add to Export” button available on every front-end component. With this feature, users can easily select any data view—such as tables, metrics, and charts—and include them in a customized export. Once components are added, the PDF Exporter provides a live preview where users can drag and drop to rearrange the order, remove items, and organize the layout exactly how they want.\n\nThis gives users full control over what gets exported and how it appears in the final PDF report, making it easier to create polished, presentation-ready documents in just a few clicks.\n\nMaress 2.0 now has a powerful comparison tool, Maress Vessel Compare, that analyzes more than 10 key performance KPIs across offshore vessels—making it easier than ever to see which vessel performs best. Multiple vessels can be compared side by side at the same time, giving a clear and fair overview.\n\nThe vessel comparison also includes a spider chart overlay, which visually compares performance across all vessels at a glance.\n\nThis allows users to easily measure how vessels perform against each other—either across their historical performance or within specific projects.\n\nIt’s especially useful for analyzing sister vessels, helping to quickly spot strengths, weaknesses, and operational differences.\n\nVia Maress Vessel, the software now allows greater insights into the performance of single vessels, where its possible to playback all activities and investigate performance down to individual reported event level. For example, did a vessel overconsume on a specific day? Check the weather symbol for a possible explanation and deeper operational context.\n\nUsers can now easily identify when, where, and why poor fuel performance occurs—at any point in time.\n\nSpider charts compare a vessel’s current performance against its own historical baseline as well as the average of similar vessel types, giving clear context on where the vessel is excelling or needs improvement.\n\nThe new Maress 2.0 now offers a data quality and validation module. This not only alerts to potential data issues, but also explains what’s wrong, so users can take quick and informed action. This can be continuously used either onboard or ashore to secure the data quality. Personalized notifications empower the crew to address issues proactively; reducing the risk of compliance breaches and ensuring company KPIs and regulatory reports (DCS/MRV) are reliable.\n\nTrustworthy insights start with trustworthy data.\n\nMaress 2.0 offers an add-on-module, Maress Energy Analytics which includes an Energy Flow Diagram which gives a clear, visual overview of how fuel energy is used across the vessel. Instead of just seeing fuel consumption numbers, its now possible to see where the energy is transmitted and how efficiently it is converted into usable power.\n\nWhy this matters:\n\n✅ Identify inefficiencies in the energy chain\n\n✅ Understand exactly how fuel is being used on board\n\n✅ Optimize operations such as generator setup and reduce unnecessary consumption\n\n✅ Make data-driven decisions to improve performance and cost savings\n\nThis feature turns complex data into actionable insight, helping to spot energy losses, improve efficiency, and ultimately lower operational costs.\n\nThe new Power Output Graph provides a complete, real-time view of how vessel’s engines, propulsion, and thrusters perform in relation to its speed and operational mode. With this interactive visualization, one can see exactly how power is generated and consumed across different systems, helping to understand performance patterns, spot inefficiencies, and make informed operational decisions.\n\nWhy this matters:\n\n✅ Monitor how efficiently power is converted into vessel movement\n\n✅ Identify energy-intensive operations and optimize accordingly\n\n✅ Compare modes (DP, Transit, Standby, etc.) to improve efficiency and planning\n\n✅ Customize your view to focus on the data that matters most\n\nDesigned to connect the offshore ecosystem, Maress 2.0 now gives owners, managers, operators and charterers, clear visibility from fleet trends to thruster level detail, providing actionable insights that improve, efficiency, compliance and cost savings.\n\nMaress 2.0 is already receiving very positive feedback:\n\n“The new Maress 2.0 by VPS Decarbonisation has been really impressive so far. The user interface with more liquid design is working very well, and the added functionality on exporting specific graphs to pdf are more than welcome. The Analytics-module enables us to dig more into the high-resolution data and to provide detailed knowledge on the operation and setup of vessels in different modes. We are also using the MRV-module for the 2025 EU MRV-reporting, and the Cargo & Bunker input function are working very well for the users onboard the vessels.\n\nWith the new NOx-module also integrated in Maress, we see a more professional and complete one-stop-shop for integrated fuel monitoring and reporting.",
    "source_url": "https://www.hellenicshippingnews.com/maress-2-0-data-driven-decarbonization-steering-towards-new-performance-heights/",
    "source": "hellenicshippingnews.com",
    "score": 200
  },
  {
    "id": 1771311616,
    "date": "2026-02-17",
    "title": "Fragmented Carbon Schemes Threaten Maritime Progress, Warns BAR Technologies",
    "summary": "BAR Technologies bemoans the growing complexity of emissions compliance due to overlapping regional schemes like EU ETS and FuelEU Maritime. This fragmentation inflates costs and distracts from real decarbonisation investments. The Carbon Border Adjustment Mechanism (CBAM) further complicates matters by pricing embedded emissions in seaborne cargoes.",
    "content": "BAR Technologies is urging immediate action toward a unified global carbon framework, warning that the proliferation of regional emissions trading schemes is placing unprecedented compliance pressure on the maritime sector and risks delaying progress on decarbonisation.\n\nWith multiple overlapping schemes now in effect or emerging, including the EU ETS, FuelEU Maritime, the IMO’s postponed Net-Zero Framework, and proposed Greenhouse gas Fuel Intensity (GFI) measures, shipowners are increasingly navigating a maze of conflicting obligations. According to the International Carbon Action Partnership (ICAP), over 30 emissions trading systems are now either in force or under development worldwide. This pattern of fragmentation reflects a broader global challenge: recent research from the Grantham Research Institute at the London School of Economics identified over 900 climate adaptation laws and policies adopted across 35 countries since the Paris Agreement. While this surge signals growing ambition, it also highlights the risks of uncoordinated frameworks that lead to implementation gaps, increased costs and regulatory friction across borders.\n\n“Carbon compliance is becoming more fragmented by the month,” said John Cooper, CEO of BAR Technologies. “Instead of building momentum behind a single global framework, we’re creating a patchwork of schemes with different baselines, rules and cost mechanisms. That creates confusion, inflates costs, and weakens the industry’s ability to invest in real, scalable solutions.”\n\nThe situation is further complicated by mechanisms such as the EU’s Carbon Border Adjustment Mechanism (CBAM), which went live on 1 January 2026. While not directly taxing shipping emissions, CBAM introduces indirect carbon costs into the trade system by pricing the embedded emissions of goods such as steel, aluminium, cement, and fertilisers, all of which are major seaborne cargoes.\n\n“CBAM is an example of how carbon pricing is now embedded into trade,” Cooper noted. “But it’s also a reminder that without multilateral alignment, we risk policy friction and commercial uncertainty on a global scale.”\n\nTo avoid paralysis through bureaucracy, BAR Technologies is calling for a single carbon policy, one that is globally agreed, fairly administered and financially transparent. The company continues to advocate for a bunker-level collection mechanism to fund climate-positive reinvestment, while avoiding the duplication and complexity of overlapping schemes.\n\n“While we await consensus on a unified framework, we cannot afford inaction,” Cooper continued. “We need technologies that work today, across regulatory zones and wind propulsion is leading that charge.”\n\nBAR Technologies’ WindWings®, already deployed on multiple vessels, offer immediate fuel savings and emissions reductions. Beyond near-term impact, they enhance the viability of alternative fuels like methanol and ammonia by reducing overall fuel demand.\n\n“Wind doesn’t need permission,” said Lauren Eatwell, Head of WindWings® at BAR Technologies. “It’s scalable, proven, and will be around forever. The industry has an opportunity to act now and lead, not wait to be regulated into action.”",
    "source_url": "https://www.hellenicshippingnews.com/fragmented-carbon-schemes-threaten-maritime-progress-warns-bar-technologies-2/",
    "source": "hellenicshippingnews.com",
    "score": 153
  },
  {
    "id": 1771311640,
    "date": "2026-02-17",
    "title": "Performance Shipping",
    "summary": "Performance Shipping claims to prioritize environmental performance, but offers no specifics on reducing carbon intensity. Their commitment to \"traditional shipping values\" raises concerns about continued heavy fuel oil (HFO) usage. With FuelEU Maritime on the horizon, dirtiestships.com will monitor their fleet's compliance and potential fines.",
    "content": "Shipping is a rapidly changing industry, and to succeed in it, Performance Shipping focuses on three key priorities – consistency, integrity, and long-term value. These are the values that are reflected in the company’s name, and this is what Performance Shipping strives for every day, in every vessel and across all of its operations.\n\n“Performance across every voyage, every decision, and every relationship,” says Andreas Michalopoulos, CEO of Performance Shipping Inc. “At Performance Shipping, ‘performance’ is more than just a name, it’s a mindset.”\n\nPerformance Shipping Inc. is a ship-owning company that operates its own fleet of modern, high-quality tanker vessels. At the time of writing, its fleet includes twelve tankers, ten of which are currently operating on the water, as well as two newbuild tanker vessels scheduled to be delivered in early 2026 and early 2027.\n\nTraditional but Forward-Looking\n\nEvery aspect of the company’s work reflects a commitment to safe, efficient operations, supported by a team of experienced maritime professionals both at sea and ashore. Michalopoulos has led the company since 2020, a period of growth, modernisation, regulatory transformation, and strategic fleet renewal. Michalopoulos has also overseen a company-wide strategic process that has strengthened the company’s position as a reliable and transparent player in the global tanker sector.\n\n“Our approach combines traditional shipping values, safety, reliability, and professionalism, with a forward-looking mindset that embraces technology, environmental performance, and continuous improvement,” Michalopoulos tells us. “We maintain a modern, environmentally efficient fleet while operating with a streamlined structure that allows for quick and well-informed decision-making.”\n\nPerformance Shipping combines this flexibility with a disciplined investment strategy and a strong safety culture, enabling it to deliver consistent value to charterers, investors, and partners.\n\n“Above all, we believe in doing things with transparency, accountability, and care for our people and our trusted charterers,” says Michalopoulos.\n\nA Proud Crew\n\nFor Michalopoulos, mentioning Performance Shipping’s people is not just lip service, but a core component of the business’s strategy and outlook.\n\n“Shipping is ultimately a people business,” he shares. “We take pride in building a loyal and competent team, both onboard and ashore.”\n\nThat pride is reflected in the way Performance Shipping attracts and supports talent.\n\n“We hire individuals who share our values of professionalism, respect, and teamwork,” Michalopoulos says. “We support them through continuous training, open communication, and a focus on health and well-being, because we believe that a motivated team is essential to our long-term success.”\n\nThe investment in Performance Shipping’s people is one that Michalopoulos is clear has paid off, and in talking to him it is clear how much pride he takes in the company’s team on land and at sea.\n\n“I would like to highlight our people. Our success is built on the dedication of our shore and sea staff, who embody our values every day,” Michalopoulos tells us. “Shipping is a demanding industry, but it is also deeply human, and it takes resilience, teamwork, and pride in one’s work to deliver consistent results.”\n\nBeing able to rely on your people is even more important given how volatile and changeable the shipping sector as a whole can be.\n\n“In a world where change is constant, our goal is to remain steady, principled, and forward-looking,” says Michalopoulos. “Performance Shipping continues to evolve by modernising our fleet, strengthening our operations, and investing in our people, while staying true to the values that have brought us here. We don’t chase trends; we build trust and deliver performance.”\n\nAn Evolving Industry\n\nAs proud as Michalopoulos is of his people, he is equally realistic about the challenges facing them.\n\n“The shipping industry is cyclical and constantly evolving. We have faced challenges ranging from global market fluctuations to increasingly complex environmental and regulatory requirements,” Michalopoulos shares. “The path toward decarbonisation, while necessary and welcome, requires substantial investment, planning, and coordination. For a smaller organization like ours, ensuring we stay ahead of these developments has been both a challenge and a defining strength.”\n\nNavigating these challenges is where Performance Shipping lives up to its name, taking proactive steps to improve efficiency and ensure regulatory compliance across its fleet. The company has made strong investments in emissions-monitoring technologies, enabling transparent reporting in line with EU ETS and FuelEU Maritime requirements. That in turn helps to enhance fuel efficiency and reduce emissions through the use of voyage optimising software and speed management practices.\n\n“We are installing energy-saving devices designed to improve the hydrodynamic characteristics of our vessels, resulting in greater fuel efficiency and measurable emissions reduction,” Michalopoulos says. “Looking ahead, our fleet renewal program has positioned us for the future. The two remaining newbuilds we have on order demonstrate our commitment to a modern and sustainable fleet, further enhancing our long-term vision.”\n\nA Vision of the Future\n\nThat long-term vision is important to both Michalopoulos and Performance Shipping as a whole. With a strong team built around strong values, the company plans to go a long way.\n\n“Our focus is on operational excellence and delivering dependable service to our clients. In the near term, our priorities are centred on growth through modernisation and efficiency,” Michalopoulos says. “We are looking forward to the delivery of our newbuilds which marks the next step in our fleet renewal strategy. With the recent addition of the two Suezmax vessels now in operation our fleet is already reflecting this phase of growth. While the industry continues to face delays in the global decarbonization transition, including the slower rollout of alternative fuels, high costs, and ongoing regulatory uncertainty, our approach remains steady and practical. We are investing in technologies that offer tangible efficiency gains today, while preparing our fleet to adapt as the regulatory and energy landscape evolves.”\n\nBeyond those significant but more immediate plans, Performance Shipping has an even greater vision for the future.\n\nAs Michalopoulos tells us, “Our broader goal is to remain a trusted, transparent, and responsible shipping partner that consistently performs as the industry evolves.”\n\nAs the industry evolves, Performance Shipping is sure to evolve with it.",
    "source_url": "https://businessfocusmagazine.com/2026/02/16/performance-shipping-performance-mindset-interview-with-ceo-andreas-michalopoulos/",
    "source": "businessfocusmagazine.com",
    "score": 116
  },
  {
    "id": 1771311635,
    "date": "2026-02-17",
    "title": "Methane Estimates Could Fall Vastly Short, Ignore 80% of Actual Emissions, Researcher Says",
    "summary": "Methane emissions from natural gas extraction are wildly underreported, with potential errors ranging from -23% to +316%. The study ignores combustion, which accounts for up to 90% of lifecycle emissions. This deliberate omission serves the interests of the U.S. National Petroleum Council.",
    "content": "Methane releases from natural gas extraction and distribution could be 23% lower or up to 316% higher than standard measurement systems show, raising new questions about how countries can measure and meet their ambitious targets for reducing methane emissions, a McGill University study concludes.\n\nAnd the calculations leaves out at least 80% of the global warming across the natural gas life cycle that occurs when the product is burned in power plants in the United States, said Sarah Jordaan, an associate professor in McGill’s Department of Civil Engineering.\n\n“This results is very specific to the upstream, from the production of natural gas all the way through to delivery to the consumer,” Jordaan told The Energy Mix. But “if you’re looking to really balance viewpoints on this, the vast majority of emissions from the full life cycle assessment are actually when the natural gas is used.”\n\nWhile accurate measurement of emissions across the natural gas supply chain is something “that we really need to worry about,” she added, “that combustion component can be as much as 80% of the emissions, which are not accounted for in this particular model.”\n\nIn 2005, Jordaan said in an email, power plant combustion accounted for 84% of the global warming potential from gas over a 100-year span, rising to 86% in 2010 and 90% in 2015, although hydraulic fracturing (fracking) techniques for gas extraction have since shifted more of the impact to the earlier stages of gas production.\n\nThe startling results show up in a recent paper in the journal Cell Reports Sustainability, for which Jordaan was lead author. The research team had been hired to develop a “democratized”, open-source model to help fossil companies, regulators, and anyone else measure climate pollution from natural gas supply chains across the U.S.\n\nA McGill media release says Jordaan and her team initially developed the new system for the U.S. National Petroleum Council and the U.S. National Renewable Energy Laboratory (which some of us will always still recognize as NREL), after a request from Biden-era energy secretary Jennifer Granholm.\n\nEmissions of methane, a climate super-pollutant with 84 times the global warming impact of carbon dioxide over a 20-year span, are released right across the natural gas supply chain, Jordaan said in the release. But because natural gas supply chains are complex, life cycle assessment models don’t always capture the full impact.\n\n“Countries need comprehensive and accurate emission estimates across the entire NG (natural gas) supply chain, but measurements of methane emissions have been shown to exceed engineering-based calculations, raising concerns about the adequacy of available governmental inventory data to effectively inform policy and target emission reduction efforts,” the paper states. So the new model, called SLiNG-GHG, calculates both methane and carbon dioxide releases across natural gas transmission, distribution, and ocean shipping.\n\nMissed Targets\n\nAlthough it should be relatively easy for industry to cut methane emissions by 75% by 2030, Jordaan said that potential is slipping out of reach.\n\nIn 2021, more than 160 countries signed on to a 30% emissions reduction this decade. But the International Energy Agency maintains a 75% target would be affordable, and could even deliver economic benefits, since the methane companies could be capturing is a marketable product.\n\nThat line of thought “leads to this really important dichotomy, whereby the measurements are really tricky, but it’s really low-hanging fruit that we should be solving quickly,” Jordaan told The Mix. Yet to hit 75% by 2030, “we would really have to see industry taking advantage of this quickly and implementing it in advance of regulation”—particularly in the U.S., where “the regulatory landscape is obviously going to be a little bit slower in the short term”.\n\nIn Canada, as well, a federal commitment to a 75% reduction by 2030 has since been undercut by last November’s sweeping memorandum of understanding between the federal and Alberta governments, and Jordaan said actual methane reductions currently stand somewhere above 35%. “Right now, politically, it’s a really tricky time with a lot of competing goals,” she added, although “the fact that we actually have such pledges in place is obviously a very positive thing.”\n\nMarketability Depends on Accurate Data\n\nThe paper stresses the commercial value of getting methane measurement right.\n\n“The future marketability of U.S. NG at least partially depends on accurate estimates, sparking interest from the U.S. Department of Energy in quantifying emissions and identifying solutions for mitigation,” it states. “While the U.S. seeks continued growth in NG production, the European Union seeks to ensure that its liquefied NG (LNG) purchases have low embodied GHG emissions, implementing regulations that require measurement, reporting, verification, and mitigation.”\n\nUntil 2011, Jordaan and her team add, life cycle assessments (LCAs) for natural gas operations in the U.S. focused on conventional production for domestic use. Since then, however, the rise of fracking and the growing U.S. interest in gas exports have added a layer of uncertainty to the analysis, which SLiNG-GHG sets out to solve.\n\nThe new model is also meant as a more accessible solutions for policy-makers and citizens who aren’t technical experts in life cycle assessment. The McGill team found that existing LCA models aren’t generally available or open source. When they are, they’re complicated and hard to verify, and suffer from discrepancies in the industry data the EPA collects for natural gas and LNG operations. Those inventories “have been found, on average, to underestimate methane emissions compared with measurement studies,” the paper says.\n\nTo get a handle on those complexities, Jordaan and her colleagues analysed and harmonized 16 different LCA models using data from 2016 and 2021 and categorized them according to three “gates” for gas extraction and distribution: a transmission pipeline to a major end user like a gas plant; a distribution pipeline to a smaller end user like a private home; and an LNG tanker arriving at a foreign destination in either Europe or Asia. The model adds up all methane emissions, and also identifies the sources of carbon dioxide pollution for each pathway.\n\nThe study found that LNG shipping:\n\n• Produces the highest life cycle emissions of the three “gates”, followed by distribution and then transmission;\n\n• Has the highest variability in accurately measuring global warming potential, and shows the lowest accuracy over the crucial 20-year span when humanity will be scrambling to get climate change under control.\n\nFracking sites are still the biggest single contributor to methane emissions from natural gas over a 20-year span, at 30 to 44% of the total. But “shipping to foreign destinations results in significant additional emissions compared with the other gates, and, evidently, long-distance shipping results in higher emissions,” the paper says. “Notwithstanding geopolitical, energy security, and economic considerations, our contribution analysis confirms that domestic use of NG (gates 1 and 2), on average, significantly lowers the GHG footprint of NG use compared with LNG export (gate 3) if used in equivalent end uses.”\n\nGive us your take on this story\n\nThis article helped me better understand this issue.\n\n1 of 3\n\nI strongly disagree I strongly agree\n\nThis article made me feel more hopeful about solutions.\n\n2 of 3\n\nI strongly disagree I strongly agree\n\nThis article motivated me to discuss or share this issue with others.\n\n3 of 3\n\nI strongly disagree I strongly agree\n\nThank you for your feedback!\n\nIt helps us measure & strengthen the impact of our reporting.\n\nHave more to say? Email community@theenergymix.com\n\nMethane releases from natural gas extraction and distribution could be 23% lower or up to 316% higher than standard measurement systems show, raising new questions about how countries can measure and meet their ambitious targets for reducing methane emissions, a McGill University study concludes.\n\nAnd the calculations leaves out at least 80% of the global warming across the natural gas life cycle that occurs when the product is burned in power plants in the United States, said Sarah Jordaan, an associate professor in McGill’s Department of Civil Engineering.\n\n“This results is very specific to the upstream, from the production of natural gas all the way through to delivery to the consumer,” Jordaan told The Energy Mix. But “if you’re looking to really balance viewpoints on this, the vast majority of emissions from the full life cycle assessment are actually when the natural gas is used.”\n\nWhile accurate measurement of emissions across the natural gas supply chain is something “that we really need to worry about,” she added, “that combustion component can be as much as 80% of the emissions, which are not accounted for in this particular model.”\n\nIn 2005, Jordaan said in an email, power plant combustion accounted for 84% of the global warming potential from gas over a 100-year span, rising to 86% in 2010 and 90% in 2015, although hydraulic fracturing (fracking) techniques for gas extraction have since shifted more of the impact to the earlier stages of gas production.\n\nThe startling results show up in a recent paper in the journal Cell Reports Sustainability, for which Jordaan was lead author. The research team had been hired to develop a “democratized”, open-source model to help fossil companies, regulators, and anyone else measure climate pollution from natural gas supply chains across the U.S.\n\nA McGill media release says Jordaan and her team initially developed the new system for the U.S. National Petroleum Council and the U.S. National Renewable Energy Laboratory (which some of us will always still recognize as NREL), after a request from Biden-era energy secretary Jennifer Granholm.\n\nEmissions of methane, a climate super-pollutant with 84 times the global warming impact of carbon dioxide over a 20-year span, are released right across the natural gas supply chain, Jordaan said in the release. But because natural gas supply chains are complex, life cycle assessment models don’t always capture the full impact.\n\n“Countries need comprehensive and accurate emission estimates across the entire NG (natural gas) supply chain, but measurements of methane emissions have been shown to exceed engineering-based calculations, raising concerns about the adequacy of available governmental inventory data to effectively inform policy and target emission reduction efforts,” the paper states. So the new model, called SLiNG-GHG, calculates both methane and carbon dioxide releases across natural gas transmission, distribution, and ocean shipping.\n\nMissed Targets\n\nAlthough it should be relatively easy for industry to cut methane emissions by 75% by 2030, Jordaan said that potential is slipping out of reach.\n\nIn 2021, more than 160 countries signed on to a 30% emissions reduction this decade. But the International Energy Agency maintains a 75% target would be affordable, and could even deliver economic benefits, since the methane companies could be capturing is a marketable product.\n\nThat line of thought “leads to this really important dichotomy, whereby the measurements are really tricky, but it’s really low-hanging fruit that we should be solving quickly,” Jordaan told The Mix. Yet to hit 75% by 2030, “we would really have to see industry taking advantage of this quickly and implementing it in advance of regulation”—particularly in the U.S., where “the regulatory landscape is obviously going to be a little bit slower in the short term”.\n\nIn Canada, as well, a federal commitment to a 75% reduction by 2030 has since been undercut by last November’s sweeping memorandum of understanding between the federal and Alberta governments, and Jordaan said actual methane reductions currently stand somewhere above 35%. “Right now, politically, it’s a really tricky time with a lot of competing goals,” she added, although “the fact that we actually have such pledges in place is obviously a very positive thing.”\n\nMarketability Depends on Accurate Data\n\nThe paper stresses the commercial value of getting methane measurement right.\n\n“The future marketability of U.S. NG at least partially depends on accurate estimates, sparking interest from the U.S. Department of Energy in quantifying emissions and identifying solutions for mitigation,” it states. “While the U.S. seeks continued growth in NG production, the European Union seeks to ensure that its liquefied NG (LNG) purchases have low embodied GHG emissions, implementing regulations that require measurement, reporting, verification, and mitigation.”\n\nUntil 2011, Jordaan and her team add, life cycle assessments (LCAs) for natural gas operations in the U.S. focused on conventional production for domestic use. Since then, however, the rise of fracking and the growing U.S. interest in gas exports have added a layer of uncertainty to the analysis, which SLiNG-GHG sets out to solve.\n\nThe new model is also meant as a more accessible solutions for policy-makers and citizens who aren’t technical experts in life cycle assessment. The McGill team found that existing LCA models aren’t generally available or open source. When they are, they’re complicated and hard to verify, and suffer from discrepancies in the industry data the EPA collects for natural gas and LNG operations. Those inventories “have been found, on average, to underestimate methane emissions compared with measurement studies,” the paper says.\n\nTo get a handle on those complexities, Jordaan and her colleagues analysed and harmonized 16 different LCA models using data from 2016 and 2021 and categorized them according to three “gates” for gas extraction and distribution: a transmission pipeline to a major end user like a gas plant; a distribution pipeline to a smaller end user like a private home; and an LNG tanker arriving at a foreign destination in either Europe or Asia. The model adds up all methane emissions, and also identifies the sources of carbon dioxide pollution for each pathway.\n\nThe study found that LNG shipping:\n\n• Produces the highest life cycle emissions of the three “gates”, followed by distribution and then transmission;\n\n• Has the highest variability in accurately measuring global warming potential, and shows the lowest accuracy over the crucial 20-year span when humanity will be scrambling to get climate change under control.\n\nFracking sites are still the biggest single contributor to methane emissions from natural gas over a 20-year span, at 30 to 44% of the total. But “shipping to foreign destinations results in significant additional emissions compared with the other gates, and, evidently, long-distance shipping results in higher emissions,” the paper says. “Notwithstanding geopolitical, energy security, and economic considerations, our contribution analysis confirms that domestic use of NG (gates 1 and 2), on average, significantly lowers the GHG footprint of NG use compared with LNG export (gate 3) if used in equivalent end uses.”\n\nGive us your take on this story\n\nThis article helped me better understand this issue.\n\n1 of 3\n\nI strongly disagree I strongly agree\n\nThis article made me feel more hopeful about solutions.\n\n2 of 3\n\nI strongly disagree I strongly agree\n\nThis article motivated me to discuss or share this issue with others.\n\n3 of 3\n\nI strongly disagree I strongly agree\n\nThank you for your feedback!\n\nIt helps us measure & strengthen the impact of our reporting.\n\nHave more to say? Email community@theenergymix.com",
    "source_url": "https://www.theenergymix.com/methane-estimates-could-fall-vastly-short-ignore-80-of-actual-emissions-researcher-says/",
    "source": "theenergymix.com",
    "score": 109
  },
  {
    "id": 1771311621,
    "date": "2026-02-17",
    "title": "ZIM sets out terms of $4.2bn Hapag",
    "summary": "Hapag-Lloyd's acquisition of ZIM, valued at $4.2 billion, raises concerns about the carbon intensity of the combined fleet of over 400 vessels. The deal, expected to close by late 2026, could lead to increased usage of high sulfur fuel oil (HSFO) if unchecked. \"New ZIM\", operating 16 vessels with Hapag-Lloyd's support, must prioritize emissions reduction to avoid future FuelEU Maritime penalties.",
    "content": "New York-listed Israeli carrier ZIM Integrated Shipping Services has laid out the full terms of its agreed sale, confirming shareholders will receive $35 per share in cash under a merger deal that values the company at about $4.2bn.\n\nThe price represents a 58% premium to ZIM’s closing share price on February 13, 2026, a 90% premium to its 90-day VWAP and a 126% premium to its unaffected price of $15.50 in August 2025, before takeover speculation surfaced.\n\nUnder the agreement, Germany’s Hapag-Lloyd will acquire 100% of ZIM’s share capital, with the transaction expected to close by late 2026, subject to shareholder and regulatory approvals.\n\nZIM said the tie-up will expand service offerings across the transpacific, intra-Asia, Atlantic, Latin America and East Mediterranean trades. The combined company will control more than 400 vessels, with capacity exceeding 3m teu and projected annual volumes above 18m teu by 2027.\n\nFor customers, the carriers are pointing to a broader port network and access to the Gemini cooperation platform as key benefits. For Hapag-Lloyd, the acquisition secures its position as the world’s fifth-largest container shipping line.\n\nA central feature of the structure is the creation of a separate Israeli liner, “New ZIM”, to be formed by Tel Aviv-based private equity firm FIMI Opportunity Funds.\n\nThe new company will operate 16 vessels focused on serving Israel’s main trade lanes, linking the country directly with ports in Europe, the US, the Mediterranean and the Black Sea. It will operate under the ZIM brand and receive commercial support from Hapag-Lloyd, including access to the Gemini network.\n\nThe Special State Share held by the State of Israel in ZIM is intended to be transferred to a FIMI subsidiary, subject to government approval. The aim is to ensure continued secure liner services to and from Israel.\n\nHapag-Lloyd has also indicated it plans to maintain a significant business presence in Israel and retain ZIM employees after completion.\n\nZIM chief executive Eli Glickman said the deal follows several years of restructuring and fleet renewal. Since 2017, the carrier has moved from negative equity to sustained profitability, returning $5.7bn in dividends since its 2021 IPO. On completion of the transaction, total capital returned to shareholders is expected to reach about $10bn.\n\nOver the past few years, ZIM has taken delivery of 46 newbuild containerships ranging from 5,300 teu to 15,000 teu, with around 40% of its operated capacity now LNG-fuelled. The company has also invested more than $1bn in container equipment since 2021 and expanded into the car carrier segment, alongside securing LNG supply arrangements.\n\nChairman Yair Seroussi described the agreement as the outcome of a strategic review and a competitive process designed to maximise shareholder value while safeguarding national shipping interests.\n\nUntil the deal closes, ZIM and Hapag-Lloyd will continue to operate independently on a business-as-usual basis. If approved, the transaction will mark one of the largest liner deals in recent years and further consolidate capacity among the top global carriers.",
    "source_url": "https://splash247.com/zim-sets-out-terms-of-4-2bn-hapag-lloyd-deal-outlines-new-zim-carve-out/",
    "source": "splash247.com",
    "score": 80
  },
  {
    "id": 1771311643,
    "date": "2026-02-17",
    "title": "Free to read: Explainer: The US Maritime Action Plan and what it means for shipping lines",
    "summary": "The US Maritime Action Plan proposes a fee on foreign-built vessels calling at US ports, potentially adding significant costs for international carriers at $0.01/kg of cargo. Tighter cargo preference rules could force a shift towards more expensive US-flagged vessels, distorting trade. This protectionist move appears designed to penalize efficient foreign operators while propping up a domestic shipbuilding industry.",
    "content": "The White House’s 13 February Maritime Action Plan (MAP) sets out an ambitious strategy: to rebuild US shipbuilding and reduce dependence on foreign-built and foreign-flagged vessels\n\nFor international shipping lines, the document contains several proposals that could materially affect operating costs, cargo allocation, port routing, and long-term market access.\n\nHere is a breakdown of the measures most likely to affect global carriers first.\n\nA universal fee on foreign-built vessels\n\nThe MAP calls for a “universal infrastructure or security fee” on all foreign-built commercial vessels calling at US ports, assessed based on the weight of imported cargo.\n\nIllustrative figures in the document suggest:\n\n$0.01 per kg would raise $66bn over 10 years\n\n$0.25 per kg would raise $1.5trn over 10 years\n\nNo rate has been fixed.\n\nNearly the entire global container fleet is foreign-built. In practice, this would function as:\n\n1) a de facto surcharge on most international liner operators;\n\n2) a potential pass-through cost to shippers;\n\n3) a possible distortion between US-built niche operators and global carriers.\n\nAt higher illustrative levels (eg @ $0.25/kg), this would dwarf current port fees and materially alter trade economics.\n\nEven at $0.01/kg, the sums become significant on large-volume Asia–US services.\n\nTightening cargo preference rules\n\nThe MAP proposes:\n\n1) increasing the percentage of US government cargo that must move on US-flagged vessels;\n\n2) creating a new United States Maritime Preference Requirement (USMPR) for high-volume exporting economies to transport an increasing share of US-bound containerised cargo on qualifying US vessels.\n\nIf implemented, this could:\n\n1) redirect some cargo away from global liner networks;\n\n2) strengthen US-flag operators backed by subsidy;\n\n3) introduce quota-like dynamics into certain tradelanes.\n\nFor carriers heavily exposed to US government-linked exports or strategic cargo, this could reduce addressable volumes.\n\nLand port maintenance tax\n\nTo prevent cargo diversion via Canada or Mexico, the MAP proposes a 0.125% tax on goods entering through land ports, mirroring the existing Harbor Maintenance Fee.\n\nThis is designed to stop shippers avoiding maritime-related charges by routing via:\n\n1) Vancouver–rail;\n\n2) Lazaro Cardenas–truck/rail;\n\n3) Canadian east coast intermodal.\n\nIf both sea and land entries face aligned charges, routing flexibility narrows.\n\nFor carriers competing with intermodal cross-border strategies, this reduces arbitrage options.\n\nStrategic commercial fleet (SCF)\n\nThe plan proposes creating a Strategic Commercial Fleet (SCF) of internationally trading US-built, US-flagged vessels, supported financially for both construction and operation.\n\nThis is effectively a subsidy to US carriers, backed by construction and operating support and designed to complement existing Maritime Security Program fleets.\n\nWhile the scale is undefined, this could introduce state-supported competition in certain trades.\n\nPotential trade measures linked to China\n\nThe MAP references action taken under the Section 301 investigation into China’s maritime, logistics, and shipbuilding dominance.\n\nAlthough currently suspended, the framework exists for:\n\n1) service fees on foreign-built vehicle carriers;\n\n2) restrictions on certain maritime transport services.\n\nThe MAP signals continued willingness to use trade enforcement tools in shipping.\n\nArctic and autonomous priorities\n\nThe plan prioritises:\n\n1) Arctic route development;\n\n2) ice-breaking capability expansion;\n\n3) robotic and autonomous maritime systems.\n\nWhile less immediate for liner trades, this suggests a long-term industrial policy aimed at reshaping parts of the fleet and route network.\n\nTimings\n\nImportantly, however, none of the new fees are in force; legislative action would be required, and no effective dates are specified.\n\nThe administration intends to send a legislative package after the FY2027 budget process, which implies medium- to long-term implementation, rather than immediate tariff-style activation.\n\nInternational carriers serving the US will need to monitor:\n\n1) legislative movement on the Maritime Security Trust Fund;\n\n2) draft language on the foreign-built vessel fee;\n\n3) cargo preference expansion details;\n\n4) any revival of Section 301 maritime measures.",
    "source_url": "https://theloadstar.com/explainer-the-us-maritime-action-plan-and-what-it-means-for-shipping-lines/",
    "source": "theloadstar.com",
    "score": 75
  },
  {
    "id": 1771311625,
    "date": "2026-02-17",
    "title": "Explainer: The US Maritime Action Plan and What It Means for Shipping Lines",
    "summary": "The US Maritime Action Plan proposes a 'security fee' on foreign-built ships of $0.01-0.25 per kg of cargo, potentially raising costs for international carriers. Tighter cargo preference rules will force more US government cargo onto US-flagged vessels, reducing volumes for global lines. This reeks of protectionism and will likely distort trade without reducing overall emissions.",
    "content": "By The Loadstar team\n\nThe White House’s 13 February Maritime Action Plan (MAP) sets out an ambitious strategy: to rebuild US shipbuilding and reduce dependence on foreign-built and foreign-flagged vessels\n\nFor international shipping lines, the document contains several proposals that could materially affect operating costs, cargo allocation, port routing, and long-term market access.\n\nHere is a breakdown of the measures most likely to affect global carriers first.\n\nA universal fee on foreign-built vessels\n\nThe MAP calls for a “universal infrastructure or security fee” on all foreign-built commercial vessels calling at US ports, assessed based on the weight of imported cargo.\n\nIllustrative figures in the document suggest:\n\n$0.01 per kg would raise $66bn over 10 years\n\n$0.25 per kg would raise $1.5trn over 10 years\n\nNo rate has been fixed.\n\nNearly the entire global container fleet is foreign-built. In practice, this would function as:\n\n1) a de facto surcharge on most international liner operators;\n\n2) a potential pass-through cost to shippers;\n\n3) a possible distortion between US-built niche operators and global carriers.\n\nAt higher illustrative levels (eg @ $0.25/kg), this would dwarf current port fees and materially alter trade economics.\n\nEven at $0.01/kg, the sums become significant on large-volume Asia–US services.\n\nTightening cargo preference rules\n\nThe MAP proposes:\n\n1) increasing the percentage of US government cargo that must move on US-flagged vessels;\n\n2) creating a new United States Maritime Preference Requirement (USMPR) for high-volume exporting economies to transport an increasing share of US-bound containerised cargo on qualifying US vessels.\n\nIf implemented, this could:\n\n1) redirect some cargo away from global liner networks;\n\n2) strengthen US-flag operators backed by subsidy;\n\n3) introduce quota-like dynamics into certain tradelanes.\n\nFor carriers heavily exposed to US government-linked exports or strategic cargo, this could reduce addressable volumes.\n\nLand port maintenance tax\n\nTo prevent cargo diversion via Canada or Mexico, the MAP proposes a 0.125% tax on goods entering through land ports, mirroring the existing Harbor Maintenance Fee.\n\nThis is designed to stop shippers avoiding maritime-related charges by routing via:\n\n1) Vancouver–rail;\n\n2) Lazaro Cardenas–truck/rail;\n\n3) Canadian east coast intermodal.\n\nIf both sea and land entries face aligned charges, routing flexibility narrows.\n\nFor carriers competing with intermodal cross-border strategies, this reduces arbitrage options.\n\nStrategic commercial fleet (SCF)\n\nThe plan proposes creating a Strategic Commercial Fleet (SCF) of internationally trading US-built, US-flagged vessels, supported financially for both construction and operation.\n\nThis is effectively a subsidy to US carriers, backed by construction and operating support and designed to complement existing Maritime Security Program fleets.\n\nWhile the scale is undefined, this could introduce state-supported competition in certain trades.\n\nPotential trade measures linked to China\n\nThe MAP references action taken under the Section 301 investigation into China’s maritime, logistics, and shipbuilding dominance.\n\nAlthough currently suspended, the framework exists for:\n\n1) service fees on foreign-built vehicle carriers;\n\n2) restrictions on certain maritime transport services.\n\nThe MAP signals continued willingness to use trade enforcement tools in shipping.\n\nArctic and autonomous priorities\n\nThe plan prioritises:\n\n1) Arctic route development;\n\n2) ice-breaking capability expansion;\n\n3) robotic and autonomous maritime systems.\n\nWhile less immediate for liner trades, this suggests a long-term industrial policy aimed at reshaping parts of the fleet and route network.\n\nTimings\n\nImportantly, however, none of the new fees are in force; legislative action would be required, and no effective dates are specified.\n\nThe administration intends to send a legislative package after the FY2027 budget process, which implies medium- to long-term implementation, rather than immediate tariff-style activation.\n\nInternational carriers serving the US will need to monitor:\n\n1) legislative movement on the Maritime Security Trust Fund;\n\n2) draft language on the foreign-built vessel fee;\n\n3) cargo preference expansion details;\n\n4) any revival of Section 301 maritime measures.",
    "source_url": "https://gcaptain.com/explainer-the-us-maritime-action-plan-and-what-it-means-for-shipping-lines/",
    "source": "gcaptain.com",
    "score": 75
  },
  {
    "id": 1771311629,
    "date": "2026-02-17",
    "title": "Arctic Council working group reveals 40% increase in ships in the Arctic",
    "summary": "Arctic shipping distances have surged 95% since 2013 to 11.9 million nautical miles, driven by melting sea ice and extended navigation seasons. Crude oil tanker traffic saw a shocking 396% increase, raising concerns about potential spills and black carbon emissions. Increased resource extraction suggests more heavy fuel oil (HFO) use, likely worsening the carbon intensity of Arctic voyages.",
    "content": "As explained, comparing 2013 to 2025, the distance sailed by ships in the Arctic Polar Code Area increased 95%, from 6.1 million to 11.9 million nautical miles. The distance represents the aggregate sailed for each ship in nautical miles.\n\nThe increase in shipping coincides with diminishing sea ice in the Arctic. The number of unique ships entering the Arctic Polar Code area is generally highest in the month of September, when Arctic sea ice is at its lowest extent.\n\nThe term unique ships refers to each ship only counted once, although many ships enter the area multiple times each year.\n\nIn September 2025,1060 ships entered the Polar Code area out of the total 1812 ships that entered the entire year, amounting to 58% of traffic.\n\nTypes of ships in the Arctic\n\nFishing vessels are the most common type of ship in the Arctic, representing 40% of all ships that entered the Arctic Polar Code area. The second most common ship type is general cargo ships.\n\nBetween 2013 and 2025, the ship type that saw the greatest increase in the Arctic was crude oil tankers, which saw a 396% increase over the 12 years. The second greatest increase was bulk carriers with 156% more in 2025 than in 2013.\n\nCruise ships have also increased significantly, with 123% more cruise ships in 2025 than in 2013.\n\nWhy is Arctic shipping increasing?\n\nChanges to the marine environment, such as a decrease in the extent of sea ice and the loss of older, thick ice, have significant implications for longer navigation seasons and new access to previously difficult to reach regions of the Arctic.\n\nHjalti Hreinsson, Deputy Secretary at PAME who administers the ASTD System, shares some insight into why we are seeing the trends in PAME’s Arctic Shipping Status Reports.\n\nSeveral reasons contribute to the increase in Arctic shipping. One of them, and perhaps the most prominent one, is an increase in natural resource extraction. Compared to other marine areas worldwide, there aren’t that many ships in the Arctic, and new projects will strongly impact statistics.\n\n…said Hjalti Hreinsson.\n\nFor example, two large projects – the Mary River Mine in Nunavut and the Yamal Gas project – have led to increases in shipping in the Arctic Polar Code area. The number of bulk carriers has significantly increased as has the traffic of gas tankers, of which there were almost none in the Polar Code area prior to 2018. There is also a rise in Arctic cruise tourism, demonstrated by the increase of vessels in the high north.”\n\nThe Mary River Mine began operations in 2015 to mine one of the world’s richest iron ore deposits. Consequently, bulk carrier traffic has increased substantially. In the Baffin Bay area, where the Mary River Mine is accessed, bulk carriers have increased by 540%.\n\nIn 2025, bulk carriers sailed 130,684 nautical miles compared to just 3,559 nautical miles in 2013 before the project began.\n\nFurthermore, the Yamal Gas Project encompasses natural gas production, liquefaction and shipping. Prior to the launch of the Yamal LNG project in Russia, the volume of gas tankers in the Arctic Polar Code area was minimal.\n\nNow, several tankers transport gas from Yamal directly to foreign markets, including to Asia.\n\nA total of 15 LNG carriers were custom-designed and built for the Yamal LNG project to support year-round navigation. The number of unique gas tankers in the Polar Code area in 2025 were 40.",
    "source_url": "https://safety4sea.com/arctic-council-working-group-reveals-40-increase-in-ships-in-the-arctic/",
    "source": "safety4sea.com",
    "score": 57
  },
  {
    "id": 1771311613,
    "date": "2026-02-17",
    "title": "Biofuel Bunker Snapshot: Antwerp’s B30-VLSFO premium over Rotterdam narrows",
    "summary": "Europe\n\nRotterdam’s B30-VLSFO (POMEME) price has dipped modestly in the last week, while Antwerp’s B30-VLSFO (UCOME) price has seen a much steeper fall.\n\nA $9/mt fall in the port’s conventional VLSFO ...",
    "content": "Europe\n\nRotterdam’s B30-VLSFO (POMEME) price has dipped modestly in the last week, while Antwerp’s B30-VLSFO (UCOME) price has seen a much steeper fall.\n\nA $9/mt fall in the port’s conventional VLSFO price could have added some downward pressure on Antwerp’s price.\n\nThe decline in prices at both ports is despite Prima-assessed ARA POMEME and UCOME barge prices increasing by $27/mt in the past week.\n\nConsequently, Antwerp’s B30-VLSFO price now holds a $67/mt premium over Rotterdam, narrowing considerably from a $90/mt observed last week.\n\nUnlike Antwerp’s B30-VLSFO (UCOME) price, Rotterdam’s B30-VLSFO (POMEME) price is rebated by Dutch suppliers who can generate ZRE units from renewable biofuel bunker sales.\n\nSeparately, the data from the port authority of Antwerp-Bruges said suppliers sold a total of 151,000 mt of bio-bunkers in 2025. Biofuel sales slowed down towards the end of the year, when a 80% quarterly drop in sales was seen.\n\nMeanwhile, Gibraltar’s B30-VLSFO (UCOME) price has also slipped $20/mt in the past week. The port is facing fresh disruptions with the Gibraltar Port Authority suspending all operations, shipping agent A Mateos & Sons said.\n\nThe port is facing winds of around 40 knots and waves higher than 2 metres. Suppliers are already facing backlogs from previous disruptions and around 26 vessels currently await bunkers at the port, port agent MH Bland said.\n\nSouth America\n\nRio Grande’s B30-VLSFO price has slipped around $10/mt over the last week. Its premium over conventional VLSFO price has dipped $5/mt during the same period.\n\nThe port’s B30-VLSFO is trading at an $82/mt premium over its VLSFO price.\n\nSeparately, Brazil’s state-controlled energy major Petrobras announced that its headquarters will be closed for bunker sales activities from 16–18 February due to the Carnival holiday.\n\nFujairah and Singapore\n\nSingapore’s B30-VLSFO price has fallen by $24/mt in the last week, almost four times more than the difference in Fujairah’s B30-VLSFO price from last week.\n\nAs a consequence, Singapore’s discount to Fujairah has almost doubled to $36/mt over the same period.\n\nA $19/mt fall in Singapore’s conventional VLSFO price has probably weighed on the blend’s price.",
    "source_url": "https://www.hellenicshippingnews.com/biofuel-bunker-snapshot-antwerps-b30-vlsfo-premium-over-rotterdam-narrows/",
    "source": "hellenicshippingnews.com",
    "score": 47
  },
  {
    "id": 1771225210,
    "date": "2026-02-16",
    "title": "Ammonia technology moves closer to powering deep-sea shipping",
    "summary": "Everllence's new ME-LGIA dual-fuel engine, rated at 10-15 MW, is slated for use in seven ships, but ammonia's lifecycle emissions remain a concern. Ammonia's high toxicity necessitates specialized handling, potentially increasing operational costs and risks. Despite \"zero-carbon\" claims, the true carbon intensity hinges on the ammonia production method, demanding scrutiny.",
    "content": "Ammonia propulsion is moving from concept to commercial reality as several engine developers bring dual‑fuel designs to market. Everllence’s new ME‑LGIA engine integrates advanced safety barriers, digital connectivity, and fuel flexibility, marking a significant step towards practical zero‑carbon deep‑sea shipping.\n\nAs the maritime industry accelerates towards decarbonization, the transition to low greenhouse gas fuels is essential. Liquefied natural gas and methanol have led the way, but ammonia is making some strides. With three ammonia-capable ships already in operation and another 45 on order, momentum is building.\n\nDriving decarbonization with ammonia\n\nAmmonia offers compelling advantages. It is carbon-free at the point of combustion and can significantly reduce overall emissions when produced from renewable sources. Its volumetric energy density makes it suitable for deep-sea shipping, where long voyages demand robust fuel solutions.\n\nHowever, adoption is not without hurdles. Ammonia’s high toxicity and corrosive nature require stringent safety measures and specialized handling protocols, far beyond those for conventional fuels. Questions around bunkering infrastructure, crew training, and life-cycle emissions remain critical. Nonetheless, ammonia represents a viable option for the future of shipping if these challenges can be solved.\n\nEngine developers commit to ammonia\n\nAs momentum gathers, engine manufacturers are stepping up to develop propulsion systems suited for ammonia.\n\nWinGD and J-ENG delivered their first dual-fuel two-stroke engines in late 2025, followed by Everllence in early 2026, while Hyundai’s HiMSEN H22CDF-LA four-stroke engine has already achieved multiclass approval.\n\nAmong the vessels on order, seven, including those from shipowners such as Höegh Autoliners and Eastern Pacific Shipping, will feature Everllence’s newly launched two-stroke ammonia engines, rated at 10–15 megawatts.\n\nIntroducing the ME-LGIA ammonia dual-fuel engine\n\nThe Everllence ME-LGIA (liquid gas injection ammonia) dual-fuel engine marks a major milestone for zero-carbon propulsion. Based on the diesel principle, the engine employs a liquid gas injection concept, enabling operation on both ammonia and conventional fuels. This flexibility supports shipowners during the transition phase, allowing vessels to switch between fuel types as infrastructure and supply chains mature.\n\nHrishikesh Chatterjee, Senior Promotion Manager – Newbuildings at Everllence, explains: “Our ME-LGIA engine is designed to deliver the same reliability and efficiency as our conventional two-stroke engines, while enabling shipowners to take a decisive step towards zero-carbon operations. Safety and digitalization have been at the core of this development.”\n\nIntegrated safety barriers and digital connectivity for secure ammonia operations\n\nTo address ammonia’s unique safety challenges, Everllence has integrated double-walled piping with continuous ventilation and monitored airflow routed to treatment systems.\n\nFeatures such as the ammonia release mitigation system and the ammonia catch system, incorporating a knockout drum and watercolumn scrubbing, help ensure that any leaks are contained and neutralized before they can reach occupied spaces. The fuel valve train, which includes double block and bleed isolation supported by nitrogen purging routines, adds an additional layer of failsafe protection for both crew and vessel.\n\nFurthermore, the engine is digitally connected, enabling secure real-time data flow from vessels to Everllence’s shore-based monitoring systems. This connectivity supports remote assistance and operational optimization, reducing downtime and improving reliability.\n\nEngineering effort and extensive testing\n\nThe development of the ME-LGIA engine reflects a significant engineering commitment. Since July 2023, Everllence has invested over 150,000 hours in design and validation, conducting more than 800 tests to ensure performance and safety. These tests covered combustion behaviour, emissions profiles, material compatibility, and failure-mode analysis under varying operational conditions.\n\nThe multi-year research and development programme included combustibility investigations, formal hazard identification (HAZID) and hazard and operability (HAZOP) studies, as well as full-scale bunkering and engine trials. “One of the most important lessons learned in the evolution of engine models has been the value of a robust, modular platform as the foundation for innovation,” Chatterjee highlights. “Our ME-C platform has proven to be a trusted and adaptable base for developing advanced dual-fuel technologies, supporting scalable upgrades and systematic dual‑fuel additions, ensuring future upgrades or retrofits.”\n\nMaterial selection also played a key role, with corrosive alloys such as copper and high nickel avoided to prevent degradation when exposed to ammonia, ensuring the long‑term integrity of critical components. Integrated aftertreatment supports compliance with nitrogen oxide (NOₓ) limits while controlling ammonia slip. “We have tested extensively to ensure the engine meets the highest standards for safety and performance,” says Chatterjee. “Our goal was to make ammonia propulsion not only viable but practical for shipowners looking to future-proof their fleets.”\n\nEngine tests confirm high efficiency and emissions compliance\n\nTest results are encouraging: the thermal efficiency of ammonia remains comparable to diesel, indicating no performance penalty, while emissions remain well controlled. Ammonia slip stays below regulatory limits, NOₓ meets Tier II and Tier III requirements with abatement, and nitrous oxide formation is intrinsically low, supporting greenhouse gas reductions of more than 90 per cent. But life-cycle emissions also warrant attention. To achieve true zero-carbon status, ammonia must be produced using renewable energy sources, such as green hydrogen via electrolysis. This requirement underscores the need for integrated strategies across the energy and maritime sectors.\n\nEarly candidate vessels for ammonia dual‑fuel engines\n\nAmmonia dual‑fuel engines are best suited to deep‑sea merchant vessels with low‑speed, two‑stroke propulsion. Large engine dimensions and longer combustion durations favour slower‑burning fuels such as ammonia. This includes bulk carriers, tankers, particularly very large gas carriers, large container vessels, and pure car and truck carriers, especially on high‑utilization routes where charterer demand and decarbonization premiums support early adoption.\n\nWhile newbuilds offer optimal integration, retrofits provide a flexible and capital‑efficient pathway to upgrade existing assets, enabling owners to manage investment risk while meeting future environmental requirements.\n\nOperational considerations to solve\n\nWhile the ME-LGIA engine represents a breakthrough, operational readiness depends on several factors. Crew training is paramount, given the toxicity of ammonia and the complexity of its handling. Everllence is working with classification societies and training providers to develop comprehensive training programmes covering fuel management, emergency response, and maintenance procedures.\n\nBunkering infrastructure is another critical enabler. Ports must invest in dedicated ammonia storage and transfer systems, incorporating robust safety protocols. Collaboration between engine developers, shipowners, and port authorities will be essential to ensure a smooth transition.\n\nA step towards zero-carbon shipping\n\n“The launch of Everllence’s ammonia engine adds real momentum to overcoming technical challenges and advancing ammonia as a viable pathway within the broader decarbonization strategy for shipping. By combining proven dual‑fuel architecture with enhanced safety systems and digital connectivity, Everllence has created an engine solution that is practical and secure,” says Jason Stefanatos, Global Decarbonization Director at DNV. “With continued innovation to address technical and safety considerations, and with the right infrastructure and regulatory clarity, ammonia‑powered vessels can become a valuable part of deep‑sea decarbonization.”",
    "source_url": "https://www.hellenicshippingnews.com/ammonia-technology-moves-closer-to-powering-deep-sea-shipping/",
    "source": "hellenicshippingnews.com",
    "score": 228
  },
  {
    "id": 1771225213,
    "date": "2026-02-16",
    "title": "LNG – From Waste to Wake",
    "summary": "FuelEU Maritime incentivizes LNG shipowners to switch to Bio-LNG due to its favorable lifecycle GHG emissions. Bio-LNG, produced via onshore purification and liquefaction, utilizes existing LNG infrastructure without requiring vessel retrofitting. Despite potential GHG reductions, dirtiestships.com remains skeptical of the long-term sustainability and scalability of Bio-LNG as a widespread solution.",
    "content": "The International Maritime Organisation’s (IMO) Net Zero Framework (NZF) adjournment increases the relative importance of the European Union (EU) regulations, including FuelEU maritime and EU Emissions Trading Scheme (ETS). In addition to their own decarbonisation targets shipowners with liquefied natural gas (LNG) engines are financially encouraged to switch to Bio-LNG under EU regulations.\n\nThe FuelEU Maritime strongly favours Biomethane (specifically Bio-LNG) as a compliance option because of its low to negative life cycle greenhouse gas (GHG) emissions. Biomethane is also a drop in fuel meaning it can be used on LNG fuelled ships without conversion. Ship operators can accrue FuelEU surplus which they are able to bank for future years or sell to operators using fossil fuel under a pooling arrangement.\n\nBut what is Bio-LNG and Biomethane and how is it produced and delivered?\n\nUse of Biomethane\n\nBio-LNG is compatible with existing LNG engines, transfer systems and infrastructure, once it has been upgraded to Biomethane and liquefied. Significant GHG reductions are easy to achieve with minimal retrofitting of LNG vessels. Dual fuel engines can commonly burn LNG or Bio-LNG as well as diesel or biofuels if required. This provides more options should suitable infrastructure not be available in ports. This is known as de-risking.\n\nInfrastructure, Bunkering and Storage\n\nBio-LNG is stored in cryogenic tanks at the same temperature as fossil LNG (–162°C) and the same insulated pipes are used for both.\n\nBio-LNG can make use of the growing LNG bunkering network already in place. This includes the following methods of delivery to the ship:\n\n• Ship-to-ship transfer\n\n• Truck-to-ship\n\n• Terminal-based refuelling\n\nProduction and Liquefaction\n\nBio-LNG can be produced in two ways:\n\nOnshore production and liquefaction\n\n• Liquefied Biomethane is purified to remove components that would freeze, corrode equipment or degrade LNG quality at cryogenic temperatures prior to liquefaction. It is also filtered after liquefaction to remove debris.\n\n• Biomethane is cooled to -162 °C at near atmospheric pressure to turn the gas into a liquid (liquefaction).\n\nIntegration with existing LNG terminals\n\nShipowners can contract on a “mass balance” basis. This provides creditability, compliance and market functionality. It means that the amount of Bio-LNG delivered to a customer over a certain period cannot exceed the Biomethane produced and liquefied over the same period.\n\nThis applies when:\n\n• Bio-LNG and fossil LNG are physically mixed\n\n• Deliveries are done through shared tanks, trucks or terminals\n\n• Sustainability certificates are transferred separately\n\nThe quantity sold as renewable fuel should never exceed the net Biomethane liquefied and available for delivery, after accounting for all process and logistics losses, regardless of physical mixing.\n\nUsing the same tanks, trucks, terminals and engines for fossil fuels create the following advantages:\n\n• Lowers costs\n\n• Assists scalability\n\n• Makes use of existing LNG hubs\n\nEnvironmental Benefits\n\nBiomethane ships offer several significant environmental advantages.\n\nFeedstock variables\n\n• Waste-derived Biomethane provides the greatest benefits.\n\n• Crop-based Biomethane still provides emissions reductions, however there are sustainability restrictions because RED II addresses anything that competes with food production and land use.\n\nRegulatory Compliance\n\nUnder EU regulatory frameworks EU ETS and FuelEU Maritime, Bio-LNG counts as a renewable/ low carbon fuel. This helps operators to reduce their exposure to penalties.\n\nUnder FuelEU some may make a financial gain by selling the surplus created by burning Bio-LNG to operators in deficit, who consume higher carbon fossil fuels.\n\nConclusion\n\nBiomethane offers immediate emissions reductions, compliance advantages, and operational feasibility unmatched by many alternative fuels in the short term.\n\nThe main challenges include sustainable Biomethane supply, controlling methane slip, and ensuring sustainability certification integrity.",
    "source_url": "https://www.hellenicshippingnews.com/lng-from-waste-to-wake/",
    "source": "hellenicshippingnews.com",
    "score": 208
  },
  {
    "id": 1771225227,
    "date": "2026-02-16",
    "title": "Absolute Zero Emissions Shipping News",
    "summary": "The Zero Emission Ship Technology Association (ZESTA) touts \"momentum\" towards absolute zero emissions, but offers no concrete details. Their mention of \"synergy\" between BBNJ and IMO is likely greenwashing, as the IMO has consistently failed to curb shipping emissions. ZESTA's ShipZERO workshop in Türkiye will likely be another talk shop without tangible action on HFO usage or carbon intensity reduction.",
    "content": "Despite a rather rocky geopolitical kick-off, 2026 continues to build momentum toward Absolute Zero emissions globally.\n\nThe year started strong with the entry into force of the UN Biodiversity Beyond National Jurisdiction (BBNJ) Agreement. An external force will pressure shipping to respect the health of our ocean, supporting the uptake of Absolute Zero emissions technologies and energy systems. ZESTAs will leverage our position at the IMO to support a dedicated cooperation process, ensuring that BBNJ and IMO operate in synergy rather than in isolation.\n\nUp until now, we have seen pilots and isolated projects. Last year, we saw hydrogen production and maritime shipping projects cancelled, “cutting the wheat from the chaff”, leaving solid projects at scale. The uptake of wind propulsion is increasing steadily. The number and the size of fully electric vessels are increasing exponentially. 2026 will see many more and much larger projects, as well as the start of true zero-emissions ecosystem development on a global scale. To support this momentum, ZESTAs is adding several new working groups. More details next month. The first to get underway this year is our WG on autonomous vessels, led by Dr. Beatriz Canamary of SeaTrain. Members, contact the ZESTAs Secretariat if you’re interested in joining the WG.\n\nWe will be holding this year’s ShipZERO Workshop in Türkiye, the shipbuilding capital of Europe, in conjunction with COP31. ZESTAs will organise online workshops to bring stakeholders together, laying the groundwork for a productive event. Watch this space to be part of it.",
    "source_url": "https://www.hellenicshippingnews.com/absolute-zero-emissions-shipping-news/",
    "source": "hellenicshippingnews.com",
    "score": 87
  },
  {
    "id": 1771225218,
    "date": "2026-02-16",
    "title": "India-US trade deal opens doors for US corn, DDGS exports: industry sources",
    "summary": "Increased US DDGS exports to India will increase tonne-miles, and thus emissions. The deal will initially allow 500,000 tonnes of US DDGS to enter India. Expect higher CO2 emissions due to increased distances sailed by bulk carriers.",
    "content": "The India-US trade deal, agreed early February, would open the door to the exports of US corn and dried distillers grains with solubles, market participants said Feb. 12.\n\nIndia and the US have unveiled a new trade agreement that resets and expands economic ties after months of tension over tariffs and market access. Under the framework agreed on Feb. 2, the US government reduced total tariffs on India to 18%, down from 50%. In return, India will reduce or eliminate duties on a range of US industrial and food products, while protecting sensitive sectors it considers politically important.\n\n“India committing to purchase over $500 billion in American goods is a win for corn farmers,” Mark Mueller, president of the Iowa Corn Growers Association and farmer from Waverly, Iowa, said. “India’s growing population and economy are creating increased demand for Iowa-grown corn, ethanol and dried distillers’ grains.”\n\nMueller added that this deal proves that the world wants what the US grows, and it is a positive step toward clearing out the record-breaking surplus sitting in US bins right now.\n\nThe latest US Department of Agriculture’s Foreign Agricultural Service data showed that from January to November 2025, the US exported 10,702,808 metric tons of DDGS, with top importers being Mexico, South Korea, Vietnam, Indonesia and Turkey. In a year-over-year comparison, exports decreased approximately 3.22%, as the data for the period January to November 2024 showed exports of 11,059,687 mt.\n\nMarket participants saw this as a positive signal for feed flows but noted it should be at a modest scale initially.\n\nA trader in the DDGS market said that even when it is “not a huge incremental demand,” the announcement from India removing duties on US DDGs for a 500,000 mt quota still provided some upside.\n\n“I think it’s great news, we need it,” a broker source said. Coinciding with another trader focused more broadly on the import opportunity, noting that the deal was “great news,” reflecting optimism about new export channels opening.\n\nAnother broker added a similar sentiment for export opportunities, saying, “Sure hope India buys DDGS. We need more export homes. Fewer and fewer are using it in the US, or at least inclusion levels have reduced slightly.”\n\nThe broker source cautioned that if DDGS prices rise too much, “at some point if you take DDGS too high you will lose domestic usage.”\n\nPlatts, part of S&P Global Energy, assessed CIF New Orleans DDGS barges for the February shipment period at $216/short ton and the Chicago DDGS truck market for the same delivery period was assessed at $182/st.\n\n“We appreciate the potential framework of a deal with India that could lead to demand for Nebraska corn, whether in the raw form or in value-added products such as ethanol or red meat,” a spokesperson from the Nebraska Corn Growers Association told Platts.\n\nIn the corn market, a trader source said that “India has a tendency to promise things that never come to fruition.”\n\nTalking about the energy sector, a trader source said that it will be an opportunity more focused on feed ingredients, DDGS, and soybean meal than for corn as a crop, given that “they don’t need to be crushing grain for biofuels when they’re a net importer.”\n\nPlatts assessed FOB US Gulf April corn shipments at $212.50/mt on Feb. 12, an increase of $2.46/mt since Feb. 2, when India and the US trade announced the deal.",
    "source_url": "https://www.hellenicshippingnews.com/india-us-trade-deal-opens-doors-for-us-corn-ddgs-exports-industry-sources/",
    "source": "hellenicshippingnews.com",
    "score": 22
  },
  {
    "id": 1771138814,
    "date": "2026-02-15",
    "title": "America’s New Maritime Plan Is Competing for the Wrong Century",
    "summary": "The U.S. Maritime Action Plan ignores the urgency of decarbonization, focusing instead on outdated 20th-century shipbuilding competitiveness. EU's FuelEU Maritime regulations, starting in 2025, will penalize ships for high lifecycle greenhouse gas intensity, while the U.S. lags. China's aggressive carbon pricing and electrification efforts further highlight the plan's inadequacy in addressing the shift towards low-carbon shipping.",
    "content": "Support CleanTechnica's work through a Substack subscription or on Stripe.\n\nOr support our Kickstarter campaign!\n\nThe new U.S. Maritime Action Plan, available from the White House Maritime Insights page, is serious policy work. It acknowledges that American commercial shipbuilding has withered to less than 1% of global output and that only a handful of domestic yards can build large oceangoing vessels. It recognizes workforce shortages, fragmented procurement, and brittle supply chains. It calls for multiyear contracting, yard recapitalization, and supplier development. On its own terms, it is coherent. Its diagnosis of the situation is realistic, as far as it goes. The problem is not that the plan lacks effort. The problem is that it is trying to restore competitiveness using a 20th century framework in a shipping market that is already shifting under it.\n\nGlobal shipping economics are changing because energy architecture is changing. The European Union has incorporated maritime into its Emissions Trading System, phasing in coverage from 40% of emissions in 2024 to 100% by 2027. FuelEU Maritime imposes a declining lifecycle greenhouse gas intensity requirement on energy used on board ships beginning in 2025, tightening over time. The IMO’s 2023 strategy sets a net-zero direction for international shipping by or around 2050, with indicative checkpoints of at least 20% (striving for 30%) by 2030 and at least 70% (striving for 80%) by 2040 versus 2008. The legally binding package to implement that direction, a global fuel standard paired with a pricing mechanism, has been delayed in negotiations, featuring strong U.S. opposition, but the direction remains and regional rules like the EU’s are already forcing fleet and fuel decisions. China has strong domestic targets, a strengthening and broadening carbon price, is electrifying shipping, and building strong low-carbon fuel industrial ecosystems. These are not symbolic targets and actions. They attach cost to carbon intensity. A vessel trading into Europe or Asia will face a rising compliance bill if it burns fossil fuel in a conventional architecture. That cost will be embedded in charter rates, asset valuations, and financing decisions.\n\nBattery electric and hybrid propulsion are not moral statements. They are cost structure shifts. If a short sea vessel consumes 10 tons of marine fuel per day at $700 per ton, that is $7,000 per day in fuel. At 300 operating days per year, that is $2.1 million annually. If hybridization cuts fuel burn by 30%, that is $630,000 per year saved before accounting for carbon pricing exposure. If EU ETS adds an effective $100 per ton of CO2 on 3.1 tons of CO2 per ton of fuel, that is an added $310 per ton of fuel burned. On 10 tons per day, that is $3,100 per day or $930,000 per year. Hybridization that reduces fuel use by 30% reduces that exposure proportionally. The economics are not subtle.\n\nBattery system costs have fallen sharply, making most studies on the subject obsolete as I noted recently. Containerized battery energy storage systems are being procured in competitive markets at $80 to $150 per kWh for delivered modules at port. Gravimetric densities at the system level are in the range of 140 to 175 Wh/kg. A 10 MWh installation at $120 per kWh is a $1.2 million capital item. At 150 Wh/kg, that 10 MWh weighs about 67 tons. On a 5,000 ton vessel, that is about 1.3% of displacement. If that battery displaces fuel burn equivalent to 3 tons per day and operates 300 days per year, it offsets about 900 tons of fuel annually. At $700 per ton, that is $630,000 per year. The simple payback is under two years before carbon pricing and maintenance effects. Not every vessel pencils out that cleanly, but many inland and short sea segments are already within this range.\n\nThe new U.S. plan acknowledges innovation in automation and digital systems. It addresses autonomous vessels and regulatory modernization. It calls for improved procurement efficiency and better requirement definition. Those elements are aligned with current practice. What it does not do is treat energy architecture as a core competitiveness lever. There are no electrification targets for vessel classes. There is no integrated strategy for port electrification. There is no defined domestic industrial base for maritime power electronics, battery integration, or high capacity shore connection hardware. Energy appears as background modernization, not as the organizing principle of the next generation fleet.\n\nProtection is the dominant instrument in the plan. It proposes strengthening cargo preference rules and imposing fees on foreign built vessels entering U.S. ports. It calls for expanding U.S. flag tonnage and building a Strategic Commercial Fleet supported by federal funding. This is mid 20th century maritime doctrine. It assumes that domestic build origin is the foundation of security. In a world where lifecycle operating cost under carbon constraints determines asset value, that assumption is incomplete.\n\nThe productivity gap remains central. Large commercial vessels built in South Korea, Japan, or China often cost 2 to 4 times less per compensated gross ton than comparable U.S. builds. That gap reflects continuous production lines, supplier density, standardized designs, and yard automation. If a Korean yard can deliver a 3,000 TEU feeder for $40 million and a U.S. yard requires $120 million for similar tonnage, protection can force domestic procurement but it cannot erase the cost differential. If the $120 million vessel also carries higher fuel and carbon compliance exposure because its energy architecture lags, the lifecycle gap widens further.\n\nThe universal per kg fee proposal in the plan illustrates the risk. At 1¢ per kg, a 20,000 kg container load would incur $200 in additional cost. On 10 million containers, that is $2 billion. At 25¢ per kg, that same container would incur $5,000. On 10 million containers, that is $50 billion. These costs would not be absorbed by shipowners. They would flow through freight rates into food, electronics, appliances, and construction materials. If the purpose is to raise $66 billion over ten years at 1¢ per kg, that $6.6 billion per year is a tax on trade. It does not improve yard productivity. It shifts costs, and not externally, but to American consumers. As James Carville helped then future President Clinton articulate, “It’s the economy, stupid”. This plan will take a long time to rebuild capacity and put the costs on voters who are already paying over $1,000 per year on average for new protectionist tariffs.\n\nEnergy transition is also a security issue. A hybrid coastal fleet that reduces liquid fuel consumption by 30% reduces exposure to supply disruption. Shore power allows vessels at berth to draw from domestic electricity rather than imported fuel. Maritime shipping fuels used in the United States are refined primarily from a mix of domestic crude oil and imports, with Canada by far the largest foreign supplier. In recent years, roughly 50% to 60% of U.S. crude oil imports have come from Canada, followed by smaller volumes from Mexico, Saudi Arabia, Iraq, and Colombia, according to U.S. Energy Information Administration data. Gulf Coast refineries, which produce most U.S. marine bunker fuel and marine diesel, typically run blends of domestic shale crude and heavier imported grades, especially Canadian heavy crude, to optimize refinery configurations designed for high sulfur residual fuel and distillate production. Current US policy is antagonizing or actively overthrowing foreign sources of crude, and the global energy market is making them economically non-viable, creating a strategy energy risk for US shipping fuels. A fleet designed around flexible energy inputs is harder to constrain through fuel embargo or price spike. If security is the core justification for maritime policy, then energy architecture should be central, not peripheral.\n\nThe Jones Act is the structural variable shaping American maritime economics, as I’ve returned to a few times. It requires U.S. built, U.S. owned, U.S. crewed vessels for domestic coastwise trade. It is not mentioned in the plan. Not once. This is not oversight. It is avoidance. A maritime revival plan that will not even name the rule that defines the domestic market is policy shadowboxing. If the Jones Act strengthens security and competitiveness, say so and defend it. If it distorts cost and slows modernization, confront it and reform it. Silence is not strategy. Refusing to engage directly with the Jones Act in a comprehensive maritime plan is intellectual cowardice.\n\nThe world market will not wait for American political comfort. A vessel ordered in 2026 will likely operate into the 2050s. If that vessel enters European waters in 2030, it will face ETS exposure and FuelEU intensity requirements. China is heading in that direction, having 700 TEU container ships operating domestically. If the ship’s energy architecture is fossil heavy, it will carry a rising compliance burden over its life. Asset values reflect expected cash flow. Cash flow reflects operating cost. Operating cost increasingly reflects carbon intensity. These are mechanical relationships.\n\nIf the United States rebuilds yard capacity primarily to produce conventional fossil heavy tonnage, it risks creating a protected domestic niche that depends on preference rules and tariffs rather than export competitiveness. If it rebuilds yard capacity while integrating battery, hybrid, and shore power readiness as baseline design elements, it can compete in the emerging regulatory environment. The difference is not philosophical. It is economic.\n\nCompetitiveness in the 2030s maritime market will be defined by three variables. Build cost per ton. Lifecycle operating cost under carbon constraints. Regulatory compliance flexibility. The current plan addresses build cost partially through procurement reform and supplier development. It addresses lifecycle cost only indirectly. It does not address compliance flexibility in a structured way.\n\nAvoiding the energy transition question does not freeze the market. It shifts the cost to later years. Retrofitting hybrid systems onto ships not designed for them is more expensive than integrating them at build. Retrofitting shore connection systems onto vessels not designed with appropriate electrical architecture adds complexity. Building tonnage that requires future modification to remain competitive is not industrial strength. It is deferred liability.\n\nA serious competitiveness strategy would treat maritime battery integration, high power conversion, thermal management, and shore infrastructure as core industrial base components. It would tie federal procurement to energy performance metrics. It would set measurable goals for hybrid penetration in coastal and government fleets. It would align port infrastructure funding with vessel electrification timelines. It would address the Jones Act openly in the context of energy architecture and global competitiveness.\n\nThe United States might be able to rebuild shipbuilding capacity. It could modernize yards and train workers. It could protect domestic trade. But if it defines competitiveness using 20th century metrics while the rest of the world prices carbon and redesigns vessels around new energy systems, it will find itself defending a fleet that is structurally expensive to operate. It’s also subject to the ongoing policy flipflops in the country. Industrial policy without energy realism is incomplete. Maritime security without energy architecture is fragile. Competitiveness built on insulation rather than adaptation will not endure.",
    "source_url": "https://cleantechnica.com/2026/02/14/americas-new-maritime-plan-is-competing-for-the-wrong-century/",
    "source": "cleantechnica.com",
    "score": 168
  },
  {
    "id": 1771138817,
    "date": "2026-02-15",
    "title": "Labour hammers Northern Ireland with new green shipping tax",
    "summary": "Northern Ireland faces a 6% hike in shipping costs due to the incoming Emissions Trading Scheme (ETS), adding to existing Brexit-related burdens. Stena Line anticipates an extra £9 million annually, or £15 per HGV, van and car. Despite industry claims of investment in sustainable ferries, reliance on carbon-intensive fuels persists, warranting scrutiny of actual emissions reductions.",
    "content": "Northern Ireland businesses are set to be hammered by a green tax which bosses fear will make them uncompetitive.\n\nA new tax on ferries to Northern Ireland, set to be introduced this summer, will swell freight rates – weighing on the economy and driving up prices.\n\nThe levy system, known as the emissions trading scheme (ETS), stands to increase shipping costs to the province by 6pc when it comes into force in July, according industry estimates.\n\nThe UK Chamber of Shipping said that will put more pressure on an economy where supply chain costs are already higher than the rest of the UK because of arrangements imposed under Brexit’s Windsor Framework.\n\nIt said the tax will also add to the red tape foisted on business following the agreement, which placed Northern Ireland in the EU’s single market for goods after Brexit.\n\nThe ETS scheme requires shipping firms to pay for their CO2 emissions as part of the Government’s push to reach net zero by 2050.\n\nUnlike other ferry routes, Northern Ireland will not be exempt from the charges, even though 90pc of commercial and passenger traffic goes by sea.\n\nThe Chamber said ferry firms will most likely have to pass the additional charges on.\n\nStena Line, which operates ferries to Belfast from Liverpool, Heysham in Lancashire and Cairnryan in Scotland, estimates that the scheme will increase its costs by £9m annually. That would average £15 for every HGV, van and car.\n\nThe Chamber said an initial 50pc deduction to match the carbon charges on voyages between Britain and Republic of Ireland will provide little relief.\n\nThat is because exporters in Northern Ireland compete mostly with firms in Britain rather than the province’s southern neighbour, to which they will be at a structural disadvantage.\n\nUK firms have already spent millions on some of the most sustainably designed ferries, including methanol and rotor sail propulsion, leaving no financially viable way forward, it claimed.\n\nThe Chamber said: “The sector supports the UK’s climate goals, but cannot deliver meaningful emissions reduction without the necessary fuels, infrastructure, and clear guidance in place.\n\n“Premature implementation risks higher costs for passengers and freight, with limited environmental gain. However, the Government is pressing ahead, leaving industry in an untenable position.”\n\nThe trade group urged ministers to delay introduction of the scheme while further assessments are carried out and said the revenue raised should be ring-fenced for investment in clean fuels and quayside power connections.\n\nThe Department for Energy Security and Net Zero said that it is for ship operators to decide how much of the expense of the ETS scheme to pass on, and that consumers should not see significant costs.\n\nA spokesman said: “Pricing emissions is a cost-effective way to cut carbon emissions and encourage greener travel. We are working closely with industry on implementation.”",
    "source_url": "https://www.telegraph.co.uk/business/2026/02/14/labour-hammers-northern-ireland-with-new-green-shipping-tax/",
    "source": "telegraph.co.uk",
    "score": 117
  },
  {
    "id": 1771052415,
    "date": "2026-02-14",
    "title": "Kongsberg Maritime unveils unified digital solutions portfolio and launches KM Performance",
    "summary": "Kongsberg's \"unified\" digital solutions portfolio likely obscures the excessive fuel consumption that plagues the industry. Their KM Performance software should transparently report each vessel's carbon intensity in gCO2/tonne-mile. We will monitor if this \"digital transformation\" actually reduces HFO usage or just provides a veneer of sustainability.",
    "content": "Kongsberg Maritime has marked a significant step forward in its digital transformation with the unveiling of a harmonised Digital Solutions portfolio and the launch of KM Performance, the first solution area out of the portfolio which is designed to help customers in the marine transportation segment to strengthen operational efficiency, reduce emissions, and meet evolving regulatory demands.\n\nCustomers, partners, and industry representatives were introduced to the new portfolio at a dedicated digital launch event in Oslo, where attendees were given a first look at the company’s unified approach to maritime digitalisation.\n\nThe consolidation of Kongsberg Maritime’s legacy software offerings into a single, integrated portfolio represents a major shift in how the company supports modern fleet operations.\n\nSystems such as K-IMS, Vessel Insight, K-Fleet and Coach have been brought together under Digital Ocean, the company’s digital office, creating one coherent ecosystem built on a common data foundation and architecture. This harmonised approach is designed to offer operators greater transparency, improved data quality, and a more consistent user experience across onboard, onshore, and cloud-based tools.\n\nAlexandra Koefoed, Executive Vice President, Digital and Emerging, Kongsberg Maritime, said: “Our vision for our digital portfolio is simple, focused, and built around creating real value for our customers. Our mission is to support safer, smarter and more sustainable operations at sea. That’s the anchor point for everything we do. We’re here to be a trusted digitalisation partner – not just delivering technology, but guiding customers through their digital journey with solutions that actually make a difference, day-to-day.”\n\nAnders Bryhni, Product Line Manager Performance and Fleet Management, Kongsberg Maritime, added: “Bringing our legacy products into one harmonised digital offering allows us to innovate faster and deliver greater value to our customers. KM Performance is just the beginning and it’s a clear demonstration of how deep integration, trusted data and modern architecture create meaningful operational impact across the entire digital voyage.”\n\nKM Performance is the first solution area to be launched from the unified portfolio and provides comprehensive support across the full voyage cycle, from pre-planning and during-voyage execution to post-voyage reporting and regulatory compliance. By combining high-integrity sensor data with validated manual inputs, KM Performance gives operators a trusted operational picture and a clearer basis for critical decision-making.\n\nFeatures such as dynamic trim optimisation, weather-informed route planning, hull performance analytics and automated emissions reporting help customers reduce fuel consumption, improve operational predictability and maintain readiness for new environmental requirements.\n\nUnifying the Digital Solutions portfolio and introducing KM Performance reflects a long-term commitment and strategic priority from Kongsberg Maritime to support customers throughout their digitalisation journey, enabling them to operate more efficiently today while preparing for the demands of tomorrow.",
    "source_url": "https://www.hellenicshippingnews.com/kongsberg-maritime-unveils-unified-digital-solutions-portfolio-and-launches-km-performance/",
    "source": "hellenicshippingnews.com",
    "score": 36
  },
  {
    "id": 1771052410,
    "date": "2026-02-14",
    "title": "Dirty & Clean Routes: This Week’s Congestion Moves",
    "summary": "Recent freight market behavior suggests a pause in the rally rather than a structural reversal. Freight levels remain supported by constrained tonnage supply, particularly in core export regions, thou...",
    "content": "Recent freight market behavior suggests a pause in the rally rather than a structural reversal. Freight levels remain supported by constrained tonnage supply, particularly in core export regions, though near-term direction will depend on fresh cargo flow and overall market activity.\n\nArabian Gulf and West African dirty freight markets are currently characterized more by holding firmness than a new surge. Market activity appears measured, with participants monitoring cargo flow developments before establishing stronger directional conviction.\n\nTrade Flow & Policy Developments\n\nThe freight market’s direction is increasingly shaped by evolving crude trade patterns and emerging policy shifts.\n\nA potential trade agreement between the United States and India, expected by mid-March, is drawing market attention. While the direct impact on freight remains uncertain, any adjustments to tariff frameworks or sourcing incentives could affect crude procurement strategies and, in turn, tonne-mile demand.\n\nA gradual reconfiguration of global trade flows is already taking shape. Indian refiners have shown renewed openness toward Venezuelan crude following the resumption of exports. State-owned Indian Oil Corporation (IOC) and Hindustan Petroleum Corporation Ltd (HPCL) have jointly secured 2 million barrels, marking the second Venezuelan cargo deal since export channels reopened.\n\nIf sustained, this shift could modestly extend average voyage distances, particularly if Atlantic Basin crude gains an incremental share in Asian refining systems.\n\nHowever, structural realignment remains conditional. Commercial viability, refinery configuration constraints, and regulatory clarity continue to limit rapid substitution between crude grades. Not all barrels are interchangeable.\n\nSanctions frameworks and compliance requirements remain operational variables, particularly for vessel services, insurance, and financing channels.\n\nFor now, freight performance appears more directly driven by regional vessel availability and cargo timing rather than immediate geopolitical catalysts.\n\nFreight Market Overview – Dirty\n\nBaltic Dirty Tanker Index is trending exceptionally higher (+90% YoY), surpassing the monthly levels of the previous years since 2023.\n\nBDTI – Baltic Dirty Tanker Index Market Prices →\n\nBDTI\n\nDirty TCE$/DAY\n\nVLCC | Suezmax | Aframax ↓\n\nTD3C Middle East Gulf to China | TD6 Black Sea to Mediterranean | TD7 North Sea to Continent\n\nDirty Spot Price Summary Open in Platform →\n\nDirty Spot Price Summary\n\nThe freight market pulse has eased further since the start of the first week of February. Yet strong performances are still recorded in the VLCC Middle East Gulf-to-China TCE and the Suezmax Black Sea-to-Mediterranean, with TCE in excess of $110k/d, while the Aframax North Sea-to-Continent dropped below $95k/d.\n\nVLCC: The TCE rates for the MEG-to-China route, while dropping by about $5,000/day to $117,000/day, remained strong. This $117k/d figure represents a substantial increase of roughly $83,000/day compared to a year ago.\n\nSuezmax: Rates for the Black Sea to Mediterranean route experienced a minor downward adjustment this week, remaining near $117k/day — an increase of approximately $79k/day YoY.\n\nAframax: North Sea-to-Continent rates currently stand at $93k/d, dropping by around $3k/day from the previous week, and still significantly weaker than the extraordinary spike to approximately $140k/d recorded just before the end of January.\n\nBaltic Rates Comparison – Dirty Spot Comparison →\n\nDirty Rates\n\nFreight Market Overview – Clean\n\nBaltic Clean Tanker Index (+34% YoY). The current index value remains strong; however, there has been a gradual easing, with a 4% weekly drop to below the 900-point mark. It appears the latest peak was reached on February 5, 2026, with the index near 920 points.\n\nBCTI – Baltic Clean Tanker Index Market Prices →\n\nBCTI\n\nClean TCE$/DAY\n\nLR2 | LR1 | MR ↓\n\nTC1 75k MEG to Japan | TC5 55k MEG to Japan | TC14 38k US Gulf to Japan\n\nClean Spot Price Summary Open in Platform →\n\nClean Spot Price Summary\n\nIn the clean segment, the second week of February seems to end with a clear downward trend signal. However, the standout route for annual growth remained MR USG to Continent, as mentioned in our last tanker market monitor, with earnings up 476% annually, but with latest indications reversing significantly the firmness of the previous week, when levels were in excess of $40k/d, and lost momentum this week to around $30k/d.\n\nBaltic Rates Comparison – Clean Spot Comparison →\n\nClean Rates\n\nSupply Market Trends\n\nIn this section, we highlight the areas of the dirty Baltic routes where TSOP signals show the latest upward trend, contrary to the direction of freight market movements.\n\nVLCC | USG Vs AG & WAfr\n\nUSG Supply vs Demand – TD22 Open in Platform →\n\nVLCC USG Supply\n\nBuilding on last week’s observation of emerging oversupply in West Africa, current data indicate developing net supply pressure in the US Gulf. Specifically, the latest Signal Ocean Platform figures indicate an oversupplied market on the TD22 route (24% above the 3-month average). This elevated supply level appears to be already restraining any further spike in recent freight market indications.\n\nWest Africa: The spike in the availability of spot/relet vessels on the TD15 route, which saw the count peak near 20 over the last fortnight, has now subsided. The vessel count has dropped to 13, helping TD15 rates maintain a floor above WS 120.\n\nAG: The sustained downward trajectory in net vessel supply within the Arabian Gulf region remains a notable market feature. Current data indicate a substantial reduction in the vessel count, now approximately 45% below the peak level recorded at the end of December 2025. This significant decline has accelerated recently, in contrast to the 26% decrease observed just before the close of the previous week.\n\nSuezmax | WAfr Vs Black Sea\n\nWAF Supply vs Demand – TD20 Open in Platform →\n\nSuezmax WAF Supply\n\nWest Africa: Spot/relet vessels on the TD20 route are maintaining levels above 30 (the same as a week ago), marking a significant 100% rise from the exceptionally low figures recorded in mid-January. In addition, the current TSOP data indicate that the TD20 route is now oversupplied (23% above the 3-month average), which is expected to further depress freight demand.\n\nBlack Sea: Current volatility continues, averaging around 25 vessels, down from the peak of just over 30 vessels recorded in mid-November 2025.\n\nDirty Demand – Tonne Miles\n\nVLCC ↓ 3.3% WoW | Suezmax ↑ 2.8% WoW | Aframax ↓ 6.0% WoW\n\nTonne Miles Index View – 7D MA Open in Platform →\n\nDirty Demand\n\nThe VLCC segment’s tonne-mile index growth stayed below 100%, in line with last week’s expectations, continuing to lag both Suezmax and Aframax. Suezmax continues to exhibit relatively firmer momentum. Although the Aframax index growth remains above 100%, it has moderated to around 115% from its early February peak of 120%.\n\nMetrics Description: Index View (Base 100) by total Tonne Miles over the selected period. This facilitates relative performance comparisons between segments of different sizes.\n\nClean Demand – Tonne Miles\n\nAframax ↓ 1.5% WoW | Panamax ↓ 2.8% WoW | MR2 ↓ 2.0% WoW",
    "source_url": "https://www.hellenicshippingnews.com/dirty-clean-routes-this-weeks-congestion-moves/",
    "source": "hellenicshippingnews.com",
    "score": 16
  },
  {
    "id": 1771016389,
    "date": "2026-02-13",
    "title": "\"Green\" Vessel Investments Continue Despite Delays",
    "summary": "Shipping lines persist with \"green\" investments despite delays in global carbon pricing, potentially to avoid future FuelEU Maritime penalties. Dual-fuel vessel orders are increasing, but these ships often still burn HFO, impacting their Carbon Intensity Indicator (CII) rating. Wärtsilä profits regardless, selling both scrubbers and dual-fuel engines that may not deliver promised emissions reductions.",
    "content": "The shipping industry's biggest players are shrugging off Trump administration opposition to a global carbon price and are forging ahead with billions of dollars in emissions-reducing investments, according to company officials and a Reuters analysis of data.\n\nEurope, Brazil and a host of other nations are pushing the sector, which is responsible for nearly 3% of the world's greenhouse gas emissions, to go green. But, in October, the U.S. and Saudi Arabia, the world's two largest oil producers, successfully spearheaded efforts to postpone by one year a decision on the International Maritime Organization's proposal of a $380-per-metric-ton levy.\n\nSome analysts and industry observers initially warned that the absence of such a global framework added complexity to companies' planning and could cause some to pause their green investments.\n\nBut in interviews with 15 shipping companies, ports, bunker suppliers and marine technology companies, 10 told Reuters that regional regulations, long investment lead times, and expectations of a continuing trend towards decarbonisation all argued in favour of staying the course.\n\nAnd a Reuters analysis of vessel delivery data through 2028 showed orders of ships capable of running on alternative fuels dominating new shipbuilding.\n\nHakan Agnevall - chief executive of Wartsila WRT1V.HE, a major producer of ship engines and exhaust gas cleaning scrubbers - told Reuters that a one-year carbon price postponement is unlikely to rattle customers, like his, who generally take a 30-year investment perspective.\n\n\"It's not bold to say that regulations will change during those 30 years.\"\n\nNew Ship Orders Dominated by Dual Fuel\n\nMost of the nearly 50,000 commercial ships operating globally today run on fuel oil or gas oil. But in a unanimous decision in 2023, IMO member states set a target of net-zero emissions by or around 2050.\n\nFirms have, in anticipation, begun ordering dual-fuel ships that can use both fuel oil as well as greener alternatives like liquefied natural gas, methanol and ammonia.\n\nWhile Pacific Basin - a large dry bulk ship owner - did opt to buy four newbuild vessels running only on oil-derived fuels, citing the postponement of the IMO's carbon price, the company is an outlier.\n\nUnlike other sectors - from energy to auto manufacturing - that have curbed their green ambitions in a rollback that has only accelerated since Donald Trump's return to the White House, the shipping industry has, so far, declined to pivot.\n\nMajor ship owners have reiterated their commitments to invest in emissions reduction measures, including dual-fuel vessels and onboard energy-saving devices.\n\nBy the end of December, companies had invested over $150 billion in dual-fuel vessels, according to a Reuters analysis of data from the World Shipping Council, an industry group for container shipping and vehicle carriers.\n\nIn total, 1,126 dual-fuel container ships and vehicle carriers have now been either delivered or are on order, the data showed. That marks an increase of 28% compared with the previous year, indicating that newbuilding orders for lower-emission fuel vessels continued even after the IMO delay.\n\nThey also continued to outpace orders for traditional ships, with dual-fuel vessels now accounting for 74% of the overall container ship and vehicle carrier orderbook.\n\nAnd investments in new marine fuels are also moving ahead.\n\nAlexander Saverys, CEO of Belgian ship owner CMB.Tech, told Reuters it will continue investments in both ammonia bunkering and production.\n\nA Mitsui O.S.K. Lines spokesperson told Reuters the IMO postponement just means a longer transition to low and zero-carbon fuels, and the company is still focused on LNG-fuelled vessels and early-stage adoption of ammonia and methanol.\n\nMaersk, among the first to explore emissions-reducing alternative fuels, initially opted for methanol but has since ordered LNG-fuelled ships and has now also started testing ethanol as an alternative.\n\nNYK Group 9101.T, which reaffirmed its emissions reduction strategy after the IMO decision, sees the one-year delay as an opportunity for discussion and refinement of the regulatory framework, a company spokesperson said.\n\n\"While recent regulatory uncertainties might lead some operators to take a more cautious approach, the overall direction of maritime decarbonisation has not changed significantly,\" said Jason Stefanatos, decarbonisation director at maritime consultancy DNV.\n\n\"The commercial drivers still remain.\"\n\nGreen Incentives Continue\n\nMany companies cited regional green fuel regulations among the main reasons for moving ahead with investments.\n\nThe European Union's FuelEU Maritime, which requires vessels to pay penalties for failing to achieve lower emissions, makes a business case for greener fleets, ship owners and fuel suppliers said. And the EU Emissions Trading System and voluntary initiatives provide further incentives.\n\nShip owners with dual-fuel vessels will likely use them on EU voyages to avoid paying FuelEU Maritime penalties, and some should also receive rewards for over-compliance, said Kenneth Tveter, an analyst at shipbroker Clarksons.\n\n\"The case for low-carbon fuels such as ammonia and methanol is still alive if you have a trade concentrated around Europe,\" he said.\n\nMajor Horn of Africa port Djibouti and OPEC member Gabon have also introduced levies on maritime emissions.\n\nAnd current momentum could see punitive regulations and incentive schemes introduced in other important shipping hubs soon.\n\nBritain, notably, has proposed to expand its emissions trading system to international shipping from 2028. And Turkey is considering a scheme similar to the EU's.\n\nSuch factors should drive demand for LNG, bio-LNG and biofuels over the next five years, said Nacho de Miguel, head of alternative fuels at bunker supplier Peninsula.\n\n\"Whilst the IMO's net-zero framework has been postponed, this does not change our strategy,\" he said.",
    "source_url": "https://www.marinelink.com/news/green-vessel-investments-continue-despite-535722",
    "source": "marinelink.com",
    "score": 304
  },
  {
    "id": 1771016346,
    "date": "2026-02-13",
    "title": "Fragmented Carbon Schemes Threaten Maritime Progress, Warns BAR Technologies",
    "summary": "BAR Technologies is urging immediate action toward a unified global carbon framework, warning that the proliferation of regional emissions trading schemes is placing unprecedented compliance pressure ...",
    "content": "BAR Technologies is urging immediate action toward a unified global carbon framework, warning that the proliferation of regional emissions trading schemes is placing unprecedented compliance pressure on the maritime sector and risks delaying progress on decarbonisation.\n\nWith multiple overlapping schemes now in effect or emerging, including the EU ETS, FuelEU Maritime, the IMO’s postponed Net-Zero Framework, and proposed Greenhouse gas Fuel Intensity (GFI) measures, shipowners are increasingly navigating a maze of conflicting obligations. According to the International Carbon Action Partnership (ICAP), over 30 emissions trading systems are now either in force or under development worldwide. This pattern of fragmentation reflects a broader global challenge: recent research from the Grantham Research Institute at the London School of Economics identified over 900 climate adaptation laws and policies adopted across 35 countries since the Paris Agreement. While this surge signals growing ambition, it also highlights the risks of uncoordinated frameworks that lead to implementation gaps, increased costs and regulatory friction across borders.\n\n“Carbon compliance is becoming more fragmented by the month,” said John Cooper, CEO of BAR Technologies. “Instead of building momentum behind a single global framework, we’re creating a patchwork of schemes with different baselines, rules and cost mechanisms. That creates confusion, inflates costs, and weakens the industry’s ability to invest in real, scalable solutions.”\n\nThe situation is further complicated by mechanisms such as the EU’s Carbon Border Adjustment Mechanism (CBAM), which went live on 1 January 2026. While not directly taxing shipping emissions, CBAM introduces indirect carbon costs into the trade system by pricing the embedded emissions of goods such as steel, aluminium, cement, and fertilisers, all of which are major seaborne cargoes.\n\n“CBAM is an example of how carbon pricing is now embedded into trade,” Cooper noted. “But it’s also a reminder that without multilateral alignment, we risk policy friction and commercial uncertainty on a global scale.”\n\nTo avoid paralysis through bureaucracy, BAR Technologies is calling for a single carbon policy, one that is globally agreed, fairly administered and financially transparent. The company continues to advocate for a bunker-level collection mechanism to fund climate-positive reinvestment, while avoiding the duplication and complexity of overlapping schemes.\n\n“While we await consensus on a unified framework, we cannot afford inaction,” Cooper continued. “We need technologies that work today, across regulatory zones and wind propulsion is leading that charge.”\n\nBAR Technologies’ WindWings®, already deployed on multiple vessels, offer immediate fuel savings and emissions reductions. Beyond near-term impact, they enhance the viability of alternative fuels like methanol and ammonia by reducing overall fuel demand.\n\n“Wind doesn’t need permission,” said Lauren Eatwell, Head of WindWings® at BAR Technologies. “It’s scalable, proven, and will be around forever. The industry has an opportunity to act now and lead, not wait to be regulated into action.”",
    "source_url": "https://www.hellenicshippingnews.com/fragmented-carbon-schemes-threaten-maritime-progress-warns-bar-technologies/",
    "source": "hellenicshippingnews.com",
    "score": 153
  },
  {
    "id": 1771016352,
    "date": "2026-02-13",
    "title": "UK Shipping Industry Urges Course Correction on UK ETS Expansion",
    "summary": "The UK Chamber of Shipping is whining about the UK Emissions Trading Scheme, set to include domestic maritime in 2026. They claim a lack of infrastructure and expensive alternative fuels will hurt competitiveness and island communities, conveniently ignoring the environmental impact of continued HFO use. Without ringfenced ETS revenues for green upgrades, this smacks of industry delaying tactics to avoid paying for their pollution.",
    "content": "The UK shipping industry has raised serious concerns over Government plans to extend the UK Emissions Trading Scheme (UK ETS) to domestic maritime from 1 July 2026, warning that the policy risks harming UK competitiveness, increasing costs for island communities and slowing progress towards net zero.\n\nOn Wednesday 11 February, the Draft Greenhouse Gas Emissions Trading Scheme (Amendment) (Extension to Maritime Activities) Order 2026, to extend the UK ETS to domestic maritime was passed by the Commons, following limited Parliamentary scrutiny and despite broad-reaching concerns.\n\nA spokesperson for the UK Chamber of Shipping said:\n\nThe sector supports the UK’s climate goals, but cannot deliver meaningful emissions reduction without the necessary fuels, infrastructure, and clear guidance in place – and unreasonable timeframes to implement flawed policy.\n\nPremature implementation risks higher costs for passengers and freight, with limited environmental gain. However, Government is pressing ahead, despite concerns from several quarters, leaving industry in an untenable position.\n\nTo ensure the scheme is both workable and fair, the industry has urged further scrutiny of the measures and called for:\n\nRingfencing maritime ETS revenues for shore power, grid upgrades, retrofits and clean fuels.\n\nTargeted protections for ferry‑dependent and island communities.\n\nAlignment with EU ETS rules to avoid double‑charging and carbon leakage.\n\nA phased or “monitor‑only” period until operators and ports have the systems required for compliance.\n\nIndustry representatives warn that the UK does not yet have viable fuel alternatives or the port energy capacity required to support low‑carbon operations. Alternative fuels currently cost four to five times more than conventional options, and most UK ports lack the shoreside electricity needed to power vessels in port.\n\nWithout Government reinvestment of ETS revenues, the scheme risks raising costs rather than driving emissions reduction.\n\nConcerns are particularly acute for island and lifeline ferry routes, where fare increases would disproportionately affect residents who rely on maritime transport for essential services, food supply and economic activity.\n\nDespite clear precedents such as protections for Scottish islands under the EU ETS, equivalent safeguards have not been committed for the UK.\n\nThe sector is also facing a compressed preparation period. The regulations were published on 13 January and come into force just six months later, requiring operators to finalise emissions monitoring plans, hire verifiers, upgrade systems and forecast financial impacts on extremely tight timelines, without full guidance or clarity from Government.\n\nIndustry warns this could divert investment away from decarbonisation projects already underway.\n\nThe Chamber is urging Government to:",
    "source_url": "https://www.hellenicshippingnews.com/uk-shipping-industry-urges-course-correction-on-uk-ets-expansion/",
    "source": "hellenicshippingnews.com",
    "score": 144
  },
  {
    "id": 1771016375,
    "date": "2026-02-13",
    "title": "Bad start to the New Year for the container shipping companies",
    "summary": "Container lines are increasing Energy Transition Surcharges to $170 per 40' dry container due to expanding EU ETS obligations. These ETS obligations now include methane and nitrous oxide, alongside CO2 emissions, increasing costs. Surcharges will be adjusted quarterly based on carbon prices, but expect further increases as FuelEU Maritime penalties begin.",
    "content": "BAROMETER. Spot freight rates began falling again in mid-January as pre-Chinese New Year transport capacity finally outstripped demand, despite the latter being sustained. Revenue per container fell for the shipping companies, while operating costs remain on an upward curve.Main developments\n\nIncrease in energy transition surcharges\n\nThe shipping companies have announced big increases in the European Union’s Energy Transition Surcharge (ETS) which is supposed to cover the costs generated by the EU Emissions Trading System (EU ETS) and the FuelEU Maritime regulations. The companies justified the increases by the heavier obligations placed on them by the EU ETS. From 2026 on, they have to include all their emissions in the scheme, compared to 75% in 2025 and 40% in 2024. The field of application of the system has also been widened to include methane and nitrogen protoxide, as well as CO². The companies also point out that they have incurred extra costs in meeting the requirements of the FuelEU regulation because of changing biofuel prices. The result is an average surcharge of USD170 for the transportation of a 40’ dry container from Asia to North Europe during the first quarter and USD250 for a 40’ reefer.\n\nThe surcharges are reviewed by the companies on a quarterly basis in line with changes in the price for a tonne of carbon. It has yet to be decided definitively if they...",
    "source_url": "https://market-insights.upply.com/en/bad-start-to-the-new-year-for-the-container-shipping-companies",
    "source": "market-insights.upply.com",
    "score": 111
  },
  {
    "id": 1771016380,
    "date": "2026-02-13",
    "title": "BAR Technologies Calls for Global Carbon Framework as Compliance Pressures Grow",
    "summary": "BAR Technologies urges a unified global carbon framework, citing the increasing complexity of regional emissions regulations. The EU's Carbon Border Adjustment Mechanism (CBAM) will indirectly impact shipping costs for major commodities. ECSA has requested the EU abandon regional rules upon the IMO's Net-Zero Framework (NZF) adoption, revealing compliance fatigue.",
    "content": "John Cooper is the CEO of BAR Technologies. Image Credit: BAR\n\nWind propulsion firm BAR Technologies is calling for a unified global carbon framework, warning that a growing patchwork of regional rules is increasing compliance pressure on shipowners.\n\nOverlapping measures such as the EU ETS, FuelEU Maritime and emerging IMO proposals are creating a complex regulatory landscape with differing baselines and cost structures, the firm said in an email statement on Thursday.\n\n“Carbon compliance is becoming more fragmented by the month,” John Cooper, CEO of BAR Technologies, said.\n\n“Instead of building momentum behind a single global framework, we’re creating a patchwork of schemes with different baselines, rules and cost mechanisms.”\n\nThe company also pointed to the EU’s Carbon Border Adjustment Mechanism (CBAM), which took effect on January 1, 2026, as an example of carbon pricing becoming embedded in global trade.\n\nWhile CBAM does not directly tax shipping emissions, it introduces indirect costs for major seaborne commodities.\n\nThe firm said it supports a globally agreed carbon policy with a bunker-level collection mechanism to fund climate investment while avoiding duplication across regional schemes.\n\n“While we await consensus on a unified framework, we cannot afford inaction,” Cooper said, adding that wind-assisted propulsion technologies can deliver immediate emissions reductions across regulatory regimes.\n\nThe European Community Shipowners' Associations (ECSA) has also urged the European Commission to withdraw EU shipping regulations once the IMO’s Net-Zero Framework (NZF) is adopted.",
    "source_url": "https://shipandbunker.com/news/world/929566-bar-technologies-calls-for-global-carbon-framework-as-compliance-pressures-grow",
    "source": "shipandbunker.com",
    "score": 105
  },
  {
    "id": 1771016372,
    "date": "2026-02-13",
    "title": "BBC Verify: Verified video shows collision between US Navy ships in Caribbean Sea",
    "summary": "This BBC report lacks crucial details on the US Navy ship collision's impact on marine pollution. Any resulting fuel spills or damage to sensitive marine ecosystems remains unaddressed. We await further investigation into potential violations of MARPOL regulations and associated environmental damage.",
    "content": "Fact-checking Farage and verifying US naval collision\n\nThomas Copeland\n\nBBC Verify Live journalist\n\nIt’s been a busy Friday here at BBC Verify, so here’s a quick recap of what we’ve been covering.\n\nOur fact-check team has been looking into a series of claims made by Reform UK leader Nigel Farage in an X post and during an interview for the BBC’s Political Thinking podcast.\n\nThey looked into how many stations in London run by transport body TfL have signs in foreign languages and dug into the data on the number of people living in the UK who don’t speak English.\n\nAnd after President Donald Trump revoked a landmark Obama-era ruling on greenhouse gases, BBC Verify has been assessing how that move might affect US emissions.\n\nElsewhere, our video verification team worked on the latest footage showing the impact of attacks on Ukraine and two videos showing a collision between US Navy ships in the Caribbean.\n\nThat’s all from the live page for this week. Our verification and eyewitness journalists will be here through the weekend working with teams across BBC News. BBC Verify Live will be back on Monday.\n\nVerifying videos of a fire in Gaza City\n\nKumar Malhotra\n\nBBC Verify senior journalist\n\nI’ve been looking at footage showing a fire blazing at a building in the northern part of the Gaza Strip, with fire crews and emergency workers in attendance.\n\nWe confirmed the location as being in the Rimal area of Gaza City by comparing the building, the neighbouring structures and the street layout to visible features on Google Earth.\n\nWe also matched the footage posted on social media today with images published by news agencies.\n\nIsraeli forces have pulled back from the Rimal area. A spokesman for Gaza’s Hamas-run Civil Defence agency said fire fighters had been battling the blaze for eight hours, and were facing major challenges due to a lack of resources.\n\nIt also said a number of people had to be treated for smoke inhalation.\n\nFootage shows collision between two US Navy ships in Caribbean Sea\n\nThomas Copeland\n\nBBC Verify Live journalist\n\nWe’ve just verified two videos showing a collision between two US Navy ships on Wednesday.\n\nTwo people reported minor injuries after the incident involving the Arleigh Burke-class destroyer USS Truxtun and Supply-class combat support ship USNS Supply.\n\nThe US military's Southern Command confirmed to the BBC the collision took place during an at-sea refuelling operation and both ships were able to continue safely afterwards.\n\nShip-tracking site MarineTraffic shows USNS Supply last broadcast its position on Thursday where it was docked at the port of Ponce in the US territory of Puerto Rico.\n\nSouthern Command said the incident was under investigation.\n\nBoth videos were taken aboard USNS Supply and we’ve been able to match key features on the vessels to publicly available images. These included the forward gun and hull number on USS Truxtun and the cranes, hoses and steps on USNS Supply.\n\nReverse images searches indicate that neither of these videos appeared online before yesterday.\n\nHow might Trump’s climate rollback affect US emissions?\n\nMark Poynting\n\nBBC Verify researcher\n\nThe US is currently the second-biggest emitter of planet-warming greenhouse gases - such as carbon dioxide - but its emissions have generally been falling over the past two decades. Many analysts say this is partly due to the “endangerment finding” made in 2009 when Barack Obama was president.\n\nThis concluded that greenhouse gases were a risk to public health - and was reversed by President Donald Trump yesterday.\n\nThe endangerment finding underpinned US efforts to cut emissions in transport, power stations and industry, according to the Environmental Protection Agency.\n\nThe consequences of Trump’s move for US emissions - and global climate change - are uncertain.\n\nPrevious modelling by independent researchers at Rhodium Group suggested rolling back US climate regulations would slow - but not reverse - emissions cuts.\n\nIt also appears unlikely that US car manufacturers will abandon all carbon-cutting efforts as they sell to other markets like the EU that have their own emissions rules.\n\n“American gas-guzzlers aren't popular abroad, and allowing them to become more polluting will further lessen their appeal,” said Chris Aylett, research fellow at Chatham House’s Environment and Society Centre.\n\nThe US Alliance for Automotive Innovation welcomed yesterday’s announcement but said the industry would stay “on a long-term path of emissions reductions and cleaner vehicles”.\n\nAccusations of Bangladesh election rigging circulate online without evidence\n\nShruti Menon and Shyadul Islam\n\nBBC Verify and BBC Bangla\n\nWe’ve been monitoring Bangladesh’s landmark elections for evidence of misinformation and false posts online.\n\nNow the outcome is clear - a landslide victory for the Bangladesh Nationalist Party - we’ve continued to look online for social posts challenging the validity of the results and scrutinising the evidence presented.\n\nOne in particular has caught our eye - which is being widely shared on Facebook and X - that claims to show evidence of vote rigging.\n\nIt shows a voter tally sheet at one counting station with crossed-out figures suggesting the results were changed after first being recorded.\n\nWe contacted the election duty officer whose signature appears on the sheet. He confirmed this was a genuine voter tally sheet and the corrections were a result of a clerical error while recording the vote.\n\nA later version of the sheet was submitted without the strikethroughs, he said.\n\nWe can’t say whether the alterations on this occasion were made as a result of manipulation or clerical error, but this post has clearly led to speculation about the conduct of the election on Bengali-language social media.\n\nHow much do Nato members spend on defence?\n\nAnthony Reuben\n\nBBC Verify senior journalist\n\nThe annual Munich Security Conference gets under way in Germany today - and is due to hear from US Secretary of State Marco Rubio tomorrow.\n\nRubio’s appearance follows recent tensions between the US and its Nato allies after President Donald Trump threatened Danish sovereignty with a pledge to annex Greenland.\n\nSpeaking to reporters as he left, Rubio insisted the US wasn't abandoning Europe, but said it should learn to defend itself.\n\nWhile the US defence budget has come down from 3.6% of its GDP in 2020 to an estimated 3.2% in 2025, spending by the rest of Nato, external - Canada and the European members - has gone up from 1.7% of their combined GDP in 2020 to an estimated 2.3% in 2025.\n\nHowever in cash terms, the US is still by far the biggest spender on defence, spending about $980bn (£720bn) last year, which was 62% of the Nato total.\n\nMembers are now committed to spending, external 3.5% of GDP on defence by 2035, with another 1.5% going on things like protecting critical infrastructure and ensuring civil preparedness.\n\nTrump’s climate comments at odds with overwhelming scientific consensus\n\nMark Poynting\n\nBBC Verify researcher\n\nOn Thursday US President Donald Trump revoked a landmark Obama-era ruling that greenhouse gases – such as carbon dioxide and methane – endanger public health.\n\n“This determination had no basis, in fact, had none whatsoever,” he said, later adding that the ruling had “nothing to do with public health”.\n\nDiana Furchtgott-Roth – who served in the first Trump administration – defended the move, telling BBC Radio 4’s Today programme “harms from climate change are risks for the future”.\n\nBoth claims run contrary to the overwhelming scientific consensus on the causes and impacts of climate change.\n\n“Human activities, principally through emissions of greenhouse gases, have unequivocally caused global warming,” states the UN’s Intergovernmental Panel on Climate Change (IPCC), external.\n\nIts reports are signed off by governments around the world as an accurate reflection of the science.\n\nRather than being risks for the future, the IPCC says, external human-caused climate change “is already affecting many weather and climate extremes in every region across the globe”, such as heatwaves or heavy rainfall events.\n\nThe IPCC adds, external that human-caused climate change – driven by greenhouse gas emissions - has “adversely affected the physical health of people globally” through extreme heat and climate-related diseases.\n\nHow many TfL stations in London have signs in foreign languages?\n\nLucy Gilder\n\nBBC Verify journalist\n\nDuring his interview on the BBC’s Political Thinking podcast, Reform UK’s Nigel Farage said: “If you go to parts of east London… you see London Underground stations with foreign languages next to them.”\n\nIn response to a 2025 Freedom of Information (FOI) request Transport for London (TfL) referenced two stations in the capital with dual-language signs, external.\n\nOne is Southall in west London which has Punjabi signage and the other is Whitechapel, east London, which has signs in Bengali.\n\nTfL said the Bengali sign was added to Whitechapel station following a request from the mayor of Tower Hamlets borough.\n\nMayor of London Sadiq Khan said on X at the time, external that the signage was about “recognising and celebrating the vital contribution Bangladeshi Londoners have made shaping the Tower Hamlets community”.\n\nTfl says the Southall Punjabi signs were there before it took over the station which is now part of the Elizabeth Line.\n\nIn the same FOI answer, TfL responded “no” when asked if it had plans for more stations to be bilingual.\n\nBBC Verify has asked TfL whether any more dual-language signs have been added to its stations since it provided that FOI response last year.\n\nSudanese army destroys paramilitary air defence system\n\nPeter Mwai and Richard Irvine-Brown\n\nBBC Verify\n\nVideo has emerged showing the moment a Sudanese army drone struck an air defence system used by the paramilitary Rapid Support Forces (RSF) in the Kordofan region of southern Sudan earlier this week.\n\nAlthough images claiming to show the destroyed Chinese-made FK-2000 system first appeared on social media on 10 February, the video published yesterday by the state news agency, tells us more about the attack.\n\nIn the last frames of the video we can make out the FK-2000 - its launching and transport platforms, plus its radars - before the camera cuts out.\n\nWe were able to match the long straight dirt track near a river bed, a small group of houses and what looks like a reservoir so we could confirm the strike was 3 miles (5km) west of al-Debeibat - a town people have mentioned on Sudanese social media as being close to the attack.\n\nThis puts it in the heart of the fighting between the government’s forces and RSF in the region. Both sides have been fighting a civil war across Sudan for almost three years.\n\nAnd we can be confident the attack was on 10 February because satellite images from that day show scrub burning at the same place.\n\nAnalysing footage of Russian strikes on Ukraine\n\nPaul Brown\n\nBBC Verify senior journalist\n\nWe've been reviewing footage following overnight attacks on Ukraine which local officials say have killed at least six people across the country.\n\nThe strikes reportedly targeted Odesa, Kramatorsk and Zaporizhzhia, and involved one missile and 154 drones, according to the Ukrainian Air Force.\n\nFootage filmed this morning in the city of Odesa shows widespread damage to a car dealership, where one building has been almost completely blown out, and a number of vehicles destroyed.\n\nAmong the vehicles seen in the video were Mitsubishis and Peugeots which meant we could narrow down our search for where the attack happened to the location of these dealerships.\n\nAt one point the video offers a very similar angle on the Peugeot showroom to one seen in a photograph on the outlet's official website.\n\nWelcome to BBC Verify\n\nRob Corp\n\nBBC Verify Live editor\n\nGood morning.\n\nWe start today by fact-checking claims made by Reform UK leader Nigel Farage about immigration.\n\nFarage posted a video on X yesterday, following comments made by billionaire Manchester United co-owner Sir Jim Ratcliffe, where the Reform UK leader wrote: “Jim Ratcliffe is right”.\n\nIn the video he claims that “one million people living in this country don’t speak any English at all”. He’s wrong, and we’ll bring you more shortly on what we know.\n\nElsewhere, there’s been another night of drone and missile attacks across Ukraine. At least six people were killed across the country, according to officials. We’re verifying footage showing the aftermath of one attack on the southern Ukrainian city of Odesa.\n\nUS Secretary of State Marco Rubio is expected to tell European leaders the continent must learn to defend itself when he visits the Munich Security Conference which gets under way today. We’re looking at what Europe’s Nato members spend on defence.",
    "source_url": "https://www.bbc.com/news/live/c1kgn2pjpyxt",
    "source": "bbc.com",
    "score": 96
  },
  {
    "id": 1771016391,
    "date": "2026-02-13",
    "title": "World largest battery electric ship begins harbour trials in Tasmania",
    "summary": "Incat's 130-metre battery-electric ferry, \"Hull 096,\" began harbour trials, a first for a vessel of this size. The trials will assess the viability of large-scale electric propulsion under real-world commercial conditions. Despite the hype, dirtiestships.com awaits data on the vessel's lifecycle carbon intensity versus conventional ferries.",
    "content": "Subscribe to our free newsletter today to keep up to date with the latest transportation and logistics news.\n\nA 130 metre vessel has quietly shifted the trajectory of commercial maritime transport. Hull 096, built by Incat Tasmania, began harbour trials on the River Derwent, becoming the largest battery electric ship ever to move under its own propulsion.\n\nThe milestone marks the first time a vessel of this scale and passenger vehicle capacity has operated solely on battery power. For an industry under mounting pressure to decarbonise, the significance extends far beyond southern Australia.\n\n“This is the moment where the ship truly comes alive,” Incat Chairman Robert Clifford said as the vessel undertook its first controlled movements. “Moving Hull 096 under its own battery electric power is a world first at this scale and confirms that electric propulsion is viable for large commercial vessels.”\n\nThe harbour trials signal the transition from construction to operational testing, a phase that will determine how convincingly electric propulsion can perform in real world commercial conditions.\n\nTesting the limits of large scale electric propulsion\n\nHarbour trials are a structured process. Crews test propulsion systems, manoeuvrability, control integration and onboard operational performance. For Hull 096, those tests carry added scrutiny. Scaling battery systems to power a vessel of 130 metres represents a technical leap for shipbuilders accustomed to diesel driven ferries and hybrid systems.\n\nUnlike smaller electric craft that operate on short commuter routes, Hull 096 is designed for significant passenger and vehicle throughput. Its propulsion system must deliver not only emissions free movement but also reliability, redundancy and performance consistent with commercial ferry operations.\n\nEngineers will evaluate how propulsion and steering respond under varying loads, how energy management systems balance power demand, and how onboard systems interact when running entirely on battery supply. The objective is not symbolic success but operational proof.\n\nElectric propulsion at this size requires extensive battery capacity, advanced power management and thermal control systems capable of sustaining high output without compromising safety. The trials will test those systems in dynamic harbour conditions where wind, current and vessel traffic introduce variables that static dockside testing cannot replicate.\n\nThe fact that the vessel has now moved under its own stored energy demonstrates that large scale electrification is no longer theoretical. It is operational.\n\nA signal to a decarbonising maritime industry\n\nShipping accounts for a significant share of global greenhouse gas emissions, and regulators and cargo owners alike are pressing operators to accelerate decarbonisation. While alternative fuels such as methanol and ammonia remain under development, battery electric propulsion offers a commercially available pathway for specific routes, particularly high frequency ferry services.\n\nHull 096 represents a case study in how established shipbuilders are adapting to that shift. Incat Tasmania has long specialised in fast ferries. The move toward full electrification reflects both technological maturity and market demand.\n\nThe vessel is scheduled for delivery to South America following completion of its testing and commissioning program. That deployment will place one of the most advanced electric ships into an operational environment where passenger transport volumes and environmental expectations continue to rise.\n\nFor operators, the economic equation is central. Electric vessels promise lower fuel costs over time, reduced maintenance complexity compared with internal combustion engines and insulation from fossil fuel price volatility. However, those advantages must offset the upfront capital required for battery systems and charging infrastructure.\n\nThe harbour trials therefore serve not only as a technical milestone but also as a commercial signal. If Hull 096 performs as expected, it strengthens the case for electric propulsion in larger classes of vessels.\n\nThe broader implication is competitive. Shipyards that demonstrate competence in battery integration and electric system management will be positioned to capture a growing share of new build contracts as environmental regulation tightens.\n\nFor now, the River Derwent has become a proving ground. The sight of a 130 metre vessel moving silently under battery power may appear incremental to casual observers. Within boardrooms and design offices across the maritime sector, it will be read as evidence that the electrification of large commercial vessels has moved from ambition to application.\n\nSources",
    "source_url": "https://tlimagazine.com/news/world-largest-battery-electric-ship-begins-harbour-trials-in-tasmania/",
    "source": "tlimagazine.com",
    "score": 95
  },
  {
    "id": 1771016365,
    "date": "2026-02-13",
    "title": "Trump Unveils White House Maritime Action Plan to Restore U.S. Seapower",
    "summary": "Trump's Maritime Action Plan aims to revitalize US shipbuilding, which currently produces less than 1% of commercial vessels. The plan proposes vessel fees and zones, but its success hinges on Congressional funding. Without real investment, this \"plan\" will fail to reduce reliance on foreign-flagged ships and their emissions.",
    "content": "America builds under 1% of commercial ships. The White House Maritime Action Plan bets on vessel fees, a trust fund, and zones, but Congress is the clock.\n\nBy Captain John Konrad (gCaptain) The United States builds less than one percent of the world’s commercial ships. Eleven shipyards have active build positions. Eight can build vessels over 400 feet. The supply base has consolidated to the point where many critical components come from a single supplier. And virtually all of America’s oceangoing trade, the goods that stock shelves, fuel refineries, and supply factories from coast to coast, moves on foreign-built, foreign-crewed, foreign-flagged vessels.\n\nTrump’s Maritime Action Plan (MAP), released today, is the most ambitious attempt to reverse that decline since the Merchant Marine Act of 1936. It was supposed to arrive 100 days ago. The maritime executive order President Trump signed on April 9, 2025, gave his team 210 days, a November deadline, to deliver the strategy. It took 310. The delay itself tells you something about the scale of what they’re attempting. The MAP is 35 pages. It is substantive. And it was signed not by the Secretary of Transportation, but by Marco Rubio as National Security Advisor and Russell Vought as OMB Director, which tells you how the administration sees this: not as transportation policy, but as a matter of national survival.\n\n“We will soon revitalize our once-great shipyards with hundreds of billions of dollars in new investments and people coming from all around the world…to build ships in America,” said President Trump in the introduction to the plan. “We want them built in America.”\n\nBut a plan is not a shipyard. And the distance between the two is measured in years, billions of dollars, and the willingness of Congress to actually fund what the White House is proposing.\n\nThis plan is dense, it’s well written, it has real value but agencies like the Maritime Administration are seriously under staffed while others, like the Navy’s NAVSEA are increadibly bloated so the question remains is it too ambitious? And if it all can be accomplish… how long will it take?\n\nWhat the Plan Actually Does\n\nThe MAP is organized around four pillars, but the real story is a handful of policy tools that, if enacted, would fundamentally change the economics of American shipbuilding. The document’s stated objective is worth quoting: not merely to grow the number of vessels built in the United States, but to reconstitute a maritime industrial base capable of self-sustained production. That distinction matters. This is not a subsidy program to build a few more ships. It is an attempt to rebuild an entire industrial ecosystem, shipyards, suppliers, workforce, design capacity, that can sustain itself once the federal scaffolding comes down. As I said, it’s ambitious.\n\nThree things stand out about the MAP’s approach. First, the sheer scale of proposed government investment and intervention… two things Republicans have traditionally avoided. Second, the interagency and allied coordination required to execute it, this plan reaches across OMB, NSC, Maritime Administration (MARAD), the Coast Guard, the Army Corps of Engineers, Commerce, State, Treasury and foreign governments simultaneously. Third, pages of deregulatory actions: a large section of this plan is dedicated to eliminating outdated rules, streamlining compliance, clarifying policies, reducing mandatory able seaman billet requirements, and revising merchant mariner training standards rooted in the IMO’s STCW convention. The MAP wants to cut red tape as aggressively as it spends money, and the deregulatory sections are among the most detailed in the document.\n\nThe industrial strategy is equally specific. The MAP calls for multi-year, multi-vessel procurement to give shipyards predictable order books. It pushes modular production, digital engineering and AI. It demands that performance requirements and ship design packages be fully developed before production begins, and that commercially available designs be used wherever possible. The metric it uses is revealing: reduce time to part and time to hull. That’s not bureaucratic language. That’s manufacturing language. And it signals an administration that understands shipbuilding is an industrial problem, not a policy problem.\n\nThe most consequential is a proposed fee on every foreign-built vessel entering a U.S. port, assessed by the weight of imported tonnage. At one cent per kilogram, the plan estimates this could generates roughly $66 billion over ten years. At 25 cents per kilogram, it approaches $1.5 trillion. That 23x range tells you this is a negotiating position, not a final number, but where the administration lands within it will determine whether the entire plan has a financial engine or just an aspiration. And it’s unclear if they can do it alone or will need cooperation from Congress. The proceeds could fund a new Maritime Security Trust Fund, which was originally proposed in the SHIPs Act. It would provide the dedicated, mandatory funding stream that American shipbuilding has never had. Without that fund, almost everything else in the document is a wish list waiting for annual appropriations that may never come.\n\nThe second major innovation is Maritime Prosperity Zones, 100 designated areas across the coasts, Great Lakes, river systems, Alaska, Hawaii, and U.S. territories where tax-advantaged private investment would flow into shipyards, supply chain companies, workforce training, and advanced manufacturing. The model is the Opportunity Zones from the 2017 tax reform. If well-designed, MPZs could redirect private capital into maritime industrial communities the way OZs reshaped real estate investment. If poorly designed, they become a tax shelter with a maritime label. The difference will be in the eligibility criteria and enforcement, neither of which is specified in the MAP, those details are left to the Secretary of Commerce and forthcoming legislation.\n\nThird, the MAP proposes extending the Capital Construction Fund, a proven tax-deferral tool that has helped vessel owners reinvest in new ships for decades, to shipyard owners. With $2.59 billion currently sitting in vessel-owner CCF accounts, this is a mechanism that works. Extending it to yards would let shipyard owners defer earnings into infrastructure, equipment, and modernization. It’s elegant and overdue.\n\nAnd fourth, there’s what the MAP calls the “Bridge Strategy”, a concept that solves the chicken-and-egg problem of rebuilding from near zero. Allied shipbuilders would build the first hulls of a multi-vessel contract in their home yards while simultaneously investing capital in U.S. shipyards they’ve purchased or partnered with. Later hulls migrate to American production. On the press call, officials pointed to the Finland icebreaker deal, which brings Finnish shipbuilding expertise to the U.S. for Arctic Security Cutters, as the prototype. If it scales to Korean and Japanese yards, this could be the mechanism that actually gets ships in the water while American capacity ramps up.\n\nThese four tools, the vessel fee, the Trust Fund, the MPZs, and the Bridge Strategy, are the plan’s center of gravity. But the supporting architecture matters too and critics we talked to pointed out that not much progress has been made public after Rodolphe Saadé, CEO of CMA CGA, offered to invest $20 Billion in US flagged ships. The MAP proposes a new Strategic Commercial Fleet for international trade routes, expanded cargo preference requirements, Title XI loan guarantee reform, and a land port maintenance tax on merchandise entering the United States through land ports of entry. It calls for recapitalizing the U.S. Coast Guard Yard in Baltimore and much needed refurbishment and modernizing the US Merchant Marine Academy, which it describes as requiring urgent attention. It includes an Arctic maritime strategy and frameworks for autonomous vessels, noting, with unusual candor, that no established procedures or protocols exist for verifying AI-driven navigational decisions. As I’ve stated twice already, it’s ambitious.\n\nThe Ready Reserve Fleet gets particular attention. The MAP acknowledges what everyone in the industry knows: the fleet’s vessels are aging, spare parts are increasingly difficult to source, maintenance costs are climbing, and recruiting qualified civilian mariners to crew activated vessels is a persistent challenge. Recapitalizing the RRF will require significant investment, and the MAP doesn’t pretend otherwise.\n\nThe document is comprehensive. But its fate rests on whether the Administration can find money in tarrifs and port fees directly or will have to wait for a lumbering and broken Congress the enact the revenue and incentive mechanisms that make the rest viable.\n\nI’n a White House meeting with senior Administration official this morning aI sked the question that I think matters most for execution: MARAD has roughly 200 people working on policy and is decades behind in publishing their annual review of shipyards. NAVSEA has 83,000. How does this plan get implemented? The officials pointed to new institutional architecture, a shipbuilding office at OMB focused on implementation, a shipbuilding directorate at NSC focused on policy, and Steve Carmel leading a Maritime Administration that the plan calls to fully resource. They described a “whole-of-government, whole-of-nation” approach where no single agency owns the mission. That’s the right answer in theory. In practice, interagency coordination is where Washington policies go to die, slowly, through turf battles and budget fights that nobody outside the Beltway ever sees.\n\nThe Hard Questions\n\nThe MAP deserves credit for what it gets right. The diagnosis is accurate. The policy toolkit is creative. The people are qualified. But several questions will determine whether this plan joins the long list of ambitious maritime proposals that went nowhere, or becomes the inflection point its authors intend.\n\nThe China contradiction. The MAP’s entire demand-signal architecture depends on generating revunue and making foreign-built ships more expensive to create market space for American-built ones. Yet the most powerful tool for making Chinese-built ships more expensive, the USTR actions, including service fees on foreign-built vehicle carriers and restrictions on certain maritime transport services, is currently suspended. The U.S. and China reached a deal on October 30, 2025, pausing these actions for one year starting November 10, 2025. The administration is simultaneously telling Congress to pass new fees on foreign vessels while pausing existing enforcement against the single largest source of subsidized foreign competition. Mentions of China in the MAP itself are pointed but sparse.\n\nWill allied shipbuilders actually come? The Bridge Strategy and the $150 billion in allied investment secured through trade negotiations depend on foreign shipbuilders, Korean, Japanese, Finnish, possibly Italian, being willing to build capacity inside a competitor nation. The Finland icebreaker deal is one data point. Scaling it requires allied corporations to see strategic benefit in establishing American production lines. What’s in it for Hyundai or Samsung Heavy Industries to help rebuild the shipbuilding capability they currently dominate? Access to U.S. defense contracts is one answer. Tax incentives through MPZs is another. But the question of whether allied capital follows allied rhetoric is one the MAP cannot answer by itself.\n\nWhere do the workers come from? The MAP’s workforce pillar contains two genuinely useful ideas, expanding the Military-to-Mariner pipeline so veterans can convert military sea service to merchant marine credentials, and allowing U.S. mariners on international routes to exclude foreign earned income the way any American working abroad can. Both are overdue and mariners will likely be most excited about the tax breaks. But the binding constraint isn’t training capacity, it’s labor supply competition. Every welder, pipefitter, and electrician who goes to a shipyard is one who doesn’t go to an LNG facility, a semiconductor fab, or a defense plant. In a labor market where every industrial sector in America is competing for the same tradespeople, the MAP’s training proposals are necessary but not sufficient. The shipyard CEOs reading this will notice that gap.\n\nBottom Line\n\nSea power has long been a cornerstone of America’s global leadership, the MAP’s own conclusion says as much, and it’s right. This is the most comprehensive federal maritime policy document since 1936, produced by people who understand both the problem and the politics. The policy toolkit, vessel fees, a Trust Fund, Prosperity Zones, the Bridge Strategy, a Strategic Commercial Fleet, is more creative and more aggressive than anything Washington has proposed for commercial shipbuilding in living memory.\n\nThe plan’s weakness is the same weakness that has killed every previous attempt: the gap between policy ambition and industrial execution. The MAP diagnoses the disease correctly. It prescribes the right medicine. But it doesn’t fill the prescription, that requires Congress, the FY2027 budget, and private capital willing to bet that the demand signals are real and durable.\n\nWhat to watch: the FY2027 budget details, the legislative package timing, the first Maritime Prosperity Zone designations, whether allied investment deals scale beyond Finland, and November 2026, when the China Section 301 suspension expires.\n\nThe MAP is the foundation. The FY2027 budget is the rebar. The legislative package is the concrete. Until all three are in place, this is the best plan American shipbuilding has had in 90 years, and a plan is all it is.\n\n“Investment in the maritime industrial base by both the U.S. government and the private sector has declined. As a result, American shipbuilding capacity has withered, less than 1% of new commercial ships are built in the United States, and government shipbuilding has suffered,” said Anna Kelly, White House Deputy Press Secretary, in a statement to gCaptain this morning. “President Trump is the first president in decades to recognize the critical importance of American maritime dominance, and he has done more than anyone to revitalize this vital sector for our national security.”\n\nBoth these statements are true and this is the frist Administration in recent memory that’s been willing to tell the full unvarnish truth about the decline of shipbuilding and the US Merchant Marine but have they bitten off more than out nation can chew? I sincerly hope not.",
    "source_url": "https://gcaptain.com/white-house-maritime-action-plan/",
    "source": "gcaptain.com",
    "score": 94
  }
]