[
  {
    "id": 1770793212,
    "date": "2026-02-11",
    "title": "LR Advisory partners with Geogas Trading to strengthen operational readiness for FuelEU pooling",
    "summary": "Geogas Trading hires LR Advisory to prepare for FuelEU Maritime compliance and emissions pooling. This partnership aims to mitigate commercial risks associated with the impending FuelEU regulations and associated penalties. Will Geogas reduce its carbon intensity, or simply shuffle credits to appear compliant?",
    "content": "The project will draw on LR Advisory’s regulatory, technical and commercial expertise to ensure Geogas Trading is well positioned with the first FuelEU Maritime compliance cycle and pooling opportunity approaching.\n\nLloyd’s Register (LR) Advisory has been appointed by Geneva-based LPG trader and shipowner Geogas to support the development of a multi-year emissions compliance plan and operationalisation of FuelEU pooling, as it prepares for the first compliance cycle of FuelEU Maritime.\n\nUnder the agreement, LR Advisory will provide expert insight into the commercial implications of current and forthcoming emissions regulations, alongside targeted knowledge transfer to build internal capability. The project will support Geogas Trading to design and implement its own FuelEU Maritime pooling structure and develop the operational frameworks and steps needed to execute pooling.\n\nLR Advisory will also work with the company to map and mitigate commercial risk of FuelEU , helping to shape a forward-looking compliance strategy that extends beyond the initial FuelEU cycle.\n\nLuke Shu, Technical Advisory Manager – Maritime Commercial Markets, LR Advisory, said: “FuelEU Maritime represents a fundamental shift in how emissions regulation affects commercial outcomes.\n\n“Charterers and shipowners are now directly exposed to incentives and penalties that influence day-to-day operational, chartering decisions and P&L. Our role is to support organisations like Geogas understand those impacts in detail and put practical structures in place that allow them to operate confidently and competitively as the regulatory landscape tightens.”",
    "source_url": "https://www.hellenicshippingnews.com/lr-advisory-partners-with-geogas-trading-to-strengthen-operational-readiness-for-fueleu-pooling/",
    "source": "hellenicshippingnews.com",
    "score": 113
  },
  {
    "id": 1770755293,
    "date": "2026-02-10",
    "title": "Caribbean Pushes for Coordinated Maritime Decarbonisation Strategy",
    "summary": "Caribbean nations are coordinating maritime decarbonisation efforts, but dirtiestships.com questions if this will truly reduce carbon intensity or just create bureaucracy. Calls for investment in alternative fuels and infrastructure must prioritize lifecycle emissions, not just \"greenwashing\" projects. We will monitor if these policies lead to a demonstrable reduction in heavy fuel oil (HFO) consumption and compliance with FuelEU Maritime regulations.",
    "content": "Caribbean policymakers and financiers have called for stronger regional coordination to advance maritime decarbonisation following an IMO roundtable in Port of Spain, Trinidad and Tobago.\n\nThe meeting, held on January 29-30 under the IMO's GreenVoyage2050 programme with the Global MTCC Network, brought together representatives from governments and maritime administrations, the IMO said in a press release last week.\n\nParticipants said shipping decarbonisation in the region will depend on coordinated policies, shared knowledge and investment-ready projects rather than isolated initiatives.\n\nDraft recommendations included harmonising national policies, strengthening capacity building and improving access to finance for clean fuels and port infrastructure.\n\n\"The IMO GHG Strategy sets a clear global direction, but implementation happens at country and regional level, Dr Jose Matheickal, Director of the IMO's Technical Cooperation and Implementation Division, said.\n\nHe said credible project pipelines are needed to allow finance to flow.\n\nDiscussions also covered fuel pathways, infrastructure needs and barriers to adoption, with findings from a Jamaica alternative fuels study presented as a regional example.\n\nThe second day focused on improving project bankability and mobilising finance for green maritime projects, with development banks outlining financing tools and risk-sharing approaches.\n\nDelegates also visited the ammonia-fuelled vessel Fortescue Green Pioneer during the event.",
    "source_url": "https://shipandbunker.com/news/am/821927-caribbean-pushes-for-coordinated-maritime-decarbonisation-strategy-at-imo-event",
    "source": "shipandbunker.com",
    "score": 149
  },
  {
    "id": 1769799019,
    "date": "2026-01-30",
    "title": "Why Canada, Iceland and Norway Must Show Leadership on Cutting Shipping’s Arctic Emissions",
    "summary": "Ahead of next month’s meeting of the International Maritime Organization’s (IMO) Pollution Prevention and Response committee (PPR 13, February 9-13), the Clean Arctic Alliance is calling on Canada, Ic...",
    "content": "Ahead of next month’s meeting of the International Maritime Organization’s (IMO) Pollution Prevention and Response committee (PPR 13, February 9-13), the Clean Arctic Alliance is calling on Canada, Iceland and Norway to demonstrate solidarity with Denmark and Greenland’s leadership by supporting a proposal to reduce black carbon emissions from international shipping in the Arctic.\n\nJoin today’s pre-PPR13 briefing on Zoom with the Clean Arctic Alliance: Black carbon, Scrubbers, Sewage and the Arctic\n\nDenmark, which represents Greenland at the International Maritime Organization, is proposing, along with France, Germany and the Solomon Islands a new mandatory measure on “polar fuels”, PPR 13-6, which would require that only cleaner fuels with low emissions of black carbon be used by ships sailing in the Arctic.\n\n“As Arctic leaders, Canada, Iceland and Norway must show their support for an Arctic fuel proposal which sets out the characteristics of fuels that would be considered suitable for use in the Arctic – so-called polar fuels – at the IMO in February”, said Dr Sian Prior, Lead Advisor to the Clean Arctic Alliance. “This is a chance for democratic Arctic coastal nations of the north Atlantic to show their leadership and green credentials by supporting one another in the efforts to clean-up air polluting emissions from international shipping.”\n\nSupport from Canada, Iceland and Norway is essential to follow up on the adoption of two emission control areas (in the Canadian Arctic and the Norwegian Sea), and approval of a further Northeast Atlantic emission control area (ECA)which is due to be adopted in 2026 and includes Iceland and Greenland’s waters. While the ECAs are important in terms of reducing SOx and NOx air pollution, they do not adequately reduce emissions of superpollutant black carbon which poses both a health and a climate risk in the Arctic.”\n\nLast October, the Nordic Council recommended that Nordic Governments take action to require that theses cleaner “polar” fuels be used in the Arctic, but so far, Denmark and Greenland are the only Nordic nations to co-sponsor the proposal for an Arctic fuel measure.\n\nCanada\n\nThe Nordic Council Recommendation does not address Canada, but as an Arctic nation, Canada’s support is equally necessary to reduce air pollution and the impact of Black Carbon on sea ice.\n\n“Canada has supported the need for regulating Black Carbon from shipping for many years at the IMO, and also in domestic climate and air pollution strategies”, said Andrew Dumbrille, Advisor to the Clean Arctic Alliance and Director of Equal Routes, a Clean Arctic Alliance member. “PPR 13 is a prime opportunity to put this into action. For the first time a globally binding measure can be developed which will clean the air for Indigenous and local communities, contribute to maintaining ice habitat for wildlife, safeguard harvest rights key for local food sovereignty, and urgently address the climate crisis in the Arctic.”\n\nIceland\n\nIn recent weeks, months and years, Iceland has repeatedly declared its support for Greenland’s rights for full sovereignty; rights which are threatened by the rapid loss of ice and glaciers in the Arctic.\n\n“It is vital that Iceland support this proposal from Denmark, Greenland and others which with a wide scope can improve air quality in Iceland’s waters and reduce black carbon emissions originating within Iceland’s Exclusive Economic Zone (EEZ) from settling onto sea- and land-ice in the Arctic – this pollution is speeding up melting, which in turn is contributing to the slowing down of the Atlantic Meridional Overturning Circulation”, said Arni Finnsson, Board Chair at the Iceland Nature Conservation Association.\n\nNote: Iceland deems possible Atlantic current collapse a security risk (Reuters)\n\nNorway\n\n“Norway has already introduced an Emission Control Area in the Norwegian Sea which will take effect from 1 March 2027, and has supported the adoption of the Nordic Council Recommendation on action by Nordic Governments on the use of polar fuels in the Arctic”, said Karoline Andaur, CEO of WWF Norway (WWF Verdens naturfond). “Norway should support the proposal from Denmark, Greenland and others which with a wide scope can improve air quality in Norwegian waters, reduce black carbon emissions originating within Norway’s EEZ settling onto sea- and land-ice in the Arctic, and reduce the threat of heavy fuel oil spills.”\n\nSource: Clean Arctic Alliance",
    "source_url": "https://www.hellenicshippingnews.com/why-canada-iceland-and-norway-must-show-leadership-on-cutting-shippings-arctic-emissions/",
    "source": "hellenicshippingnews.com",
    "score": 123
  },
  {
    "id": 1769795391,
    "date": "2026-01-30",
    "title": "K Line, MOL and MISC line up for next wave of Northern Lights CO2 carrier orders",
    "summary": "Northern Lights has handed out a fresh round of CO2 shipping business to three of Japan and Malaysia’s biggest blue‑chip owners.\n\nThe Oslo‑based CCS JV – owned by Equinor, TotalEnergies and Shell – ha...",
    "content": "Northern Lights has handed out a fresh round of CO2 shipping business to three of Japan and Malaysia’s biggest blue‑chip owners.\n\nThe Oslo‑based CCS JV – owned by Equinor, TotalEnergies and Shell – has awarded a long‑term time charter for one 12,000 cu m liquid CO2 carrier to a consortium of Kawasaki Kisen Kaisha (K Line) and MISC, with a second sister vessel set to go to the same pair in April 2026. In parallel, Mitsui OSK Lines (MOL) has secured two long‑term charters for another two newbuild CO2 carriers.\n\nThe first three vessels will each have 12,000 cu m cargo capacity, significantly lifting Northern Lights’ seaborne capacity beyond its initial 7,500 cu m trio and aligning with signed customer contracts and the project to lift transport and storage capability above 5m tonnes of CO2 per year. All four new ships will be owned by the respective shipowners.\n\nChina’s Dalian Shipbuilding Offshore (DSOC) and South Korea’s HD Hyundai Heavy Industries (HHI) have been tapped to build the vessels, with deliveries scheduled between the second half of 2028 and the first half of 2029.\n\n“We are pleased to significantly grow our transport capacity by adding vessels to our existing Northern Lights fleet,” said managing director Tim Heijn. “With an expanded fleet, we will be able to deliver on our commitments to our customers. It will also enable us to optimise operations and increase flexibility.”\n\nThe move follows the delivery of the 7,500 cu m Northern Pioneer, Northern Pathfinder and Northern Phoenix from DSIC/DSOC since late 2024, all managed by K Line under phase one of Norway’s Longship CCS project. A fourth identical vessel, owned and operated by Bernhard Schulte, will join in 2026.\n\nNorthern Lights began injecting liquefied CO2 for permanent subsea storage in August 2025 and already has commercial agreements with emitters including Yara, Ørsted and Stockholm Exergi.",
    "source_url": "https://splash247.com/k-line-mol-and-misc-line-up-for-next-wave-of-northern-lights-co%e2%82%82-carrier-orders/",
    "source": "splash247.com",
    "score": 46
  }
]